{
    "description": "Based on the provided JSON data profile, this dataset appears to be a job listings or vacancy database, likely from a Belgian employment platform. Here's a comprehensive summary:\n\nThe dataset contains 1,000 job listings, primarily focused on IT, engineering, and professional services positions. Key characteristics include:\n\n1. Job Types and Sectors:\n- Heavy emphasis on IT roles (Software Engineers, System Engineers, Data Analysts, IT Support)\n- Engineering positions\n- Professional and technical roles\n- Most positions are full-time (983 out of 1000)\n\n2. Geographic Distribution:\n- Primarily located in Belgium, with major cities like Antwerp, Brussels, Ghent, and Roeselare\n- Some positions in the Netherlands\n- Mix of urban and regional locations\n\n3. Employment Terms:\n- Predominantly permanent contracts (881 positions with \"onbepaalde duur\")\n- Salary ranges typically between €3,000-€5,000 monthly gross\n- Strong focus on full-time positions\n- Mix of direct employment and interim/recruitment agency placements\n\n4. Recruitment Process:\n- Multiple application methods (online, email, phone)\n- Mix of direct employer and recruitment agency listings\n- Structured application processes with CV requirements\n- Multilingual requirements (based on the presence of language skills data)\n\n5. Posting Characteristics:\n- All listings are active (\"ACTIEF\")\n- Published between 2024-2025\n- Detailed job descriptions and requirements\n- Includes company information and contact details\n\nThis appears to be a comprehensive professional job marketplace database, with a particular focus on technical and professional roles in the Belgian market, managed through both direct employers and recruitment agencies.",
    "columns": [
        {
            "column_name": "status",
            "p_missing": 0.0,
            "p_distinct": 0.001,
            "n_distinct": 1,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "ACTIEF": 1000
            },
            "description": "The 'status' column is a categorical field that is consistently populated across all 1,000 records with no missing values. It contains only a single unique value \"ACTIEF\" which appears in all records (100% of the dataset). This suggests it's likely a flag or state indicator that shows all job listings in the dataset are currently active or in an active state. The column appears to be well-maintained with complete data coverage."
        },
        {
            "column_name": "gepubliceerd",
            "p_missing": 0.0,
            "p_distinct": 0.001,
            "n_distinct": 1,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "true": 1000
            },
            "description": "The column 'gepubliceerd' is a Boolean field that is consistently populated across all 1,000 records with no missing values. It shows remarkably low variability, containing only one distinct value (\"true\") which appears in all records (100% of cases). This suggests the column likely indicates whether a job posting is published, but since all values are \"true\" in this dataset, it may represent a filtered view showing only published entries."
        },
        {
            "column_name": "gesloten",
            "p_missing": 0.0,
            "p_distinct": 0.001,
            "n_distinct": 1,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 1000
            },
            "description": "The column 'gesloten' is a Boolean field that appears in all 1,000 records with no missing values (0% null rate). It shows remarkably consistent data, containing only the value \"false\" across all entries, making it a uniform column with just one distinct value. This suggests it might be a flag or status indicator, possibly meaning \"closed\" in Dutch, though in this dataset all records are marked as not closed/false."
        },
        {
            "column_name": "aantalJobs",
            "p_missing": 0.0,
            "mean": 1.032,
            "p_distinct": 0.006,
            "max": 10,
            "n_distinct": 6,
            "type": "Numeric",
            "n_missing": 0,
            "std": 0.3783108762897508,
            "min": 1,
            "n": 1000,
            "value_counts_without_nan": {
                "1": 987,
                "2": 6,
                "3": 4,
                "6": 1,
                "5": 1,
                "10": 1
            },
            "description": "The 'aantalJobs' (number of jobs) column is a numeric field that appears in all 1,000 records with no missing values. It represents the number of job positions available for each job posting, ranging from 1 to 10 positions. The vast majority of postings (987 or 98.7%) are for single positions, while only a small number of postings advertise multiple vacancies: 6 postings have 2 positions, 4 have 3 positions, and there are individual postings with 5, 6, and 10 positions. The mean number of positions per posting is 1.032 with a standard deviation of 0.378, reflecting the strong skew toward single-position job postings."
        },
        {
            "column_name": "dubbels",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "The column 'dubbels' appears to be present in all 1,000 records with no missing values. It is classified as an \"Unsupported\" data type, which suggests it may contain complex or non-standard data structures that don't fit into common data types like numbers or strings. Without additional information about the actual values or content patterns in this column, it's difficult to make more specific conclusions about what 'dubbels' (which appears to be Dutch and might translate to \"doubles\" or \"duplicates\" in English) represents in this dataset."
        },
        {
            "column_name": "laatsteWijzigingDatum",
            "p_missing": 0.0,
            "p_distinct": 0.998,
            "max": "2025-09-02 18:15:46+00:00",
            "n_distinct": 998,
            "type": "DateTime",
            "n_missing": 0,
            "min": "2024-04-08 13:51:21+00:00",
            "n": 1000,
            "value_counts_without_nan": {
                "2025-08-29 00:05:05+00:00": 2,
                "2025-08-14 09:16:21+00:00": 2,
                "2025-06-18 06:29:22+00:00": 1,
                "2025-06-10 11:03:59+00:00": 1,
                "2025-07-15 11:35:07+00:00": 1,
                "2025-08-28 09:18:11+00:00": 1,
                "2025-08-01 15:09:12+00:00": 1,
                "2025-08-04 10:30:53+00:00": 1,
                "2025-08-31 08:58:12+00:00": 1,
                "2025-08-13 15:46:30+00:00": 1,
                "more ...": -1
            },
            "description": "The 'laatsteWijzigingDatum' (last modification date) column is a DateTime field that contains timestamps of when entries were last modified, with complete coverage across all 1,000 records (no missing values). The timestamps range from April 8, 2024, to September 2, 2025, and include both date and time information with UTC timezone offset (+00:00). The column shows high uniqueness with 998 distinct values (99.8% distinct), suggesting that most records have unique modification timestamps, though there are a few cases where multiple records share the same modification time (for example, two records each were modified on August 29, 2025, and August 14, 2025)."
        },
        {
            "column_name": "eerstePublicatieDatum",
            "p_missing": 0.0,
            "p_distinct": 0.998,
            "max": "2025-09-02 17:18:04+00:00",
            "n_distinct": 998,
            "type": "DateTime",
            "n_missing": 0,
            "min": "2019-03-04 13:43:11+00:00",
            "n": 1000,
            "value_counts_without_nan": {
                "2025-08-29 00:05:05+00:00": 2,
                "2025-08-14 09:16:21+00:00": 2,
                "2025-06-18 06:29:22+00:00": 1,
                "2025-06-10 11:03:59+00:00": 1,
                "2025-07-15 11:35:07+00:00": 1,
                "2025-08-27 18:18:02+00:00": 1,
                "2025-07-31 14:32:48+00:00": 1,
                "2025-08-04 10:15:44+00:00": 1,
                "2025-08-31 08:58:12+00:00": 1,
                "2025-07-09 16:46:23+00:00": 1,
                "more ...": -1
            },
            "description": "The 'eerstePublicatieDatum' (First Publication Date) column is a DateTime field that contains timestamps for when job postings were first published. The column is completely populated with no missing values across all 1,000 records, and contains 998 unique values, indicating very little duplication of publication dates. The timestamps range from March 4, 2019, to September 2, 2025, and include both date and time information with UTC timezone offset (+00:00). The high number of distinct values and minimal duplicates (only a few dates appear twice) suggests that job postings are published at various times throughout the day, making this a highly granular temporal identifier for each posting."
        },
        {
            "column_name": "prioriteit",
            "p_missing": 0.0,
            "p_distinct": 0.003,
            "n_distinct": 3,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "1": 456,
                "3": 440,
                "5": 104
            },
            "description": "The column 'prioriteit' (meaning 'priority' in Dutch) is a categorical field that appears in all 1,000 records with no missing values. It contains three distinct priority levels: 1, 3, and 5. The distribution shows that level 1 is most common with 456 occurrences (45.6%), followed closely by level 3 with 440 occurrences (44%), while level 5 is less frequent with 104 occurrences (10.4%). This appears to be a priority ranking system where lower numbers likely indicate higher priority items."
        },
        {
            "column_name": "deelDatabanken",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the profiling data, the 'deelDatabanken' column is present in all 1,000 records with no missing values (0% missing rate). The column type is listed as \"Unsupported,\" which suggests it may contain complex or non-standard data structures that don't fit into common data types. Without additional information about the actual values or structure of this column, I cannot make specific claims about what kind of data it contains, though the name suggests it might be related to partial or sub-databases (\"deel\" meaning \"part\" in Dutch)."
        },
        {
            "column_name": "jobPosting",
            "p_missing": 0.011,
            "p_distinct": 0.9989888776541962,
            "n_distinct": 988,
            "type": "Text",
            "n_missing": 11,
            "n": 1000,
            "value_counts_without_nan": {
                "{\"title\":\"Technisch projectingenieur energie\",\"description\":\"Ben jij het beu om vast te roesten achter een bureau? Zoek je **variatie**, verantwoordelijkheid en **vrijheid** in je job? Als jij houdt van techniek, zelf je planning regelt en je graag in het veld bewijst, lees dan zeker verder. **Geen prikklok**, wel vertrouwen.  \\n  \\n**Wat ga je doen?**  \\nAls **field engineer** ben jij de schakel tussen techniek, analyse en klantgerichte oplossingen. Als field service engineer:  \\n\\n\\n *  Analyseer je **technische problemen** op **locatie** en stel je structurele verbeteringen voor.\\n *  **Organiseer je zelf je agenda** en bepaal je eigen werkritme. Jij plant je week: soms één klant, soms vier. Geen dag is dezelfde.\\n *  **Start je installaties op** (commissioning) en voer je veiligheidscontroles uit, zodat alles draait zoals het hoort.\\n *  Zet je **meetcampagnes** op, stel je meetapparatuur in en trek je conclusies op basis van je data.\\n *  Stel je heldere rapporten op, werk je verbetervoorstellen uit en presenteer je die professioneel aan klanten.\\n *  Werk je nauw samen met engineering, service en sales, maar ga je ook geregeld solo op pad.\\n *  **Communiceer** je vlot en oplossingsgericht met klanten én collega’s.\\n\\n  \\n**Waar ga je werken?**  \\nJe komt terecht in een familiaal technisch bedrijf, actief in België en Nederland, waar eerlijkheid en wederzijds respect centraal staan. De sfeer is ontspannen, de structuur vlak en de werkplekken zijn proper en goed uitgerust. Je deelt je bureau met een andere field fngineer, maar je werk speelt zich vooral af bij klanten. Vrijheid, verantwoordelijkheid en vertrouwen? Check, check en check.\",\"hiringOrganization\":{\"name\":\"vind! Gent\",\"logo\":\"https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3899/mobileLogo.png\",\"sameAs\":\"http://www.vindeenjob.be/\",\"@type\":\"Organization\"},\"jobLocation\":[{\"address\":{\"addressCountry\":\"BE\",\"addressLocality\":\"MALDEGEM\",\"postalCode\":\"9990\",\"@type\":\"PostalAddress\"},\"@type\":\"Place\"}],\"employmentType\":[\"FULL_TIME\"],\"datePosted\":\"2025-08-14T09:16:21Z\",\"baseSalary\":{\"currency\":\"EUR\",\"value\":{\"minValue\":3300.0,\"maxValue\":6000.0,\"unitText\":\"MONTH\",\"@type\":\"QuantitativeValue\"},\"@type\":\"MonetaryAmount\"},\"@context\":\"https://schema.org/\",\"@type\":\"JobPosting\"}": 2,
                "more ...": -1
            },
            "description": "Based on the profiling data, the 'jobPosting' column contains structured JSON data that represents detailed job posting information following the Schema.org JobPosting format. The column has very low missing data (1.1% missing values) and high uniqueness (99.9% distinct values), suggesting that most job postings are unique entries. The sample value shows that each posting includes comprehensive job details such as title, description, hiring organization information (including name and logo URL), job location, employment type, posting date, and salary information. The data appears to be well-structured and consistent, with only 11 missing entries out of 1,000 records."
        },
        {
            "column_name": "kaartTonen",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 827,
                "true": 173
            },
            "description": "The column 'kaartTonen' is a boolean field (true/false) that is present in all 1,000 records with no missing values. The vast majority of entries (827 or 82.7%) are set to \"false,\" while only 173 entries (17.3%) are set to \"true.\" Based on the column name which appears to be Dutch (\"kaart tonen\" meaning \"show map\" in English), this field likely indicates whether a map should be displayed for the job posting, perhaps to show the job location."
        },
        {
            "column_name": "referentie > id",
            "p_missing": 0.0,
            "mean": 71389769.863,
            "p_distinct": 1.0,
            "max": 71848246,
            "n_distinct": 1000,
            "type": "Numeric",
            "n_missing": 0,
            "std": 885774.3970730664,
            "min": 59112381,
            "n": 1000,
            "value_counts_without_nan": {
                "71415350": 1,
                "71805376": 1,
                "71704833": 1,
                "71760320": 1,
                "71590684": 1,
                "71499007": 1,
                "71805336": 1,
                "71743338": 1,
                "71758194": 1,
                "71405948": 1,
                "more ...": -1
            },
            "description": "The 'referentie > id' column contains unique numeric identifiers, with all 1,000 records having distinct values ranging from 59,112,381 to 71,848,246. The column has no missing values and appears to serve as a unique identifier or reference number for each record. With a mean value of approximately 71.4 million and a standard deviation of about 885,774, the IDs are clustered in a relatively narrow range considering their magnitude, suggesting these could be sequentially or systematically assigned identifiers."
        },
        {
            "column_name": "referentie > uuid",
            "p_missing": 0.0,
            "p_distinct": 1.0,
            "n_distinct": 1000,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "23c5c90a-aa13-4a3d-805f-0f2d5a8ad9af": 1,
                "71c206d0-f81d-461e-b743-25f7ae285695": 1,
                "b992f53d-a468-4d3e-9620-64d57bedeef6": 1,
                "185dba1e-8f3d-47e3-be73-e54a9312fafd": 1,
                "32e5146a-9e60-4a58-8a8b-e68ba67bc61d": 1,
                "ad270801-cc01-43d2-ae45-132b7b76ec3e": 1,
                "2cd34f23-2690-438c-8e95-56f2a73fa0ee": 1,
                "7e11c6b7-2529-4b07-9dfa-f476a45795cb": 1,
                "f853f7ae-6c44-47f4-9da0-b5666b2e36be": 1,
                "ab581eee-2502-4865-b8bd-cd4f3135f80d": 1,
                "more ...": -1
            },
            "description": "The 'referentie > uuid' column contains unique identifier strings in UUID (Universally Unique Identifier) format. It is a complete dataset with no missing values across all 1,000 records, and every entry is unique (100% distinct values). The UUIDs follow the standard format of 32 hexadecimal characters separated by hyphens (e.g., \"23c5c90a-aa13-4a3d-805f-0f2d5a8ad9af\"). This column appears to serve as a reliable primary key or unique identifier for each record in the dataset."
        },
        {
            "column_name": "functie > naam",
            "p_missing": 0.0,
            "p_distinct": 0.821,
            "n_distinct": 821,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "IT Support Engineer": 15,
                "System Engineer": 12,
                "Data Engineer": 6,
                "Data Analyst": 6,
                "Network Engineer": 6,
                "Process Engineer": 6,
                "Software Engineer": 5,
                "Python Developer": 5,
                "Technical Support Engineer": 4,
                "Digital Functional Analyst": 4,
                "more ...": -1
            },
            "description": "The column 'functie > naam' appears to contain job titles or function names, with 100% completion rate (no missing values) across all 1,000 records. It shows high variability with 821 unique values (82.1% distinct), suggesting a diverse range of job positions in the dataset. The most frequent job title is \"IT Support Engineer\" appearing 15 times, followed by \"System Engineer\" with 12 occurrences, while positions like \"Data Engineer,\" \"Data Analyst,\" \"Network Engineer,\" and \"Process Engineer\" each appear 6 times. The data appears to be heavily focused on technical and IT-related positions based on the most common entries shown in the value counts."
        },
        {
            "column_name": "functie > omschrijving > html",
            "p_missing": 0.0,
            "p_distinct": 0.939,
            "n_distinct": 939,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "<p><strong data-start=\"209\" data-end=\"254\">Jouw rol als System Engineer</strong></p> \n<p><span lang=\"NL\">Afhankelijk van je ervaring werk je mee aan projecten zoals migraties, automatisatie of het beheren van cloud- en on-prem infrastructuur. Je komt terecht in boeiende IT-omgevingen en werkt samen met collega's en klanten om alles vlot en veilig te laten draaien.</span></p> \n<p><span lang=\"NL\"><strong>Kernverantwoordelijkheden:</strong></span></p> \n<ul> \n<li><span lang=\"NL\">Beheren en optimaliseren van Windows Server-omgevingen.</span></li> \n<li><span lang=\"NL\">Installeren en onderhouden van virtualisatieplatformen (zoals VMware, Hyper-V, Proxmox).</span></li> \n<li><span lang=\"NL\">Active Directory, DNS, DHCP en Group Policy beheren en finetunen.</span></li> \n<li><span lang=\"NL\">Automatiseren en configuratiebeheer van taken via scripting (PowerShell, Bash, Python).</span></li> \n<li><span lang=\"NL\">Ondersteunen bij cloudprojecten (Azure, AWS, GCP).</span></li> \n<li><span lang=\"NL\">Updates, migraties en monitoring uitvoeren met moderne tools.</span></li> \n<li><span lang=\"NL\">Meewerken aan hybride infrastructuur, inclusief endpointbeheer.</span></li> \n<li><span lang=\"NL\">Documenteren van de infrastructuur en kennis delen met je team.</span></li> </ul>": 6,
                "more ...": -1
            },
            "description": "Based on the profiling data, 'functie > omschrijving > html' is a text column that contains HTML-formatted job descriptions, with 100% completeness (no missing values) across 1,000 records. The column shows high uniqueness with 93.9% distinct values (939 unique descriptions), suggesting that most job postings have customized descriptions. The data appears to be structured in HTML format, including HTML tags like <p>, <strong>, and <ul> for formatting, with content typically describing job roles, responsibilities, and requirements. The example shown in the value counts indicates that the descriptions are detailed and professionally formatted, often including section headers, bullet points, and language specifications (with 'lang' attributes), primarily used for technical job postings."
        },
        {
            "column_name": "functie > omschrijving > plainText",
            "p_missing": 0.0,
            "p_distinct": 0.928,
            "n_distinct": 928,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Jouw rol als System Engineer Afhankelijk van je ervaring werk je mee aan projecten zoals migraties, automatisatie of het beheren van cloud- en on-prem infrastructuur. Je komt terecht in boeiende IT-omgevingen en werkt samen met collega's en klanten om alles vlot en veilig te laten draaien. Kernverantwoordelijkheden: Beheren en optimaliseren van Windows Server-omgevingen. Installeren en onderhouden van virtualisatieplatformen (zoals VMware, Hyper-V, Proxmox). Active Directory, DNS, DHCP en Group Policy beheren en finetunen. Automatiseren en configuratiebeheer van taken via scripting (PowerShell, Bash, Python). Ondersteunen bij cloudprojecten (Azure, AWS, GCP). Updates, migraties en monitoring uitvoeren met moderne tools. Meewerken aan hybride infrastructuur, inclusief endpointbeheer. Documenteren van de infrastructuur en kennis delen met je team.": 6,
                "more ...": -1
            },
            "description": "Based on the profiling data, 'functie > omschrijving > plainText' is a text column that contains detailed job descriptions in plain text format. The column is fully populated with no missing values (p_missing = 0.0) across all 1,000 records. It shows high variability in its content, with 928 unique descriptions (92.8% distinct values), suggesting that most job postings have unique descriptions. The sample value shown indicates that these descriptions are comprehensive, detailing roles, responsibilities, and requirements in Dutch language, with some descriptions being reused across multiple listings (as evidenced by the most common description appearing 6 times). The column appears to be used for storing the main job posting content in a plain text format, making it suitable for text analysis and search functionality."
        },
        {
            "column_name": "functie > omschrijving > markdown",
            "p_missing": 0.0,
            "p_distinct": 0.93,
            "n_distinct": 930,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "**Jouw rol als Linux System Engineer**\n\nAfhankelijk van je ervaring werk je aan projecten in o.a. healthcare, finance, overheid en energie. Denk aan:\n\n *  Beheer en optimalisatie van Linux-servers (Debian, Ubuntu, RHEL, AlmaLinux).\n *  Automatisatie van provisioning & configuratie via Bash, Python, Ansible of Puppet.\n *  Opzetten en beheren van CI/CD pipelines en containerized workflows (Docker, Podman).\n *  Meewerken aan cloud- en hybrid cloudomgevingen (AWS, Azure, GCP).\n *  Uitvoeren van systeemupgrades, patchmanagement en hardening.\n *  Troubleshooting en performance tuning met tools zoals journalctl, htop, iostat, netdata.\n *  Versiebeheer en documentatie in Git, Wiki of Markdown.\n *  Advies geven over systeeminrichting, beveiliging en schaalbaarheid.": 6,
                "more ...": -1
            },
            "description": "Based on the profiling data, the 'functie > omschrijving > markdown' column is a text field that contains job descriptions formatted in Markdown syntax. The column is fully populated (0% missing values) and highly diverse, with 930 unique values across 1,000 records (93% distinct values). The example value shown suggests that this column contains detailed job role descriptions, including responsibilities, technical requirements, and work activities, structured with Markdown formatting elements such as bullet points and headers. The high distinctiveness of the values indicates that most job descriptions are uniquely written rather than using standardized templates."
        },
        {
            "column_name": "functie > arbeidscircuit > code",
            "p_missing": 0.0,
            "p_distinct": 0.012,
            "n_distinct": 12,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "G": 776,
                "IV": 102,
                "Z": 38,
                "CONTRACTONB": 29,
                "TV": 17,
                "T": 17,
                "I": 13,
                "VU": 3,
                "FL": 2,
                "V": 1,
                "Q": 1,
                "GB": 1
            },
            "description": "The column 'functie > arbeidscircuit > code' is a categorical field that is consistently populated across all 1,000 records with no missing values. It contains 12 distinct code values, with 'G' being the overwhelmingly dominant code appearing in 776 records (77.6% of entries), followed by 'IV' (102 entries) and 'Z' (38 entries) as the next most common codes. The remaining codes (CONTRACTONB, TV, T, I, VU, FL, V, Q, and GB) appear less frequently, with some occurring only once. The low distinct value ratio (0.012 or 1.2%) indicates this is a highly standardized coding system with a limited set of possible values."
        },
        {
            "column_name": "functie > arbeidscircuit > label",
            "p_missing": 0.0,
            "p_distinct": 0.012,
            "n_distinct": 12,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Gewoon contract.": 776,
                "Interim met optie 'vast werk'": 102,
                "Zelfstandige activiteit": 38,
                "Contractueel onbepaalde duur": 29,
                "Tijdelijke job (met optie vast)": 17,
                "Tijdelijke job.": 17,
                "Interimcontract.": 13,
                "Vaste job bij het uitzendkantoor": 3,
                "Een flexijob is een bijverdienste en staat open voor iedereen die, reeds 3 kwartalen geleden, minstens 4/5 bij een andere werkgever, uit een andere sector, in vast dienstverband werkt.": 2,
                "Studentenjob.": 1,
                "Vervangingscontract brugpensioen - Voorwaarden: uitkeringsgerechtigd werkloos of schoolverlater in wachttijd zijn.": 1,
                "Beperkte tewerkstelling <13 uren/week": 1
            },
            "description": "Based on the profiling data, 'functie > arbeidscircuit > label' is a categorical column that describes the type of employment contract or work arrangement for job positions. The column has 100% completion rate (no missing values) across 1,000 records and contains 12 distinct categories. The most common employment type is \"Gewoon contract\" (regular contract) representing 77.6% of all entries, followed by \"Interim met optie 'vast werk'\" (temporary work with option for permanent position) at 10.2%. Other categories include self-employment, permanent contracts, temporary positions, and specialized arrangements like flex jobs and student positions. The distribution is notably skewed towards regular employment contracts, with some specialized categories appearing only once in the dataset."
        },
        {
            "column_name": "functie > arbeidscircuit > kortLabel",
            "p_missing": 0.0,
            "p_distinct": 0.012,
            "n_distinct": 12,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Vaste Job": 776,
                "Interim met optie \"vast werk\"": 102,
                "Zelfstandige activiteit": 38,
                "Contractueel onbepaalde duur": 29,
                "Tijdelijke job (met optie vast)": 17,
                "Tijdelijke job (niet via uitzendkantoren)": 17,
                "Interim Job (uitsluitend voor uitzendkantoren)": 13,
                "Vaste job bij het uitzendkantoor": 3,
                "Flexijob": 2,
                "Studentenjob": 1,
                "Vervanging brugpensioen": 1,
                "Beperkte tewerkstelling <13 uren/week": 1
            },
            "description": "The column 'functie > arbeidscircuit > kortLabel' represents the type of employment contract or work arrangement being offered in job postings. It is a categorical column with 100% completion rate (no missing values) across 1,000 entries and contains 12 distinct categories. The vast majority of positions (77.6%) are labeled as \"Vaste Job\" (permanent position), followed by \"Interim met optie 'vast werk'\" (temporary with possibility of permanent, 10.2%) and \"Zelfstandige activiteit\" (self-employed activity, 3.8%). The remaining categories include various forms of temporary, contractual, and specialized employment arrangements, with some categories appearing very rarely (just once) in the dataset, such as student jobs and bridge pension replacements."
        },
        {
            "column_name": "functie > arbeidscircuitLijn",
            "p_missing": 0.0,
            "p_distinct": 0.012,
            "n_distinct": 12,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Vaste Job": 776,
                "Interim met optie \"vast werk\"": 102,
                "Zelfstandige activiteit": 38,
                "Contractueel onbepaalde duur": 29,
                "Tijdelijke job (met optie vast)": 17,
                "Tijdelijke job (niet via uitzendkantoren)": 17,
                "Interim Job (uitsluitend voor uitzendkantoren)": 13,
                "Vaste job bij het uitzendkantoor": 3,
                "Flexijob": 2,
                "Studentenjob": 1,
                "Vervanging brugpensioen": 1,
                "Beperkte tewerkstelling <13 uren/week": 1
            },
            "description": "The column 'functie > arbeidscircuitLijn' represents the type of employment arrangement or work circuit for job positions, with 100% data completeness across 1,000 entries. It's a categorical field with 12 distinct values, where \"Vaste Job\" (permanent position) strongly dominates, accounting for 77.6% of all entries. The second most common category is \"Interim met optie 'vast werk'\" (temporary with possibility of permanent employment) at 10.2%, followed by \"Zelfstandige activiteit\" (self-employed activity) at 3.8%. The remaining categories, including various forms of temporary work, student jobs, and flexible arrangements, appear much less frequently, with some categories appearing only once in the dataset."
        },
        {
            "column_name": "opmaak > logo > url",
            "p_missing": 0.272,
            "p_distinct": 0.12225274725274725,
            "n_distinct": 89,
            "type": "Text",
            "n_missing": 272,
            "n": 1000,
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3769/mobileLogo.jpg": 102,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/4151/mobileLogo.png": 95,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/2970/mobileLogo.png": 59,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3258/mobileLogo.jpg": 50,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/4534/mobileLogo.png": 36,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3446/mobileLogo.png": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/2969/mobileLogo.png": 34,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/4618/mobileLogo.jpg": 31,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/1584/mobileLogo.jpg": 16,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3041/mobileLogo.jpg": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > logo > url' contains URLs pointing to company logo images hosted on VDAB's CDN (Content Delivery Network). Out of 1,000 entries, 27.2% (272) are missing values, while the remaining entries contain 89 distinct logo URLs. The URLs follow a consistent pattern, pointing to mobile-optimized logos (mobileLogo.jpg/png) stored in company-specific folders on the cdn.app-prd-cdn.aws.vdab-prd.be domain. The most frequently occurring logo URL appears 102 times, with the top two companies' logos accounting for nearly 20% of all non-missing values, suggesting some companies have multiple job listings using the same logo."
        },
        {
            "column_name": "opmaak > logo > altText",
            "p_missing": 0.272,
            "p_distinct": 0.12225274725274725,
            "n_distinct": 89,
            "type": "Text",
            "n_missing": 272,
            "n": 1000,
            "value_counts_without_nan": {
                "Logo Jobat": 102,
                "Logo Editx": 95,
                "Logo LGA IT": 59,
                "Logo ictjob": 50,
                "Logo Kwery": 36,
                "Logo Lagom Engineering": 35,
                "Logo LGA Engineering": 34,
                "Logo Spark HR": 31,
                "Logo Unique": 16,
                "Logo Vivaldis Interim": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > logo > altText' contains alternative text descriptions for company logos in job postings. From the analysis of 1,000 entries, 27.2% of the records are missing values. Among the non-missing values, there are 89 unique text entries, with the most common being \"Logo Jobat\" (102 occurrences), \"Logo Editx\" (95 occurrences), and \"Logo LGA IT\" (59 occurrences). The entries appear to follow a consistent format of \"Logo\" followed by the company or platform name, suggesting this field is used for accessibility purposes to describe logo images on job posting platforms."
        },
        {
            "column_name": "opmaak > h1TekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.10150891632373114,
            "n_distinct": 74,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#2f3535": 102,
                "#003187": 95,
                "#000000": 89,
                "#484848": 59,
                "#0f282f": 36,
                "#d27143": 35,
                "#eb980b": 34,
                "#322249": 31,
                "#0095db": 16,
                "#ffa300": 14,
                "more ...": -1
            },
            "description": "The column 'opmaak > h1TekstKleur' appears to contain hexadecimal color codes used for H1 (heading 1) text styling. Based on the profiling data, it has a moderate missing data rate of 27.1%, with 729 non-null values out of 1000 entries. The column contains 74 distinct color values, with the most common being \"#2f3535\" (dark gray), \"#003187\" (deep blue), and \"#000000\" (black), appearing 102, 95, and 89 times respectively. Other frequently used colors include \"#484848\" (gray) and \"#0f282f\" (dark teal), suggesting a preference for professional, darker color schemes in the heading text."
        },
        {
            "column_name": "opmaak > h2TekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.09602194787379972,
            "n_distinct": 70,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#2f3535": 102,
                "#000000": 97,
                "#003187": 95,
                "#2ec4b6": 59,
                "#0f282f": 36,
                "#d27143": 35,
                "#ef980c": 34,
                "#322249": 31,
                "#0095db": 16,
                "#ffa300": 14,
                "more ...": -1
            },
            "description": "The column 'opmaak > h2TekstKleur' appears to contain hexadecimal color codes used for h2 (heading level 2) text styling in the dataset. Out of 1,000 entries, approximately 27.1% are missing values, while the remaining entries consist of 70 unique color codes. The most frequently used colors are #2f3535 (dark gray), #000000 (black), and #003187 (dark blue), appearing 102, 97, and 95 times respectively. Other notable colors include #2ec4b6 (turquoise) and #0f282f (very dark cyan), suggesting a preference for professional and corporate color schemes in the heading text."
        },
        {
            "column_name": "opmaak > h3TekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.102880658436214,
            "n_distinct": 75,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#b7dbe7": 102,
                "#2f80ed": 95,
                "#2ec4b6": 59,
                "#000000": 52,
                "#f36d24": 50,
                "#0f282f": 36,
                "#d27143": 35,
                "#ef980c": 34,
                "#322249": 31,
                "#4c1a6b": 16,
                "more ...": -1
            },
            "description": "The column 'opmaak > h3TekstKleur' appears to contain hexadecimal color codes used for h3 heading text styling in the dataset. Out of 1,000 entries, 27.1% (271) of the values are missing. The column contains 75 unique color values, with the most common being '#b7dbe7' (102 occurrences), '#2f80ed' (95 occurrences), and '#2ec4b6' (59 occurrences). The colors range from black ('#000000') to various shades of blue, orange, and purple, suggesting this is used for styling purposes in what appears to be a job posting or website interface system."
        },
        {
            "column_name": "opmaak > linksTekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.07681755829903979,
            "n_distinct": 56,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#000000": 314,
                "#b7dbe7": 102,
                "#10a2be": 50,
                "#0f282f": 36,
                "#ef980c": 34,
                "#4c1a6b": 16,
                "#c56505": 14,
                "#616882": 13,
                "#004992": 13,
                "#8aa0c9": 12,
                "more ...": -1
            },
            "description": "The column 'opmaak > linksTekstKleur' appears to store hexadecimal color codes used for hyperlink text styling in the dataset. Out of 1,000 entries, 27.1% (271) are missing values, while the remaining entries contain 56 unique color codes. The most prevalent color is black (#000000), appearing in 314 records, followed by a light blue shade (#b7dbe7) in 102 records, and a turquoise color (#10a2be) in 50 records. The data suggests this column is used for defining the visual appearance of links, with a preference for neutral and blue-toned colors, which is typical for web design conventions."
        },
        {
            "column_name": "opmaak > bovenBalkTekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.01646090534979424,
            "n_distinct": 12,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#ffffff": 371,
                "#b7dbe7": 102,
                "#000000": 70,
                "#484848": 59,
                "#0f282f": 36,
                "#d27143": 35,
                "#9f9fc5": 31,
                "#004992": 13,
                "#f6f6f6": 7,
                "#672146": 3,
                "#463a2e": 1,
                "#001f5b": 1
            },
            "description": "The column 'opmaak > bovenBalkTekstKleur' appears to contain color codes in hexadecimal format (#RRGGBB) representing text colors used in the upper bar of some interface or design element. Out of 1,000 entries, 27.1% are missing values, and there are 12 distinct color codes used. The most prevalent color is white (#ffffff) appearing in 371 cases, followed by a light blue shade (#b7dbe7) with 102 occurrences and black (#000000) with 70 occurrences. The distribution suggests a strong preference for neutral colors, with white being the dominant choice, while some accent colors like brown (#d27143) and purple (#672146) are used less frequently."
        },
        {
            "column_name": "opmaak > bovenBalkAchtergrondKleur",
            "p_missing": 0.271,
            "p_distinct": 0.10425240054869685,
            "n_distinct": 76,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#2f3535": 102,
                "#2f80ed": 95,
                "#2ec4b6": 59,
                "#ffffff": 51,
                "#f36d24": 50,
                "#fff17c": 36,
                "#ef980c": 34,
                "#a61f69": 31,
                "#000000": 22,
                "#0095db": 16,
                "more ...": -1
            },
            "description": "The column 'opmaak > bovenBalkAchtergrondKleur' appears to contain hexadecimal color codes that specify background colors for a top bar element in the interface. Out of 1,000 entries, 27.1% are missing values, while the remaining entries consist of 76 unique color codes. The most frequently used colors are shades of gray (#2f3535, 102 occurrences), blue (#2f80ed, 95 occurrences), and teal (#2ec4b6, 59 occurrences), followed by white (#ffffff, 51 occurrences) and orange (#f36d24, 50 occurrences). This suggests the column is used for styling purposes, with a preference for neutral and cool tones in the design scheme."
        },
        {
            "column_name": "opmaak > onderBalkAchtergrondKleur",
            "p_missing": 0.271,
            "p_distinct": 0.09327846364883402,
            "n_distinct": 68,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#ffffff": 147,
                "#2f3535": 102,
                "#2f80ed": 95,
                "#2ec4b6": 59,
                "#f36d24": 50,
                "#ef980c": 34,
                "#0095db": 16,
                "#ffa300": 14,
                "#616882": 13,
                "#fff000": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > onderBalkAchtergrondKleur' appears to store background color values for a bottom bar element, using hexadecimal color codes. In a dataset of 1,000 entries, 27.1% of the values are missing, while the remaining entries contain 68 distinct color codes. The most common colors are white (#ffffff) appearing 147 times, dark gray (#2f3535) used 102 times, and blue (#2f80ed) occurring 95 times. Other frequently used colors include teal (#2ec4b6) and orange (#f36d24), suggesting a diverse but controlled color palette is being used across the dataset."
        },
        {
            "column_name": "opmaak > extraInformatieTekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.03429355281207133,
            "n_distinct": 25,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#000000": 408,
                "#2f3535": 102,
                "#484848": 59,
                "#0f282f": 36,
                "#d27143": 35,
                "#9f9fc5": 31,
                "#004992": 13,
                "#29d3df": 11,
                "#ffffff": 7,
                "#24402e": 6,
                "#333333": 3,
                "#d81a23": 2,
                "#6f1425": 2,
                "#4a4d4d": 2,
                "#00456e": 2,
                "#2bacde": 1,
                "#572932": 1,
                "#383639": 1,
                "#31363b": 1,
                "#00225f": 1,
                "#001f5b": 1,
                "#af9800": 1,
                "#0c2d83": 1,
                "#333f48": 1,
                "#3a4d89": 1
            },
            "description": "The column 'opmaak > extraInformatieTekstKleur' appears to store color codes in hexadecimal format (#RRGGBB) representing text colors for extra information sections. In a dataset of 1,000 entries, 27.1% of the values are missing, and there are 25 distinct color codes used. The most predominant color is black (#000000), appearing in 408 entries, followed by a dark gray (#2f3535) with 102 occurrences and a medium gray (#484848) with 59 occurrences. The color palette generally tends toward dark and neutral tones, though there are some instances of blues, reds, and one gold color, suggesting this is used for styling text in a way that maintains readability while allowing for some brand-specific customization."
        },
        {
            "column_name": "opmaak > extraInformatieAchtergrondKleur",
            "p_missing": 0.271,
            "p_distinct": 0.03017832647462277,
            "n_distinct": 22,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#ffffff": 418,
                "#f0efef": 102,
                "#f6f6f6": 45,
                "#fff17c": 36,
                "#ef980c": 34,
                "#eeeeee": 22,
                "#e7e3e2": 13,
                "#ea5a40": 11,
                "#f3f3f4": 11,
                "#d9f4fd": 9,
                "#f2f2f2": 9,
                "#f3f3f3": 4,
                "#009bdb": 3,
                "#f4f3f2": 3,
                "#fc4c02": 2,
                "#e30512": 1,
                "#ffed00": 1,
                "#667b69": 1,
                "#00ca88": 1,
                "#7c2855": 1,
                "#ffd923": 1,
                "#cccccc": 1
            },
            "description": "The column 'opmaak > extraInformatieAchtergrondKleur' appears to store background color values in hexadecimal format for extra information sections, likely used in job posting layouts. The column has a moderate missing data rate of 27.1% and contains 22 unique color values across 1,000 records. White (#ffffff) is overwhelmingly the most common color, used in 418 cases, followed by light gray (#f0efef) with 102 occurrences and another light gray shade (#f6f6f6) with 45 occurrences. While most colors are variations of white and gray, there are also some instances of more vibrant colors like yellow, orange, and blue, though these are used much less frequently. This suggests the column is primarily used for subtle, professional background styling with occasional use of accent colors."
        },
        {
            "column_name": "opmaak > bedrijfsInfoKnopTekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.015089163237311385,
            "n_distinct": 11,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#ffffff": 377,
                "#000000": 105,
                "#2f3535": 102,
                "#484848": 59,
                "#0f282f": 36,
                "#9f9fc5": 31,
                "#004992": 13,
                "#672146": 3,
                "#463a2e": 1,
                "#ffd923": 1,
                "#3a4d89": 1
            },
            "description": "The column 'opmaak > bedrijfsInfoKnopTekstKleur' appears to contain hexadecimal color codes that specify the text color for company information buttons. In a dataset of 1,000 entries, 27.1% of the values are missing, and among the non-missing values, there are 11 distinct color codes used. White (#ffffff) is predominantly used, appearing in 377 cases, followed by black (#000000) and dark gray (#2f3535) with 105 and 102 occurrences respectively. The remaining colors are various shades of gray, blue, purple, and brown, with some colors like #463a2e (brown) and #ffd923 (yellow) being used only once, suggesting these are custom implementations for specific cases."
        },
        {
            "column_name": "opmaak > bedrijfsInfoKnopAchtergrondKleur",
            "p_missing": 0.271,
            "p_distinct": 0.1083676268861454,
            "n_distinct": 79,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#b7dbe7": 102,
                "#2f80ed": 95,
                "#2ec4b6": 59,
                "#10a2be": 50,
                "#ffffff": 47,
                "#fff17c": 36,
                "#ef980c": 34,
                "#a61f69": 31,
                "#000000": 20,
                "#4c1a6b": 16,
                "more ...": -1
            },
            "description": "The column 'opmaak > bedrijfsInfoKnopAchtergrondKleur' appears to contain hexadecimal color codes that specify background colors for company information buttons. In a dataset of 1,000 entries, 27.1% of the values are missing, and there are 79 unique color codes used across the dataset. The most frequently used colors are shades of blue (#b7dbe7 and #2f80ed) and teal (#2ec4b6), with #b7dbe7 appearing 102 times and #2f80ed appearing 95 times. The data includes a range of colors from white (#ffffff) to black (#000000), suggesting this column is used for customizing the visual appearance of company information buttons on what appears to be a job posting or company profile interface."
        },
        {
            "column_name": "opmaak > sollicitatieKnopTekstKleur",
            "p_missing": 0.271,
            "p_distinct": 0.019204389574759947,
            "n_distinct": 14,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#ffffff": 376,
                "#2f3535": 102,
                "#000000": 69,
                "#484848": 59,
                "#0f282f": 36,
                "#d27143": 35,
                "#9f9fc5": 31,
                "#004992": 13,
                "#672146": 3,
                "#ff6e08": 1,
                "#463a2e": 1,
                "#ffd923": 1,
                "#012169": 1,
                "#3a4d89": 1
            },
            "description": "The column 'opmaak > sollicitatieKnopTekstKleur' appears to contain hexadecimal color codes that define the text color of application buttons in the interface. From the analysis of 1,000 entries, 27.1% of the values are missing, and there are 14 distinct color codes used. The most prevalent color is white (#ffffff) appearing in 376 cases, followed by a dark gray (#2f3535) with 102 occurrences and black (#000000) with 69 occurrences. The remaining colors are various shades of gray, blue, brown, and accent colors, with some colors appearing only once in the dataset. This suggests a preference for neutral, professional color schemes with white being the dominant choice for application button text."
        },
        {
            "column_name": "opmaak > sollicitatieKnopAchtergrondKleur",
            "p_missing": 0.271,
            "p_distinct": 0.11248285322359397,
            "n_distinct": 82,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#b7dbe7": 102,
                "#2f80ed": 95,
                "#2ec4b6": 59,
                "#000000": 53,
                "#10a2be": 50,
                "#fff17c": 36,
                "#ef980c": 34,
                "#a61f69": 31,
                "#0095db": 16,
                "#ffa300": 14,
                "more ...": -1
            },
            "description": "The column 'opmaak > sollicitatieKnopAchtergrondKleur' appears to store hexadecimal color codes for the background color of application buttons in the dataset. Out of 1,000 entries, 27.1% (271) are missing values, while the remaining entries contain 82 distinct color codes. The most frequently used colors are shades of blue (#b7dbe7 and #2f80ed) appearing 102 and 95 times respectively, followed by teal (#2ec4b6, 59 times), black (#000000, 53 times), and another blue shade (#10a2be, 50 times). The data suggests a preference for blue tones in application button styling, with some variation including yellow, orange, and purple shades being used less frequently."
        },
        {
            "column_name": "opmaak > hoofdingAchtergrondKleur",
            "p_missing": 0.271,
            "p_distinct": 0.00823045267489712,
            "n_distinct": 6,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "#ffffff": 664,
                "#dbdbde": 59,
                "#ff7070": 3,
                "#e30512": 1,
                "#667b69": 1,
                "#ff4b00": 1
            },
            "description": "The column 'opmaak > hoofdingAchtergrondKleur' appears to contain hexadecimal color codes for background header colors, with 27.1% of its values missing across the 1,000 records. The column has only 6 unique values, with white (#ffffff) being overwhelmingly dominant, appearing in 664 cases. The second most common color is a light gray (#dbdbde) with 59 occurrences, while the remaining colors (various shades of red, orange, and green) appear very rarely, with just 1-3 instances each. This suggests that most entries use a standard white header background, with occasional variations in color scheme."
        },
        {
            "column_name": "opmaak > hoofdingAfbeelding > url",
            "p_missing": 0.271,
            "p_distinct": 0.12208504801097393,
            "n_distinct": 89,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3770/header.jpg": 102,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4150/header.png": 95,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2973/header.png": 59,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3259/header.png": 50,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4533/header.png": 36,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3447/header.jpg": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2972/header.png": 34,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4619/header.jpg": 31,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/1583/header.jpg": 16,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3045/header.jpg": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > hoofdingAfbeelding > url' contains URLs pointing to header images used in job postings, hosted on VDAB's CDN (Content Delivery Network). In a dataset of 1,000 entries, 72.9% of records have a header image URL, while 27.1% (271 entries) are missing this information. There are 89 unique header image URLs in use, indicating some standardization across job postings. The most frequently used header image appears 102 times, with the top two images being used in 102 and 95 postings respectively. All URLs follow a consistent pattern, pointing to images stored in the 'vindeenjob/templates/vacatures' directory, with both .jpg and .png formats being used."
        },
        {
            "column_name": "opmaak > hoofdingAfbeelding > altText",
            "p_missing": 0.271,
            "p_distinct": 0.0013717421124828531,
            "n_distinct": 1,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "Hoofding afbeelding": 729
            },
            "description": "The column 'opmaak > hoofdingAfbeelding > altText' appears to be a categorical field containing alternative text for header images. In the dataset of 1,000 records, it has a relatively high missing rate of 27.1% (271 missing values), and among the non-missing values, there is only one unique value: \"Hoofding afbeelding\" which appears 729 times. This suggests that when the field is populated, it uses a standardized or default alternative text description for header images, showing very little variation in the content."
        },
        {
            "column_name": "opmaak > hoofdingAfbeeldingMobiel > url",
            "p_missing": 0.271,
            "p_distinct": 0.12208504801097393,
            "n_distinct": 89,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3770/mobileLogo.jpg": 102,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4150/mobileLogo.png": 95,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2973/mobileLogo.png": 59,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3259/mobileLogo.jpg": 50,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4533/mobileLogo.png": 36,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3447/mobileLogo.png": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2972/mobileLogo.png": 34,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4619/mobileLogo.jpg": 31,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/1583/mobileLogo.jpg": 16,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3045/mobileLogo.jpg": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > hoofdingAfbeeldingMobiel > url' contains URLs pointing to mobile-optimized header images hosted on VDAB's CDN (Content Delivery Network). In the dataset of 1,000 entries, 72.9% of records have a valid URL, while 27.1% (271 entries) are missing values. There are 89 distinct URLs in use, indicating some standardization in header images across job postings. The most commonly used mobile header image appears 102 times, with the URLs following a consistent pattern of \"https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/[ID]/mobileLogo.[jpg/png]\". These images appear to be part of vacancy templates, with both JPG and PNG formats being used."
        },
        {
            "column_name": "opmaak > hoofdingAfbeeldingMobiel > altText",
            "p_missing": 0.271,
            "p_distinct": 0.0013717421124828531,
            "n_distinct": 1,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "Mobiele hoofding afbeelding": 729
            },
            "description": "The column 'opmaak > hoofdingAfbeeldingMobiel > altText' appears to be a categorical field containing alternative text for mobile header images. In the dataset of 1,000 records, it has only one unique value (\"Mobiele hoofding afbeelding\"), which appears in 729 entries, while 271 entries (27.1%) are missing values. The low distinct value ratio (0.137%) and the presence of a single repeated value suggests this is a standardized alt text field used consistently across mobile header images when present."
        },
        {
            "column_name": "opmaak > signatuurAfbeelding > url",
            "p_missing": 0.271,
            "p_distinct": 0.12208504801097393,
            "n_distinct": 89,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3770/signatuur.jpg": 102,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4150/signatuur.png": 95,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2973/signatuur.png": 59,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3259/signatuur.png": 50,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4533/signatuur.png": 36,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3447/signatuur.png": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2972/signatuur.png": 34,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4619/signatuur.jpg": 31,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/1583/signatuur.jpg": 16,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3045/signatuur.jpg": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > signatuurAfbeelding > url' contains URLs pointing to signature images hosted on VDAB's CDN (Content Delivery Network). Out of 1,000 entries, 72.9% have valid URLs while 27.1% (271 entries) are missing values. There are 89 distinct URLs in use, with the most common signature image being used 102 times. The URLs follow a consistent pattern (https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/{id}/signatuur.{extension}), with images stored in either JPG or PNG format. This appears to be a field used for branding or visual identification purposes in job postings."
        },
        {
            "column_name": "opmaak > signatuurAfbeelding > altText",
            "p_missing": 0.271,
            "p_distinct": 0.0013717421124828531,
            "n_distinct": 1,
            "type": "Categorical",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "Signatuur afbeelding bedrijf": 729
            },
            "description": "The column 'opmaak > signatuurAfbeelding > altText' is a categorical field that contains alternative text for signature images, presumably used for accessibility purposes. In the dataset of 1,000 records, 27.1% of the entries are missing values, while the remaining 729 entries all contain the same text value \"Signatuur afbeelding bedrijf\" (meaning \"Company signature image\" in Dutch). This column has only one unique value when populated, suggesting it's a standardized alt text description used consistently across all signature images in the system."
        },
        {
            "column_name": "opmaak > signatuurBedrijfsUrl",
            "p_missing": 0.271,
            "p_distinct": 0.12071330589849108,
            "n_distinct": 88,
            "type": "Text",
            "n_missing": 271,
            "n": 1000,
            "value_counts_without_nan": {
                "http://www.jobat.be/nl/": 102,
                "https://editx.eu/nl/it-jobs": 95,
                "https://it.lga.jobs/": 59,
                "https://www.ictjob.be/nl/": 50,
                "https://www.kwery.be/": 36,
                "https://www.lagom.jobs/nl": 35,
                "http://www.engineering.lga.jobs/": 34,
                "http://www.sparkjobs.be/": 31,
                "https://www.unique.be/": 16,
                "http://www.actief.be/nl": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > signatuurBedrijfsUrl' contains website URLs associated with job postings, with 72.9% of the 1,000 entries containing valid data (271 missing values). The column shows a moderate level of diversity with 88 unique URLs (12.1% distinct values). The most common URL is \"http://www.jobat.be/nl/\" appearing 102 times, followed by \"https://editx.eu/nl/it-jobs\" with 95 occurrences. The data suggests these are primarily job board and recruitment company websites, with a notable presence of IT and engineering recruitment platforms among the top URLs. The pattern of URLs indicates this column likely represents the source website or recruiting platform associated with each job posting."
        },
        {
            "column_name": "opmaak > vacatureTemplateId",
            "p_missing": 0.271,
            "mean": 3573.6941015089164,
            "p_distinct": 0.12208504801097393,
            "max": 4975.0,
            "n_distinct": 89,
            "type": "Numeric",
            "n_missing": 271,
            "std": 736.344765524384,
            "min": 1559.0,
            "n": 1000,
            "value_counts_without_nan": {
                "3770.0": 102,
                "4150.0": 95,
                "2973.0": 59,
                "3259.0": 50,
                "4533.0": 36,
                "3447.0": 35,
                "2972.0": 34,
                "4619.0": 31,
                "1583.0": 16,
                "3045.0": 13,
                "more ...": -1
            },
            "description": "The column 'opmaak > vacatureTemplateId' appears to be a numeric identifier for job posting templates, containing values ranging from 1,559 to 4,975. In the dataset of 1,000 records, approximately 27.1% of entries are missing values, while the remaining entries show a mean value of 3,574 with a standard deviation of 736. The column has 89 distinct template IDs, with the most frequently occurring templates being 3770 (102 occurrences) and 4150 (95 occurrences). This suggests the column is likely used as a reference system for different job posting layout templates, with some templates being more commonly used than others."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente",
            "p_missing": 0.0,
            "p_distinct": 0.115,
            "n_distinct": 115,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "ANTWERPEN": 150,
                "SINT-DENIJS-WESTREM": 107,
                "BRUSSEL": 98,
                "CHARLEROI": 95,
                "GENT": 50,
                "ZWIJNAARDE": 41,
                "BRUGGE": 30,
                "HOOGLEDE": 27,
                "ROESELARE": 26,
                "KORTRIJK": 22,
                "more ...": -1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente' contains municipality or city names in Belgium where suppliers/vendors are located. It is a complete dataset with no missing values across all 1,000 records and contains 115 unique municipalities. The most frequently occurring cities are Antwerpen (150 entries), Sint-Denijs-Westrem (107 entries), Brussel (98 entries), and Charleroi (95 entries), suggesting a concentration of suppliers in these major Belgian urban centers. The data appears to be consistently formatted text entries representing official municipality names."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer",
            "p_missing": 0.002,
            "p_distinct": 0.14228456913827656,
            "n_distinct": 142,
            "type": "Text",
            "n_missing": 2,
            "n": 1000,
            "value_counts_without_nan": {
                "2": 208,
                "1146": 70,
                "17": 56,
                "70": 51,
                "74": 43,
                "91": 31,
                "88": 29,
                "311A": 26,
                "1": 24,
                "26": 18,
                "more ...": -1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer' appears to contain street numbers or building numbers for physical locations. From the analysis of 1,000 records, it has a very low missing data rate (0.2%, only 2 missing values) and contains 142 unique values (14.2% distinct values). The most common number is \"2\" appearing 208 times, followed by \"1146\" (70 times), \"17\" (56 times), and \"70\" (51 times). The data is stored as text type, allowing for both numeric and alphanumeric values (as evidenced by entries like \"311A\"), which is typical for address numbers that may include suffixes or building unit identifiers."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode",
            "p_missing": 0.0,
            "p_distinct": 0.121,
            "n_distinct": 121,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "9051": 138,
                "2050": 105,
                "1000": 98,
                "6000": 95,
                "9052": 41,
                "8830": 28,
                "8000": 27,
                "8800": 26,
                "2018": 23,
                "8500": 21,
                "more ...": -1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode' contains Belgian postal codes and appears to be a complete dataset with no missing values across all 1,000 records. The data is stored as text and includes 121 unique postal codes, representing a distinct value ratio of 12.1%. The most frequently occurring postal codes are 9051 (138 occurrences), 2050 (105 occurrences), 1000 (98 occurrences), and 6000 (95 occurrences), suggesting concentrations of data from specific Belgian regions, with 9051 (Ghent) being the most represented area."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straat",
            "p_missing": 0.002,
            "p_distinct": 0.2605210420841683,
            "n_distinct": 260,
            "type": "Text",
            "n_missing": 2,
            "n": 1000,
            "value_counts_without_nan": {
                "KATWILGWEG": 102,
                "QUAI PAUL VERLAINE": 95,
                "Kortrijksesteenweg": 85,
                "Wolstraat": 50,
                "RIJVISSCHEPARK": 40,
                "Leiepark": 34,
                "POORTAKKERSTRAAT": 31,
                "Havenlaan": 29,
                "Bruggesteenweg": 27,
                "Heidestraat": 14,
                "more ...": -1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straat' contains street names for physical business locations, with very high completeness (only 0.2% missing values). From the 1,000 records analyzed, there are 260 unique street names (26% distinct values), suggesting a good variety of locations. The most frequently occurring street names are \"KATWILGWEG\" (102 occurrences), \"QUAI PAUL VERLAINE\" (95 occurrences), and \"Kortrijksesteenweg\" (85 occurrences), indicating some clustering of businesses in certain areas. The data appears to be in mixed case formats and includes both Dutch and French street names, suggesting locations across different linguistic regions."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus",
            "p_missing": 0.0,
            "p_distinct": 0.286,
            "n_distinct": 286,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "KATWILGWEG 2": 102,
                "QUAI PAUL VERLAINE 2 Postbus 2": 95,
                "Kortrijksesteenweg 1146": 70,
                "Wolstraat 70": 50,
                "RIJVISSCHEPARK 74": 40,
                "Leiepark 17": 34,
                "POORTAKKERSTRAAT 91 Postbus 101": 31,
                "Havenlaan 88 Postbus 60": 29,
                "Bruggesteenweg 311A Postbus B3": 20,
                "Heidestraat 17": 14,
                "more ...": -1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus' contains street addresses with house numbers and optional post box information for physical locations. The data is complete with no missing values across all 1,000 records, and there are 286 unique address combinations (28.6% distinct values). The most frequent address is \"KATWILGWEG 2\" appearing 102 times, followed by \"QUAI PAUL VERLAINE 2 Postbus 2\" with 95 occurrences. The format typically includes a street name followed by a number, and in some cases includes \"Postbus\" (post box) information. This appears to be a standardized address field used for supplier contact information in what seems to be a Belgian or Dutch context."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn",
            "p_missing": 0.0,
            "p_distinct": 0.287,
            "n_distinct": 287,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "KATWILGWEG 2 2050 ANTWERPEN": 102,
                "QUAI PAUL VERLAINE 2 Postbus 2 6000 CHARLEROI": 95,
                "Kortrijksesteenweg 1146 9051 SINT-DENIJS-WESTREM": 70,
                "Wolstraat 70 1000 BRUSSEL": 50,
                "RIJVISSCHEPARK 74 9052 ZWIJNAARDE": 40,
                "Leiepark 17 9051 SINT-DENIJS-WESTREM": 34,
                "POORTAKKERSTRAAT 91 Postbus 101 9051 GENT": 31,
                "Havenlaan 88 Postbus 60 1000 BRUSSEL": 29,
                "Bruggesteenweg 311A Postbus B3 8830 HOOGLEDE": 20,
                "Heidestraat 17 9820 MERELBEKE-MELLE": 14,
                "more ...": -1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn' contains structured address lines for physical locations of service providers/suppliers. It has complete data coverage with no missing values across all 1,000 records. The column contains 287 unique address values (28.7% distinctness), suggesting multiple suppliers share some locations. The most frequent address appears 102 times (\"KATWILGWEG 2 2050 ANTWERPEN\"), followed by addresses in Charleroi (95 occurrences) and Sint-Denijs-Westrem (70 occurrences). The addresses follow a consistent format including street name, number, postal code, and city, with some entries also including post box numbers. The data appears to be primarily focused on Belgian locations."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > land > code",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "BE": 997,
                "NL": 3
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > land > code' contains country codes representing the physical location of the supplier's contact method. It is a complete dataset with no missing values across all 1,000 entries. The column contains only two distinct values: \"BE\" (Belgium) which appears 997 times, and \"NL\" (Netherlands) which appears 3 times, indicating that the vast majority (99.7%) of the suppliers are located in Belgium. This categorical column appears to use standard two-letter ISO country codes to represent the countries."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > land > label",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 997,
                "Nederland": 3
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > land > label' contains the country labels for physical locations of contact methods for suppliers. It is a categorical field with 100% completion rate (no missing values) across all 1,000 records. The column has only two distinct values: \"België\" appears predominantly with 997 occurrences (99.7% of records), while \"Nederland\" appears in just 3 records (0.3%), indicating that the vast majority of suppliers are located in Belgium."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > land > kortLabel",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 997,
                "Nederland": 3
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > land > kortLabel' is a categorical field that contains the abbreviated country labels for physical locations of suppliers. In the dataset of 1,000 records, this column has 100% completion rate with no missing values and only two distinct values: \"België\" (appearing 997 times) and \"Nederland\" (appearing 3 times). The overwhelming majority of locations (99.7%) are in Belgium, with just 0.3% in the Netherlands, suggesting this is primarily a Belgian-focused dataset."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > naam",
            "p_missing": 0.0,
            "p_distinct": 0.264,
            "n_distinct": 264,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Jobat": 102,
                "Editx": 95,
                "LGA IT": 59,
                "ictjob.be": 50,
                "Kwery": 35,
                "LGA Engineering": 34,
                "Spark": 31,
                "Vlaanderen connect.": 29,
                "Lagom Engineering West-Vlaanderen": 20,
                "Lagom Engineering Oost-Vlaanderen": 14,
                "more ...": -1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > naam' appears to contain the names of job posting providers or recruitment agencies. It has complete data with no missing values across all 1,000 records and contains 264 unique values (26.4% distinctness). The most frequent providers are Jobat (102 entries), Editx (95 entries), LGA IT (59 entries), and ictjob.be (50 entries), suggesting these are major recruitment platforms or agencies in the system. The data is stored as text type and shows a mix of general job boards, specialized IT recruiters, and regional recruitment agencies."
        },
        {
            "column_name": "leverancier > type",
            "p_missing": 0.0,
            "p_distinct": 0.003,
            "n_distinct": 3,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "INTERMEDIAIREN": 523,
                "DERDENLEVERANCIERS": 259,
                "GEWONE_BEDRIJVEN": 218
            },
            "description": "The column 'leverancier > type' is a categorical field with 100% completion rate (no missing values) across 1,000 records. It contains exactly three distinct values: \"INTERMEDIAIREN,\" \"DERDENLEVERANCIERS,\" and \"GEWONE_BEDRIJVEN,\" with INTERMEDIAIREN being the most common (523 occurrences or 52.3%), followed by DERDENLEVERANCIERS (259 occurrences or 25.9%), and GEWONE_BEDRIJVEN (218 occurrences or 21.8%). This column appears to classify the supplier or provider type associated with each record, suggesting it's used to categorize different types of business entities or intermediaries in the system."
        },
        {
            "column_name": "leverancier > naam",
            "p_missing": 0.0,
            "p_distinct": 0.264,
            "n_distinct": 264,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Jobat": 102,
                "Editx": 95,
                "LGA IT": 59,
                "ictjob.be": 50,
                "Kwery": 35,
                "LGA Engineering": 34,
                "Spark": 31,
                "Vlaanderen connect.": 29,
                "Lagom Engineering West-Vlaanderen": 20,
                "Lagom Engineering Oost-Vlaanderen": 14,
                "more ...": -1
            },
            "description": "The column 'leverancier > naam' appears to contain the names of job posting suppliers or recruitment agencies. It is a text field that is consistently populated across all 1,000 records with no missing values. The data shows significant concentration among a few major suppliers, with Jobat (102 entries) and Editx (95 entries) being the most frequent contributors, followed by LGA IT (59 entries) and ictjob.be (50 entries). There are 264 unique suppliers in total, indicating a diverse but somewhat concentrated supplier base, with the top suppliers accounting for a substantial portion of the job postings."
        },
        {
            "column_name": "leverancier > gemandateerd",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "true": 846,
                "false": 154
            },
            "description": "The column 'leverancier > gemandateerd' is a boolean field that is consistently populated (0% missing values) across all 1,000 records. It contains only two distinct values: true or false, with a strong bias towards \"true\" (846 occurrences, 84.6%) versus \"false\" (154 occurrences, 15.4%). This suggests it's likely a flag or indicator field that marks whether a supplier (\"leverancier\") is mandated or authorized in some way, with the majority of suppliers having this authorization."
        },
        {
            "column_name": "leverancier > organisatie > id",
            "p_missing": 0.0,
            "mean": 9864694.86,
            "p_distinct": 0.291,
            "max": 10893669,
            "n_distinct": 291,
            "type": "Numeric",
            "n_missing": 0,
            "std": 2710185.589547996,
            "min": 352,
            "n": 1000,
            "value_counts_without_nan": {
                "10684904": 102,
                "10714258": 95,
                "10697591": 59,
                "10409921": 50,
                "10757886": 36,
                "10697563": 34,
                "10777105": 31,
                "10628668": 29,
                "10692008": 20,
                "10838862": 14,
                "more ...": -1
            },
            "description": "The column 'leverancier > organisatie > id' appears to be a numeric identifier field that is consistently populated (0% missing values) across all 1,000 records. It contains organizational ID numbers ranging from 352 to 10,893,669, with an average value of approximately 9.86 million. The column shows moderate uniqueness with 291 distinct values (29.1% of all records), suggesting that multiple job listings are associated with the same organizations. The distribution of values indicates some organizations are more frequently represented than others, with the top organization (ID: 10684904) appearing 102 times, followed by another (ID: 10714258) appearing 95 times, suggesting these are major employers or recruitment agencies in the dataset."
        },
        {
            "column_name": "leverancier > organisatie > naam",
            "p_missing": 0.0,
            "p_distinct": 0.275,
            "n_distinct": 275,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Jobat": 102,
                "Editx": 95,
                "LGA IT": 59,
                "ictjob.be": 50,
                "KWERY": 36,
                "LGA Engineering": 34,
                "Spark": 31,
                "Vlaanderen connect.": 29,
                "Lagom Engineering West-Vlaanderen": 20,
                "Lagom Engineering Oost-Vlaanderen": 14,
                "more ...": -1
            },
            "description": "The column 'leverancier > organisatie > naam' contains organization names of job listing providers or recruiters, with 100% data completeness across all 1,000 records. It shows moderate diversity with 275 unique values (27.5% distinct). The most frequent organizations are Jobat (102 listings), Editx (95 listings), and LGA IT (59 listings), suggesting these are major recruitment platforms or employers in the dataset. Other notable contributors include ictjob.be (50 listings) and various regional engineering recruitment firms. The data appears to be clean and well-structured, consisting of company names in text format."
        },
        {
            "column_name": "leverancier > organisatie > bedrijvenGalerijId",
            "p_missing": 0.272,
            "mean": 3571.6758241758243,
            "p_distinct": 0.12225274725274725,
            "max": 4974.0,
            "n_distinct": 89,
            "type": "Numeric",
            "n_missing": 272,
            "std": 738.6030882691294,
            "min": 1567.0,
            "n": 1000,
            "value_counts_without_nan": {
                "3769.0": 102,
                "4151.0": 95,
                "2970.0": 59,
                "3258.0": 50,
                "4534.0": 36,
                "3446.0": 35,
                "2969.0": 34,
                "4618.0": 31,
                "1584.0": 16,
                "3041.0": 13,
                "more ...": -1
            },
            "description": "The column 'leverancier > organisatie > bedrijvenGalerijId' appears to be a numeric identifier field that contains company gallery IDs. From the profiling data, it has a 27.2% missing rate (272 out of 1000 records), with values ranging from 1567 to 4974. The mean value is approximately 3572, with a standard deviation of about 739. The column shows moderate cardinality with 89 distinct values (12.2% of non-null values are unique). The most frequent ID values are 3769 (102 occurrences) and 4151 (95 occurrences), suggesting some organizations appear more frequently than others in the dataset."
        },
        {
            "column_name": "leverancier > organisatie > omschrijving",
            "p_missing": 0.223,
            "p_distinct": 0.20205920205920205,
            "n_distinct": 157,
            "type": "Text",
            "n_missing": 223,
            "n": 1000,
            "value_counts_without_nan": {
                "Le Grand & Associates is gespecialiseerd in de selectie en rekrutering van kwaliteitsvolle professionals in de financiële en juridische sector. Door onze uitgebreide kennis in deze specifieke markten kunnen wij klant en kandidaat perfect begeleiden en ondersteunen doorheen het proces. \r\n\r\nWij zijn een ambitieus, bloeiend en groeiend bedrijf dat geen enkele uitdaging uit de weg gaat. Met ons no cure, no pay-principe gaan we voor u tot het uiterste. Onze consultants zijn voortdurend op zoek naar personen die zowel qua karakter als op gebied van skills perfect aansluiten bij het profiel van uw bedrijf: een harmonieuze match vinden is onze key priority.": 104,
                "more ...": -1
            },
            "description": "Based on the profiling data, the 'leverancier > organisatie > omschrijving' column contains organizational descriptions or company profiles, with 77.7% of the 1,000 entries containing data (223 missing values). The column contains text data with 157 unique descriptions, suggesting that multiple job listings may come from the same organizations. The most common description appears 104 times and belongs to \"Le Grand & Associates,\" a company specializing in financial and legal sector recruitment. This indicates that the column typically contains detailed company descriptions that outline the organization's specialties, values, and business approach."
        },
        {
            "column_name": "leverancier > organisatie > website",
            "p_missing": 0.171,
            "p_distinct": 0.23281061519903498,
            "n_distinct": 193,
            "type": "Text",
            "n_missing": 171,
            "n": 1000,
            "value_counts_without_nan": {
                "http://www.legrand-associates.com": 104,
                "https://editx.eu/nl/it-jobs": 95,
                "http://www.ictjob.be": 50,
                "http://www.kwery.be": 36,
                "http://www.sparkjobs.be": 31,
                "http://www.vlaanderenconnect.be": 29,
                "http://www.tecjobz.be": 27,
                "https://www.lagom.jobs/": 14,
                "http://www.unique.be": 14,
                "http://kingfisher-recruitment.be": 13,
                "more ...": -1
            },
            "description": "The column 'leverancier > organisatie > website' contains website URLs of organizations or companies, with 82.9% of the 1,000 entries containing valid data (171 missing values). There are 193 unique website addresses in the dataset, indicating a moderate level of diversity among the organizations. The most frequently occurring website is \"http://www.legrand-associates.com\" appearing 104 times, followed by \"https://editx.eu/nl/it-jobs\" with 95 occurrences, and \"http://www.ictjob.be\" with 50 occurrences. The data suggests this column primarily contains recruitment and job-related websites, with many appearing to be Belgian job portals or recruitment agencies based on their domain names."
        },
        {
            "column_name": "leverancier > organisatie > prioritair",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 896,
                "true": 104
            },
            "description": "The column 'leverancier > organisatie > prioritair' is a boolean field that is consistently populated (0% missing values) across all 1,000 records. It appears to be a flag indicating some form of priority status for organizations, where the vast majority (89.6%) are marked as \"false\" and only 10.4% are marked as \"true\". The column has perfect completeness with no missing values and contains only two distinct values (true/false), making it a clean, binary indicator field."
        },
        {
            "column_name": "leverancier > organisatie > externeLinks",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the profiling data, the column 'leverancier > organisatie > externeLinks' appears to be present in all 1,000 records with no missing values (0% missing rate). The column is classified as an \"Unsupported\" type, which typically indicates it contains complex or nested data structures that don't fit into standard data types. Given its name (\"externe links\" meaning \"external links\" in Dutch) and the unsupported type classification, this column likely contains lists or collections of external website URLs or references associated with the organization (\"leverancier > organisatie\" meaning \"supplier > organization\")."
        },
        {
            "column_name": "leverancier > organisatie > gemeente",
            "p_missing": 0.0,
            "p_distinct": 0.112,
            "n_distinct": 112,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "ANTWERPEN": 144,
                "BRUSSEL": 103,
                "CHARLEROI": 95,
                "SINT-DENIJS-WESTREM": 94,
                "GENT": 68,
                "ZWIJNAARDE": 43,
                "ROESELARE": 29,
                "HOOGLEDE": 28,
                "KORTRIJK": 21,
                "HERENTALS": 18,
                "more ...": -1
            },
            "description": "Based on the profiling data, 'leverancier > organisatie > gemeente' is a text column that contains municipality or city names where organizations (likely employers or job posting entities) are located. The column has complete data with no missing values across all 1,000 records and contains 112 unique municipality names. The most frequently occurring locations are Antwerpen (144 entries), Brussel (103 entries), and Charleroi (95 entries), suggesting a concentration of organizations in these major Belgian cities. The data appears to be consistently formatted and represents a mix of both Dutch and French-speaking municipalities in Belgium."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > gemeente",
            "p_missing": 0.129,
            "p_distinct": 0.20321469575200918,
            "n_distinct": 177,
            "type": "Text",
            "n_missing": 129,
            "n": 1000,
            "value_counts_without_nan": {
                "BRUSSEL": 73,
                "ROESELARE": 60,
                "ANTWERPEN": 52,
                "GENT": 44,
                "KORTRIJK": 32,
                "BRUGGE": 26,
                "MECHELEN": 25,
                "KONTICH": 22,
                "HERENTALS": 21,
                "HASSELT": 19,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > gemeente' contains municipality or city names where jobs are located in Belgium. Out of 1,000 records, 12.9% are missing values, while the remaining entries consist of 177 unique municipalities. The most frequently occurring cities are Brussels (73 entries), Roeselare (60 entries), Antwerp (52 entries), Ghent (44 entries), and Kortrijk (32 entries), suggesting a concentration of job opportunities in these major Belgian urban centers. The column is stored as text data type and shows a moderate level of diversity with about 20.3% of entries being distinct values."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > nummer",
            "p_missing": 0.827,
            "p_distinct": 0.3815028901734104,
            "n_distinct": 66,
            "type": "Text",
            "n_missing": 827,
            "n": 1000,
            "value_counts_without_nan": {
                "88": 32,
                "1": 14,
                "3": 10,
                "75": 8,
                "2": 8,
                "14": 7,
                "20": 5,
                "9": 5,
                "28": 4,
                "4": 4,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > nummer' appears to contain street numbers for business locations. It has a notably high missing data rate of 82.7%, with only 173 out of 1000 entries containing values. Among the non-missing values, there are 66 distinct numbers, with \"88\" being the most frequent (32 occurrences), followed by \"1\" (14 occurrences) and \"3\" (10 occurrences). The data is stored as text type, and appears to consist primarily of simple numeric street numbers, suggesting this field is used to specify building numbers in structured address information for business locations."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postcode",
            "p_missing": 0.129,
            "p_distinct": 0.21239954075774972,
            "n_distinct": 185,
            "type": "Text",
            "n_missing": 129,
            "n": 1000,
            "value_counts_without_nan": {
                "1000": 73,
                "8800": 60,
                "9000": 44,
                "2000": 32,
                "8500": 31,
                "8000": 26,
                "2800": 25,
                "2550": 22,
                "2200": 21,
                "3500": 18,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postcode' contains Belgian postal codes for job locations. In the dataset of 1,000 entries, 12.9% of the values are missing, while the remaining entries show 185 unique postal codes, indicating a good geographical spread of job locations. The most frequently occurring postal code is \"1000\" (Brussels city center) with 73 occurrences, followed by \"8800\" (Roeselare) with 60 occurrences, and \"9000\" (Ghent) with 44 occurrences. This suggests a concentration of job opportunities in major Belgian urban centers, particularly in Brussels, with a significant presence in Flemish cities as well."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straat",
            "p_missing": 0.827,
            "p_distinct": 0.6242774566473989,
            "n_distinct": 108,
            "type": "Text",
            "n_missing": 827,
            "n": 1000,
            "value_counts_without_nan": {
                "Havenlaan": 27,
                "Kapeldreef": 7,
                "Havenlaan 88, 1000 Brussel": 5,
                "Hof Ter Weze": 4,
                "Smals vzw\nFonsnylaan 20\n1060 Brussel": 4,
                "Oude Brusselsestraat 14, 2800 Mechelen": 3,
                "Blekerijstraat": 3,
                "Hinnenboomstraat": 3,
                "Culliganlaan 3, 1831 Machelen": 3,
                "Vannestes Molenstraat": 3,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straat' contains street address information for business locations, but has a notably high missing data rate of 82.7%. Among the 173 non-null entries, there are 108 unique values, indicating significant variety in the street addresses. The most frequently occurring street name is \"Havenlaan\" which appears 27 times, followed by \"Kapeldreef\" with 7 occurrences. The data format appears to be inconsistent, with some entries containing just street names (like \"Blekerijstraat\"), while others include complete addresses with postal codes and cities (such as \"Havenlaan 88, 1000 Brussel\"). This suggests a lack of standardization in how street address data is entered into this field."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straatNummerPostbus",
            "p_missing": 0.129,
            "p_distinct": 0.12973593570608496,
            "n_distinct": 113,
            "type": "Text",
            "n_missing": 129,
            "n": 1000,
            "value_counts_without_nan": {
                "": 698,
                "Havenlaan 88 Postbus 60": 27,
                "Kapeldreef 75": 7,
                "Havenlaan 88, 1000 Brussel 88": 5,
                "Oude Brusselsestraat 14, 2800 Mechelen 14": 4,
                "Smals vzw\nFonsnylaan 20\n1060 Brussel 20": 4,
                "Blekerijstraat 23-29": 3,
                "Edingensesteenweg 196": 3,
                "Hinnenboomstraat 1 Postbus 2": 3,
                "Culliganlaan 3, 1831 Machelen 3": 3,
                "more ...": -1
            },
            "description": "Based on the profiling data, the column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straatNummerPostbus' appears to be a text field containing street addresses and post box information for business locations. The column has a relatively low missing rate of 12.9% (129 out of 1000 records), but notably, 69.8% of the non-missing values are empty strings. Among the populated entries, there are 113 distinct values, suggesting a moderate variety of addresses. The format varies between simple street addresses (like \"Kapeldreef 75\") and more complex entries that include post box numbers and postal codes (like \"Havenlaan 88 Postbus 60\"). The most frequent non-empty value is \"Havenlaan 88 Postbus 60\" appearing 27 times in the dataset."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > lijn",
            "p_missing": 0.129,
            "p_distinct": 0.31917336394948337,
            "n_distinct": 278,
            "type": "Text",
            "n_missing": 129,
            "n": 1000,
            "value_counts_without_nan": {
                "8800 ROESELARE": 52,
                "9000 GENT": 36,
                "1000 BRUSSEL": 33,
                "2000 ANTWERPEN": 30,
                "Havenlaan 88 Postbus 60 1000 BRUSSEL": 27,
                "8000 BRUGGE": 26,
                "8500 KORTRIJK": 25,
                "2550 KONTICH": 21,
                "2200 HERENTALS": 19,
                "2800 MECHELEN": 18,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > lijn' appears to contain address line information for business locations in Belgium. From the sample of 1000 records, 87.1% of entries are populated (129 missing values). The column shows significant variety with 278 distinct values, representing about 31.9% of all entries. The most frequent locations are major Belgian cities, with Roeselare (52 entries), Gent (36 entries), Brussels (33 entries), and Antwerp (30 entries) being the most common. Some entries contain complete street addresses (like \"Havenlaan 88 Postbus 60 1000 BRUSSEL\"), while others appear to be simplified to just city and postal code format (like \"8800 ROESELARE\")."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > code",
            "p_missing": 0.129,
            "p_distinct": 0.002296211251435132,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 129,
            "n": 1000,
            "value_counts_without_nan": {
                "BE": 869,
                "NL": 2
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > code' contains country codes indicating the location of employment positions. It has a relatively low missing data rate of 12.9% (129 missing values out of 1,000 records) and contains only two distinct values: \"BE\" (Belgium) and \"NL\" (Netherlands). The vast majority of the positions (869) are located in Belgium, with only 2 positions in the Netherlands, suggesting this dataset primarily focuses on Belgian job listings. The column is categorical in nature and uses standard two-letter country codes for representation."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > label",
            "p_missing": 0.129,
            "p_distinct": 0.002296211251435132,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 129,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 869,
                "Nederland": 2
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > label' contains the country labels for job locations, with only two distinct values: \"België\" and \"Nederland\". Out of 1,000 records, 12.9% (129 entries) are missing values. The vast majority of non-missing entries are \"België\" (869 entries), while \"Nederland\" appears only twice, indicating this dataset primarily contains job listings in Belgium. This categorical column appears to represent the country where the job position is located."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > kortLabel",
            "p_missing": 0.129,
            "p_distinct": 0.002296211251435132,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 129,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 869,
                "Nederland": 2
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > kortLabel' contains the abbreviated country labels for job locations, with only two distinct values: \"België\" and \"Nederland\". In the dataset of 1,000 records, België is overwhelmingly the dominant location with 869 entries, while Nederland appears only twice. The column has a relatively low missing data rate of 12.9% (129 missing values), suggesting good data completeness. This appears to be a categorical field that indicates the country where the job position is located, with a strong focus on Belgian job listings."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > naam",
            "p_missing": 0.875,
            "p_distinct": 0.656,
            "n_distinct": 82,
            "type": "Text",
            "n_missing": 875,
            "n": 1000,
            "value_counts_without_nan": {
                "Vlaanderen connect.": 27,
                "imec": 7,
                "COLRUYT": 3,
                "JOBUP": 3,
                "BOGAERTS GREENHOUSE LOGISTICS": 3,
                "Dehora België": 2,
                "VDL Bus Roeselare N.V.": 2,
                "Datashift": 2,
                "X-Care": 2,
                "JUVO": 2,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > naam' appears to contain business or company location names where jobs are located. This column has a notably high missing rate of 87.5%, with only 125 out of 1,000 entries containing values. Among the non-missing values, there are 82 distinct company names, indicating considerable variety in the workplace locations. The most frequently occurring company name is \"Vlaanderen connect.\" with 27 occurrences, followed by \"imec\" with 7 occurrences, while companies like \"COLRUYT,\" \"JOBUP,\" and \"BOGAERTS GREENHOUSE LOGISTICS\" each appear 3 times. The data suggests this column is used to specify the specific company facility or location where the work would take place, though its high missing rate may indicate this information is often not provided in job listings."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regio > code",
            "p_missing": 0.116,
            "p_distinct": 0.06108597285067873,
            "n_distinct": 54,
            "type": "Text",
            "n_missing": 116,
            "n": 1000,
            "value_counts_without_nan": {
                "BE234B": 99,
                "BE256A": 75,
                "BE211A": 73,
                "BE254A": 48,
                "BE251A": 42,
                "BE213B": 41,
                "BE241D": 38,
                "BE211D": 37,
                "BE212B": 34,
                "BE242B": 32,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > regio > code' contains regional codes, likely representing different geographical areas in Belgium (given the 'BE' prefix in the codes). In a dataset of 1,000 entries, this column has a relatively low missing data rate of 11.6% (116 missing values) and contains 54 unique codes, representing about 6.1% distinctiveness. The most frequent regional code is 'BE234B' appearing 99 times, followed by 'BE256A' (75 occurrences) and 'BE211A' (73 occurrences). The standardized format of these codes (consisting of 'BE' followed by numbers and letters) suggests this is a formal geographic classification system used for administrative or organizational purposes."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regio > label",
            "p_missing": 0.116,
            "p_distinct": 0.06108597285067873,
            "n_distinct": 54,
            "type": "Text",
            "n_missing": 116,
            "n": 1000,
            "value_counts_without_nan": {
                "Regio Gent": 99,
                "Regio Roeselare - Izegem": 75,
                "Regio Antwerpen": 73,
                "Regio Kortrijk": 48,
                "Regio Brugge": 42,
                "Regio Herentals - Westerlo": 41,
                "Regio Vilvoorde - Zaventem": 38,
                "Regio Kontich - Mortsel - Ranst": 37,
                "Regio Mechelen": 34,
                "Regio Leuven": 32,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > regio > label' contains geographical region labels for job locations in Belgium, with 88.4% of the 1,000 records containing valid data (116 missing values). The column contains 54 unique region values, with \"Regio Gent\" being the most frequent (99 occurrences), followed by \"Regio Roeselare - Izegem\" (75 occurrences) and \"Regio Antwerpen\" (73 occurrences). The data appears to be standardized region names, primarily representing major Belgian employment areas and their surrounding municipalities, with a focus on Flemish regions based on the examples shown."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regio > kortLabel",
            "p_missing": 0.116,
            "p_distinct": 0.06108597285067873,
            "n_distinct": 54,
            "type": "Text",
            "n_missing": 116,
            "n": 1000,
            "value_counts_without_nan": {
                "Regio Gent": 99,
                "Regio Roeselare - Izegem": 75,
                "Regio Antwerpen": 73,
                "Regio Kortrijk": 48,
                "Regio Brugge": 42,
                "Regio Herentals - Westerlo": 41,
                "Regio Vilvoorde - Zaventem": 38,
                "Regio Kontich - Mortsel - Ranst": 37,
                "Regio Mechelen": 34,
                "Regio Leuven": 32,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > regio > kortLabel' contains geographical region labels for job locations in Belgium, with 11.6% of values missing across the 1,000 records. The column contains 54 unique region values, with \"Regio Gent\" being the most frequent (99 occurrences), followed by \"Regio Roeselare - Izegem\" (75 occurrences) and \"Regio Antwerpen\" (73 occurrences). The data appears to be standardized region names, typically following the format \"Regio\" followed by city or area names, and primarily covers major employment centers across Belgium."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regioOfAdres",
            "p_missing": 0.0,
            "p_distinct": 0.208,
            "n_distinct": 208,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "BRUSSEL": 73,
                "ROESELARE": 60,
                "ANTWERPEN": 52,
                "GENT": 44,
                "KORTRIJK": 32,
                "Brussel": 27,
                "BRUGGE": 26,
                "MECHELEN": 25,
                "KONTICH": 22,
                "HERENTALS": 21,
                "more ...": -1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > regioOfAdres' appears to contain location information for job positions, specifically cities or regions in Belgium. It is a text field that is consistently populated across all 1,000 records (no missing values) with 208 unique locations. The most frequently occurring locations are major Belgian cities, with Brussels (both \"BRUSSEL\" and \"Brussel\" variants) appearing most often, followed by cities like Roeselare, Antwerp, Ghent, and Kortrijk. The data shows some inconsistency in capitalization (as evidenced by \"BRUSSEL\" and \"Brussel\" being counted separately), but otherwise appears to be a reliable indicator of job locations."
        },
        {
            "column_name": "profiel > dienstregeling > dienstregelingen",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the provided profiling data, the column 'profiel > dienstregeling > dienstregelingen' appears to be present in all 1,000 records with no missing values (p_missing = 0.0, n_missing = 0). The column is classified as an \"Unsupported\" type, which typically suggests it contains complex or nested data structures that don't fit into standard data types. Given the column name's structure and context (being part of a job posting dataset), it likely contains scheduling or work shift information, but the specific format and content structure cannot be determined from the provided profiling data alone."
        },
        {
            "column_name": "profiel > dienstregeling > arbeidsDuur > code",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "V": 983,
                "D": 17
            },
            "description": "The column 'profiel > dienstregeling > arbeidsDuur > code' is a categorical field that is consistently populated (0% missing values) across all 1,000 records. It contains only two distinct values: \"V\" which appears 983 times (98.3% of cases) and \"D\" which appears 17 times (1.7% of cases). Given the column name structure and the binary nature of the values, this appears to be a code representing some aspect of work duration or schedule type in the job posting system."
        },
        {
            "column_name": "profiel > dienstregeling > arbeidsDuur > label",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "voltijds": 983,
                "deeltijds": 17
            },
            "description": "The column 'profiel > dienstregeling > arbeidsDuur > label' is a categorical field that indicates whether a job position is full-time (\"voltijds\") or part-time (\"deeltijds\"). In the dataset of 1,000 records, this column has no missing values and contains only two distinct values. The vast majority of positions (983 or 98.3%) are full-time, while only a small portion (17 or 1.7%) are part-time positions."
        },
        {
            "column_name": "profiel > dienstregeling > arbeidsDuur > kortLabel",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "voltijds": 983,
                "deeltijds": 17
            },
            "description": "The column 'profiel > dienstregeling > arbeidsDuur > kortLabel' is a categorical field that indicates whether a job position is full-time (\"voltijds\") or part-time (\"deeltijds\"). In the dataset of 1,000 records, this column has no missing values and contains only two distinct values. The vast majority of positions (983 or 98.3%) are full-time, while only a small portion (17 or 1.7%) are part-time positions."
        },
        {
            "column_name": "profiel > dienstregeling > werkshiften",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the provided profiling data, the column 'profiel > dienstregeling > werkshiften' appears to be present in all 1,000 records with no missing values (p_missing = 0.0, n_missing = 0). The column is classified as an \"Unsupported\" type, which typically indicates it contains complex or nested data structures that don't fit standard data types. Given the column name's context (which translates from Dutch to \"work shifts\" in English), it likely contains information about work shift schedules or patterns, but the specific format and structure of this data cannot be determined from the provided profiling information alone."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > gemeente",
            "p_missing": 0.258,
            "p_distinct": 0.192722371967655,
            "n_distinct": 143,
            "type": "Text",
            "n_missing": 258,
            "n": 1000,
            "value_counts_without_nan": {
                "ANTWERPEN": 63,
                "GENT": 56,
                "BRUSSEL": 41,
                "HOOGLEDE": 41,
                "ROESELARE": 40,
                "KORTRIJK": 28,
                "MECHELEN": 24,
                "HERENTALS": 23,
                "HASSELT": 19,
                "KONTICH": 19,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > gemeente' contains municipality or city names in Belgium, with 74.2% of the 1,000 records having valid entries. There are 143 unique municipalities in the dataset, indicating a diverse geographical distribution of locations. The most frequently occurring cities are Antwerpen (63 entries), Gent (56 entries), and Brussels/Hooglede (41 entries each). The column is stored as text data type, and approximately 25.8% (258 records) of the entries are missing values, suggesting some incomplete address information in the dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > nummer",
            "p_missing": 0.638,
            "p_distinct": 0.30386740331491713,
            "n_distinct": 110,
            "type": "Text",
            "n_missing": 638,
            "n": 1000,
            "value_counts_without_nan": {
                "88": 29,
                "1": 28,
                "5": 16,
                "131": 13,
                "105": 12,
                "4": 11,
                "2": 11,
                "75": 9,
                "72 1": 9,
                "26": 9,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > nummer' appears to contain building or street numbers for structured addresses in job application information. It has a notably high missing data rate of 63.8%, with 638 missing values out of 1,000 records. Among the 362 non-missing values, there are 110 distinct numbers, suggesting moderate variety in the addresses. The most common numbers are \"88\" and \"1\" occurring 29 and 28 times respectively, followed by \"5\" (16 times), \"131\" (13 times), and \"105\" (12 times). The data is stored as text type, allowing for both simple numeric values and more complex number formats like \"72 1\"."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > postcode",
            "p_missing": 0.258,
            "p_distinct": 0.19811320754716982,
            "n_distinct": 147,
            "type": "Text",
            "n_missing": 258,
            "n": 1000,
            "value_counts_without_nan": {
                "2000": 42,
                "8830": 41,
                "1000": 41,
                "8800": 40,
                "9051": 36,
                "8500": 27,
                "2800": 24,
                "2200": 23,
                "9000": 21,
                "3500": 19,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > postcode' contains Belgian postal codes, with 25.8% of the 1,000 entries being missing. There are 147 unique postal codes in the dataset, indicating a good geographical spread across different regions. The most frequently occurring postal codes are 2000 (42 occurrences), 8830 (41 occurrences), and 1000 (41 occurrences), which correspond to major Belgian cities. The data is stored as text values, and the distribution suggests this column represents location information for job applications or contact addresses."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > straat",
            "p_missing": 0.624,
            "p_distinct": 0.5478723404255319,
            "n_distinct": 206,
            "type": "Text",
            "n_missing": 624,
            "n": 1000,
            "value_counts_without_nan": {
                "Havenlaan": 29,
                "Poederleeseweg": 13,
                "Beelbroekstraat": 12,
                "Scheldestraat": 10,
                "Sint-Piterskaai": 9,
                "Frankrijklei": 8,
                "Kapeldreef": 7,
                "Kortrijksesteenweg": 6,
                "Hoefijzerlaan": 5,
                "Kempische steenweg": 5,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > straat' contains street names for job application addresses in what appears to be a Belgian job posting dataset. The column has a significant missing data rate of 62.4%, with 624 missing values out of 1,000 records. Among the 376 non-missing entries, there are 206 unique street names, indicating considerable variety in locations. The most frequently occurring street name is \"Havenlaan\" with 29 occurrences, followed by \"Poederleeseweg\" (13 occurrences) and \"Beelbroekstraat\" (12 occurrences). The data appears to be predominantly in Dutch/Flemish, suggesting these job postings are mainly located in the Flemish region of Belgium."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > straatNummerPostbus",
            "p_missing": 0.258,
            "p_distinct": 0.29380053908355797,
            "n_distinct": 218,
            "type": "Text",
            "n_missing": 258,
            "n": 1000,
            "value_counts_without_nan": {
                "": 366,
                "Havenlaan 88 Postbus 60": 29,
                "Poederleeseweg 131": 13,
                "Beelbroekstraat 105 Postbus B": 12,
                "Sint-Piterskaai 72 1": 9,
                "Scheldestraat 26 Postbus 1": 9,
                "Frankrijklei 5 Postbus 0401": 8,
                "Kapeldreef 75": 7,
                "Kempische steenweg 305 Postbus 7": 5,
                "Sint-Michielsstraat 27": 4,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > straatNummerPostbus' appears to contain street addresses and post box information for job application locations. In the dataset of 1,000 entries, about 25.8% of the values are missing, and among the non-missing values, there are 218 unique entries (29.4% distinctiveness). A notable characteristic is that the most common value is an empty string, appearing 366 times, followed by various formatted addresses like \"Havenlaan 88 Postbus 60\" (29 occurrences) and \"Poederleeseweg 131\" (13 occurrences). The addresses follow different formats, some including just street names and numbers, while others also contain post box information (indicated by \"Postbus\" followed by a number)."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > lijn",
            "p_missing": 0.258,
            "p_distinct": 0.42183288409703507,
            "n_distinct": 313,
            "type": "Text",
            "n_missing": 258,
            "n": 1000,
            "value_counts_without_nan": {
                "8830 HOOGLEDE": 38,
                "9051 GENT": 31,
                "Havenlaan 88 Postbus 60 1000 BRUSSEL": 29,
                "8800 ROESELARE": 28,
                "2550 KONTICH": 19,
                "2000 ANTWERPEN": 18,
                "2800 MECHELEN": 17,
                "Poederleeseweg 131 2200 HERENTALS": 13,
                "9000 GENT": 12,
                "8530 HARELBEKE": 12,
                "more ...": -1
            },
            "description": "Based on the profiling data, the column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > lijn' appears to contain structured address information for job postings, primarily consisting of Belgian postal codes and city names, with some entries including full street addresses. The column has a 25.8% missing rate (258 out of 1000 entries are empty) and contains 313 unique values, suggesting a moderate level of diversity in locations. The most frequent address entries are in cities like Hooglede (38 entries), Gent (31 entries), and Brussels (29 entries), with a mix of simple city-postal code combinations (e.g., \"8830 HOOGLEDE\") and complete addresses (e.g., \"Havenlaan 88 Postbus 60 1000 BRUSSEL\"). This suggests the column is used to store standardized address lines for job application locations in Belgium."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > land > code",
            "p_missing": 0.258,
            "p_distinct": 0.0026954177897574125,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 258,
            "n": 1000,
            "value_counts_without_nan": {
                "BE": 739,
                "NL": 3
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > land > code' contains country codes for job application addresses, with 74.2% of the 1,000 records containing data (258 missing values). It is a categorical field with only two distinct values: \"BE\" (Belgium) appearing 739 times and \"NL\" (Netherlands) appearing 3 times. The strong dominance of the \"BE\" code suggests this dataset primarily contains job listings from Belgium, with only a very small number of positions in the Netherlands."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > land > label",
            "p_missing": 0.258,
            "p_distinct": 0.0026954177897574125,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 258,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 739,
                "Nederland": 3
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > land > label' contains country labels for job application addresses, with 74.2% of the 1,000 records containing valid data and 25.8% (258 records) being missing. It is a categorical field with only two distinct values: \"België\" (739 occurrences) and \"Nederland\" (3 occurrences). The overwhelming majority of non-null values are for Belgium, suggesting this dataset primarily contains job postings or applications within the Belgian market."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > land > kortLabel",
            "p_missing": 0.258,
            "p_distinct": 0.0026954177897574125,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 258,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 739,
                "Nederland": 3
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > land > kortLabel' contains country abbreviations or short labels for job application addresses, with 74.2% of the 1,000 records containing data (258 missing values). It is a categorical field with only two distinct values: \"België\" appears predominantly with 739 occurrences, while \"Nederland\" appears just 3 times. This suggests that the vast majority of job application addresses in the dataset are located in Belgium, with only a very small number in the Netherlands."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > naam",
            "p_missing": 0.483,
            "p_distinct": 0.34235976789168276,
            "n_distinct": 177,
            "type": "Text",
            "n_missing": 483,
            "n": 1000,
            "value_counts_without_nan": {
                "LGA IT": 59,
                "Tecjobz": 38,
                "LGA Engineering": 34,
                "Spark HR": 31,
                "Vlaanderen connect.": 29,
                "Kingfisher IT, Engineering, Supply Chain én Finance & Legal": 13,
                "Oxida": 12,
                "The Bee Academy": 12,
                "vind!": 12,
                "Le Grand & Associates": 11,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > naam' appears to contain company or organization names associated with job application addresses. It has a relatively high missing data rate of 48.3%, with 483 missing values out of 1,000 records. Among the populated entries, there are 177 unique values, indicating moderate diversity in the organizations listed. The most frequently occurring names include \"LGA IT\" (59 entries), \"Tecjobz\" (38 entries), \"LGA Engineering\" (34 entries), and \"Spark HR\" (31 entries), suggesting these are prominent recruiting or hiring organizations in the dataset. The column is classified as text type, and its distinct value percentage of approximately 34.2% suggests some repetition in the organization names used."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > email",
            "p_missing": 0.771,
            "p_distinct": 0.6331877729257642,
            "n_distinct": 145,
            "type": "Text",
            "n_missing": 771,
            "n": 1000,
            "value_counts_without_nan": {
                "selectiesvlaanderenconnect@vlaanderen.be": 25,
                "hr@thebeeacademy.be": 12,
                "outsourcing@bizztalent.be": 8,
                "jobs@newpointprofessionals.be": 5,
                "info@konnekt.be": 5,
                "Jobs@HEADHUNTER.vlaanderen": 4,
                "betterwork4me@gmail.com": 4,
                "gitte.collier@vlaanderen.be": 4,
                "fien.desmet@vintecc.com": 3,
                "jobs@bogaertsgl.com": 3,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > email' contains contact email addresses for job applications, but has a notably high missing data rate of 77.1%. Among the 229 entries that do contain data, there are 145 unique email addresses, indicating significant variety in contact points. The most frequently occurring email address is \"selectiesvlaanderenconnect@vlaanderen.be\" (appearing 25 times), followed by \"hr@thebeeacademy.be\" (12 times) and \"outsourcing@bizztalent.be\" (8 times). The email addresses appear to be primarily from professional recruitment organizations and HR departments, suggesting these are formal business contact points for job applications."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > telefoon",
            "p_missing": 0.8,
            "p_distinct": 0.715,
            "n_distinct": 143,
            "type": "Text",
            "n_missing": 800,
            "n": 1000,
            "value_counts_without_nan": {
                "0000000000": 12,
                "/": 6,
                "0492183185": 5,
                "03 689 14 91": 5,
                "050893807": 4,
                "09 298 01 07": 4,
                "0477/97.33.74": 4,
                "056 18 52 90": 3,
                "03 600 79 85": 3,
                "033141801": 3,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > telefoon' contains contact phone numbers for job postings, but has a notably high missing data rate of 80% (800 out of 1000 entries are empty). Among the 200 entries that do have phone numbers, there is significant variety with 143 distinct values, indicating a 71.5% uniqueness rate among non-missing values. The phone numbers appear in various formats, including some with spaces and forward slashes (e.g., \"03 689 14 91\", \"0477/97.33.74\"), and others as continuous digits (e.g., \"0492183185\"). The most frequently occurring value is \"0000000000\" which appears 12 times, possibly indicating placeholder entries."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > familienaam",
            "p_missing": 0.0,
            "p_distinct": 0.407,
            "n_distinct": 407,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Verantwoordelijke Human Resources": 102,
                "LGA IT": 59,
                "Kwery ": 35,
                "LGA Engineering": 34,
                "Ellen Vanderschueren": 19,
                "The Bee Academy": 12,
                "-": 12,
                "Le Grand & Associates": 11,
                "AGO Jobs & HR": 10,
                "Julie Sljepcevic": 10,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > familienaam' appears to contain contact person surnames or department names for job postings. It has complete data with no missing values across all 1,000 entries and contains 407 unique values (40.7% distinctness). The most frequent value is \"Verantwoordelijke Human Resources\" appearing 102 times, followed by \"LGA IT\" (59 times) and \"Kwery\" (35 times), suggesting that some entries contain department or company names rather than actual surnames. This indicates the field is being used flexibly to identify either specific contact persons or general hiring departments. The data is stored as text type, and all 1,000 entries contain valid values."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > volledigeNaam",
            "p_missing": 0.0,
            "p_distinct": 0.407,
            "n_distinct": 407,
            "type": "Text",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "Verantwoordelijke Human Resources": 102,
                "LGA IT": 59,
                "Kwery ": 35,
                "LGA Engineering": 34,
                "Ellen Vanderschueren": 19,
                "The Bee Academy": 12,
                "-": 12,
                "Le Grand & Associates": 11,
                "AGO Jobs & HR": 10,
                "Julie Sljepcevic": 10,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > volledigeNaam' appears to contain contact person names or department titles for job postings. In the analyzed dataset of 1,000 entries, this field has 100% completion rate with no missing values and contains 407 unique values (40.7% distinctness). The most frequent value is \"Verantwoordelijke Human Resources\" (appearing 102 times), followed by \"LGA IT\" (59 times) and \"Kwery\" (35 times). The data includes both personal names (like \"Ellen Vanderschueren\" and \"Julie Sljepcevic\") and organizational department names, suggesting it's used flexibly to identify either specific contact persons or general contact points for job applications."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > webadres",
            "p_missing": 0.154,
            "p_distinct": 0.9964539007092199,
            "n_distinct": 843,
            "type": "Text",
            "n_missing": 154,
            "n": 1000,
            "value_counts_without_nan": {
                "https://www.aplitrak.com/?adid=RXZ5TG9leXMuODQyMTUuMTAyMEBodWJvLmFwbGl0cmFrLmNvbQ": 2,
                "https://ses.howest.be": 2,
                "https://www.squarecity.be/jobs/senior-recruiter/": 2,
                "https://www.ictjob.be/en/apply/atcon-global-delivery-lead-program-manager/339124?cid=Partner_VDAB": 1,
                "https://www.jobat.be/nl/jobs/strategisch-aankoper-productieomgeving/job_4683612?utm_source=vdab&utm_medium=jobs&utm_campaign=partner": 1,
                "https://www.mmimir.nu/track/a57ee11e-d5d3-458e-b359-b5afc7f2f5cf": 1,
                "https://www.uantwerpen.be/nl/jobs/vacatures/ap/?q=4083&descr=Doctoraatsbursaal-in-de-theoretische-en-computationele-materiaalfysica": 1,
                "https://www.mmimir.nu/track/f60bcd5a-c0f2-48dd-9b80-1bb9b999648b": 1,
                "https://www.aplitrak.com/?adid=Z2VvZmZyZXkuMDQ4MjkuMTAyMEBwZW5zYWVydC5hcGxpdHJhay5jb20": 1,
                "http://www.experza.be/nl/vacatures/30081": 1,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > webadres' appears to contain web addresses (URLs) where job seekers can apply for positions. The data shows that 84.6% of entries contain a URL (with 154 missing values out of 1000 records). There is a high degree of uniqueness in the URLs, with 843 distinct values representing 99.6% of all non-missing entries. Most URLs appear to be application-specific links to job postings on various career sites and company websites, including recruitment platforms like Aplitrak, educational institutions, and corporate career pages. The few duplicate URLs in the dataset suggest that some job postings may be listed multiple times, though this is rare as most URLs are unique."
        },
        {
            "column_name": "profiel > sollicitatieInfo > viaBrief",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 991,
                "true": 9
            },
            "description": "The column 'profiel > sollicitatieInfo > viaBrief' is a boolean field that indicates whether job applications can be submitted via letter. In the dataset of 1,000 entries, this field is completely populated with no missing values. The vast majority of job postings (991 or 99.1%) do not accept applications by letter (false), while only a small minority of 9 postings (0.9%) do accept letter applications (true). This suggests that letter-based applications are a rare option in the current job market represented by this dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > viaVDAB",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 759,
                "true": 241
            },
            "description": "The column 'profiel > sollicitatieInfo > viaVDAB' is a boolean field that indicates whether job applications can be submitted through VDAB (Flemish Employment and Vocational Training Service). In the analyzed dataset of 1,000 records, this field is consistently populated with no missing values. The majority of job postings (75.9%) do not accept applications through VDAB (false), while 24.1% of postings do accept VDAB applications (true). This binary field has only two distinct values and appears to be a mandatory field in the dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > viaBezoek",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 864,
                "true": 136
            },
            "description": "The column 'profiel > sollicitatieInfo > viaBezoek' is a boolean field that indicates whether in-person visits are accepted as a method of job application. In the dataset of 1,000 records, this field is completely populated with no missing values. The majority of entries (864 or 86.4%) are set to \"false,\" while only 136 entries (13.6%) are marked as \"true,\" suggesting that most job postings do not accept walk-in applications or in-person visits as a method of applying."
        },
        {
            "column_name": "profiel > sollicitatieInfo > extraInfo > html",
            "p_missing": 0.829,
            "p_distinct": 0.7719298245614035,
            "n_distinct": 132,
            "type": "Text",
            "n_missing": 829,
            "n": 1000,
            "value_counts_without_nan": {
                "<p><span>Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.</span></p>": 13,
                "<b>Nieuw: Mobiel solliciteren</b> met je job board CV!": 8,
                "<p><span>Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.</span></p>": 4,
                "<p><span lang=\"EN-GB\">Interesse in deze job? </span><span>Of discreet op zoek naar een nieuwe uitdaging binnen IT, neem zeker contact met ons op. Wij nodigen u graag uit voor een kennismakend gesprek. </span></p> \n<p><span>Info@konnekt.be tav Amaury Locy - 09 298 01 07</span></p>": 4,
                "<p>Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.</p>": 3,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > extraInfo > html' contains HTML-formatted additional information related to job application details, but is largely unpopulated with 82.9% of entries being missing (829 out of 1000 records). Among the 171 non-null entries, there are 132 distinct values, indicating high variability in the content. The most common entry (appearing 13 times) is HTML text explaining that Vlaanderen Connect uses its own salary scales, followed by mobile application notifications (8 occurrences). The content appears to be primarily in Dutch and includes formatted text with HTML tags like <p> and <span>, containing information about salary details, application instructions, and contact information for job seekers."
        },
        {
            "column_name": "profiel > sollicitatieInfo > extraInfo > plainText",
            "p_missing": 0.829,
            "p_distinct": 0.7368421052631579,
            "n_distinct": 126,
            "type": "Text",
            "n_missing": 829,
            "n": 1000,
            "value_counts_without_nan": {
                "Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 19,
                "Nieuw: Mobiel solliciteren met je job board CV!": 8,
                "Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 6,
                "Interesse in deze job? Of discreet op zoek naar een nieuwe uitdaging binnen IT, neem zeker contact met ons op. Wij nodigen u graag uit voor een kennismakend gesprek. Info@konnekt.be tav Amaury Locy - 09 298 01 07": 4,
                "Heb je interesse? Kom dan langs in ons kantoor of contacteer ons via +32 14 88 88 03 of www.ago.jobs en schrijf je in!": 3,
                "Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.beis dus niet van toepassing op deze functie.": 3,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > extraInfo > plainText' appears to contain additional application information or instructions for job seekers in plain text format. It has a notably high missing rate of 82.9%, meaning most entries are empty. Among the 171 non-empty entries, there are 126 distinct values, indicating considerable variation in the messages. The most common message, appearing 19 times, relates to salary information for Vlaanderen Connect positions, stating that their own salary scales apply rather than the werkenvoorvlaanderen.be simulator. Other frequent messages include mobile application instructions and contact information for recruitment agencies. The content appears to be primarily in Dutch and typically contains specific instructions, contact details, or important notes about the application process."
        },
        {
            "column_name": "profiel > sollicitatieInfo > extraInfo > markdown",
            "p_missing": 0.829,
            "p_distinct": 0.7368421052631579,
            "n_distinct": 126,
            "type": "Text",
            "n_missing": 829,
            "n": 1000,
            "value_counts_without_nan": {
                "Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 19,
                "**Nieuw: Mobiel solliciteren** met je job board CV!": 8,
                "Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 6,
                "Interesse in deze job? Of discreet op zoek naar een nieuwe uitdaging binnen IT, neem zeker contact met ons op. Wij nodigen u graag uit voor een kennismakend gesprek. \n\nInfo@konnekt.be tav Amaury Locy - 09 298 01 07": 4,
                "Heb je interesse? Kom dan langs in ons kantoor of contacteer ons via +32 14 88 88 03 of www.ago.jobs en schrijf je in!": 3,
                "Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.beis dus niet van toepassing op deze functie.": 3,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > extraInfo > markdown' contains additional application information in markdown format, with a high missing data rate of 82.9%. Among the 1,000 entries, only 171 have values, with 126 distinct entries showing considerable variation in content. The most common entry (appearing 19 times) refers to Vlaanderen Connect's salary scales, while other frequent entries include information about mobile application options and contact details for job applications. The content appears to be primarily in Dutch and typically contains instructions for job applications, salary information, or contact details for further inquiries. The varied nature of the entries and high proportion of unique values (73.7% of non-null values are distinct) suggests this is a free-form text field used for specific application instructions or additional important information about the job application process."
        },
        {
            "column_name": "profiel > aanbod > aanbodEnVoordelen > html",
            "p_missing": 0.018,
            "p_distinct": 0.8676171079429735,
            "n_distinct": 852,
            "type": "Text",
            "n_missing": 18,
            "n": 1000,
            "value_counts_without_nan": {
                "-": 21,
                "<p><strong><span lang=\"NL\">Diversiteit:</span></strong><span lang=\"NL\"> Projecten in sectoren zoals fintech, healthcare, retail en overheid.</span></p> \n<p><strong><span lang=\"NL\">Groei:</span></strong><span lang=\"NL\"> Opleidingsbudget voor certificeringen.</span></p> \n<p><strong><span lang=\"NL\">Flexibiliteit:</span></strong><span lang=\"NL\"> Hybride werken en keuze uit projecten die aansluiten bij jouw interesses.</span></p> \n<p><strong>Part of the hive:</strong> Samenwerking met collega experts in cloud, security en data.</p> \n<p><strong><span lang=\"NL\">Salaris:</span></strong><span lang=\"NL\"> Competetief pakket met bonusregeling, afhankelijk van ervaring en inzet.</span></p>": 12,
                "more ...": -1
            },
            "description": "Based on the profiling data, the column 'profiel > aanbod > aanbodEnVoordelen > html' appears to be a text field containing HTML-formatted job benefits and offer details in job postings. The column has very high uniqueness with 85.7% distinct values (852 unique entries out of 1,000 total records) and a very low missing rate of only 1.8% (18 missing values). The most common value appears to be \"-\" occurring 21 times, followed by a detailed HTML-formatted description of job benefits (occurring 12 times) that includes information about diversity, growth opportunities, flexibility, collaboration, and salary packages. The HTML formatting suggests this field is used to display structured, formatted text about job benefits on web interfaces or job posting platforms."
        },
        {
            "column_name": "profiel > aanbod > aanbodEnVoordelen > plainText",
            "p_missing": 0.018,
            "p_distinct": 0.8238289205702648,
            "n_distinct": 809,
            "type": "Text",
            "n_missing": 18,
            "n": 1000,
            "value_counts_without_nan": {
                "-": 21,
                "Diversiteit: Projecten in sectoren zoals fintech, healthcare, retail en overheid. Groei: Opleidingsbudget voor certificeringen. Flexibiliteit: Hybride werken en keuze uit projecten die aansluiten bij jouw interesses. Part of the hive: Samenwerking met collega experts in cloud, security en data. Salaris: Competetief pakket met bonusregeling, afhankelijk van ervaring en inzet.": 12,
                "Wat mag je verwachten? Boeiende projecten bij gerenommeerde klanten, waar je echt het verschil kan maken Een cultuur waarin kennisdeling en continue groei centraal staan Opleidingsmogelijkheden afgestemd op jouw ambities en loopbaanpad Een dynamische omgeving met ruimte om door te groeien binnen een snelgroeiend bedrijf Veel autonomie, gecombineerd met de juiste ondersteuning wanneer je die nodig hebt Een competitief loonpakket, aangevuld met mooie extralegale voordelen Een uitgebreide hospitalisatie- en groepsverzekering Een stijlvolle bedrijfswagen waarmee je professioneel voor de dag komt": 11,
                "more ...": -1
            },
            "description": "Based on the profiling data, the 'profiel > aanbod > aanbodEnVoordelen > plainText' column contains text descriptions of job benefits and offers. The column has very high distinctness (82.4% unique values) among its 1,000 entries, with only 1.8% missing values (18 entries). The most common value is simply \"-\" appearing 21 times, followed by two detailed benefit descriptions that appear 12 and 11 times respectively, which outline comprehensive employment packages including aspects like diversity, growth opportunities, competitive salary, training budgets, company cars, and insurance benefits. The high number of unique entries suggests that most job postings have customized benefit descriptions rather than using standardized templates."
        },
        {
            "column_name": "profiel > aanbod > aanbodEnVoordelen > markdown",
            "p_missing": 0.018,
            "p_distinct": 0.8411405295315683,
            "n_distinct": 826,
            "type": "Text",
            "n_missing": 18,
            "n": 1000,
            "value_counts_without_nan": {
                "\\-": 21,
                "**Diversiteit:** Projecten in sectoren zoals fintech, healthcare, retail en overheid.\n\n**Groei:** Opleidingsbudget voor certificeringen.\n\n**Flexibiliteit:** Hybride werken en keuze uit projecten die aansluiten bij jouw interesses.\n\n**Part of the hive:** Samenwerking met collega experts in cloud, security en data.\n\n**Salaris:** Competetief pakket met bonusregeling, afhankelijk van ervaring en inzet.": 12,
                "more ...": -1
            },
            "description": "Based on the profiling data, the column 'profiel > aanbod > aanbodEnVoordelen > markdown' appears to be a text field that contains formatted descriptions of job benefits and offers in Markdown syntax. The column has very high distinctiveness (84.1% unique values) among its 1,000 entries, with only 1.8% missing values (18 entries). The most common value is a simple dash (\"-\") appearing 21 times, followed by a detailed benefits description that appears 12 times, which outlines aspects like diversity, growth opportunities, flexibility, collaboration, and salary packages. The high number of distinct values (826) suggests that most job postings have unique, customized benefit descriptions rather than standardized text."
        },
        {
            "column_name": "profiel > vereisteKwalificaties > html",
            "p_missing": 0.016,
            "p_distinct": 0.9095528455284553,
            "n_distinct": 895,
            "type": "Text",
            "n_missing": 16,
            "n": 1000,
            "value_counts_without_nan": {
                ".": 8,
                "-": 8,
                "more ...": -1
            },
            "description": "The column 'profiel > vereisteKwalificaties > html' appears to contain HTML-formatted text describing required qualifications for job positions. It has very high cardinality with 895 unique values out of 1,000 records (90.96% distinct values), suggesting that most qualification requirements are uniquely written for each job posting. The column has a very low missing rate with only 16 missing values (1.6% of the data). Some minimal entries appear to contain just simple characters like \".\" or \"-\" (8 occurrences each), but most entries are likely more detailed HTML-formatted qualification descriptions. The high distinctiveness suggests that employers typically provide custom, specific qualification requirements for each position rather than using standardized templates."
        },
        {
            "column_name": "profiel > vereisteKwalificaties > plainText",
            "p_missing": 0.016,
            "p_distinct": 0.8699186991869918,
            "n_distinct": 856,
            "type": "Text",
            "n_missing": 16,
            "n": 1000,
            "value_counts_without_nan": {
                ".": 8,
                "-": 8,
                "more ...": -1
            },
            "description": "The column 'profiel > vereisteKwalificaties > plainText' appears to contain text descriptions of required qualifications for job positions. It has very high cardinality with 856 unique values out of 1,000 records (87% distinct values), suggesting that most qualification requirements are uniquely written for each job posting. The column has a very low missing rate with only 16 missing values (1.6% of the data). Some minimal entries appear to contain just simple punctuation marks like \".\" and \"-\" (8 occurrences each), but most entries are likely more detailed qualification descriptions. The high distinctiveness of the values indicates that employers typically provide customized qualification requirements rather than using standardized templates."
        },
        {
            "column_name": "profiel > vereisteKwalificaties > markdown",
            "p_missing": 0.016,
            "p_distinct": 0.8810975609756098,
            "n_distinct": 867,
            "type": "Text",
            "n_missing": 16,
            "n": 1000,
            "value_counts_without_nan": {
                "\\-": 8,
                ".": 8,
                "more ...": -1
            },
            "description": "The column 'profiel > vereisteKwalificaties > markdown' contains text data describing required qualifications for job positions, with very high uniqueness (88.1% distinct values) across the dataset. Out of 1,000 entries, only 16 (1.6%) are missing values, indicating good data completeness. The most common values appear to be simple punctuation marks like \"-\" and \".\" which occur 8 times each, but the majority of entries are unique text descriptions. This suggests the column contains detailed, customized qualification requirements for each job posting, formatted in Markdown syntax."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > code",
            "p_missing": 0.112,
            "p_distinct": 0.0022522522522522522,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 112,
            "n": 1000,
            "value_counts_without_nan": {
                "ONBEPAALD": 881,
                "BEPAALD": 7
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > code' represents the type of employment contract being offered, with only two possible values: \"ONBEPAALD\" (indefinite term) or \"BEPAALD\" (fixed term). In the dataset of 1,000 entries, 11.2% of the values are missing, and among the non-missing values, the vast majority (881) are indefinite term contracts while only 7 entries are fixed-term contracts. This highly imbalanced distribution suggests that indefinite term contracts are the predominant type of employment agreement offered in these job postings."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > label",
            "p_missing": 0.112,
            "p_distinct": 0.0022522522522522522,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 112,
            "n": 1000,
            "value_counts_without_nan": {
                "onbepaalde duur": 881,
                "bepaalde duur": 7
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > label' contains information about the type of employment contract being offered. It is a categorical field with only two possible values: \"onbepaalde duur\" (indefinite duration) and \"bepaalde duur\" (fixed-term). Out of 1,000 records, 11.2% (112 entries) are missing values. Among the non-missing values, the vast majority (881) are for indefinite duration contracts, while only 7 entries are for fixed-term contracts, showing a strong preference for permanent employment arrangements in this dataset."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > kortLabel",
            "p_missing": 0.112,
            "p_distinct": 0.0022522522522522522,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 112,
            "n": 1000,
            "value_counts_without_nan": {
                "onbepaalde duur": 881,
                "bepaalde duur": 7
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > kortLabel' contains categorical data about contract types, with only two possible values: \"onbepaalde duur\" (indefinite duration) and \"bepaalde duur\" (fixed duration). Out of 1,000 records, 11.2% (112 entries) are missing values. Among the non-missing values, the vast majority (881) are indefinite duration contracts, while only 7 entries are fixed-duration contracts, showing a strong imbalance towards indefinite duration employment contracts in this dataset."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > zoSpoedigMogelijkStarten",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 576,
                "true": 424
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > zoSpoedigMogelijkStarten' is a boolean field that indicates whether a position requires starting as soon as possible. The column has complete data with no missing values across all 1,000 records. It contains only two distinct values (true/false), with 576 entries (57.6%) marked as \"false\" and 424 entries (42.4%) marked as \"true\". This suggests that slightly more than half of the job positions do not require an immediate start, while a substantial portion do require candidates to begin work as soon as possible."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontractLijn",
            "p_missing": 0.112,
            "p_distinct": 0.0022522522522522522,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 112,
            "n": 1000,
            "value_counts_without_nan": {
                "onbepaalde duur": 881,
                "bepaalde duur": 7
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontractLijn' appears to contain information about the type of employment contract being offered. It is a categorical variable with only two possible values: \"onbepaalde duur\" (indefinite duration) and \"bepaalde duur\" (fixed-term). Out of 1,000 records, 11.2% (112 entries) are missing values. Among the non-missing values, the vast majority (881) are indefinite duration contracts, while only 7 entries are fixed-term contracts, showing a strong skew toward indefinite duration employment arrangements."
        },
        {
            "column_name": "profiel > beroepCompetenties",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the provided profiling data, the column 'profiel > beroepCompetenties' appears to be a consistently populated field with no missing values across all 1,000 records. The data type is marked as \"Unsupported,\" which suggests it likely contains complex or structured data that doesn't fit into standard data types. Given its name (\"beroepCompetenties\" translates to \"professional competencies\" from Dutch), this column probably contains lists or structured information about professional skills or competencies required for the job positions, though the exact format cannot be determined from the provided metrics alone."
        },
        {
            "column_name": "profiel > persoonsGebondenCompetenties",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the provided profiling data, the column 'profiel > persoonsGebondenCompetenties' appears to be present in all 1,000 records with no missing values (p_missing = 0.0, n_missing = 0). The column is classified as \"Unsupported\" type, which typically suggests it contains complex or nested data structures that don't fit standard data types. Given its name (\"persoonsGebondenCompetenties\" translates to \"person-bound competencies\" from Dutch), this column likely contains lists or structured data about personal competencies or skills required for the job positions, though the exact format cannot be determined from the provided metrics alone."
        },
        {
            "column_name": "profiel > studies",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the profiling data, the column 'profiel > studies' is present in all 1,000 records with no missing values (p_missing = 0.0, n_missing = 0). The column is classified as an \"Unsupported\" type, which typically indicates it contains complex or nested data structures that don't fit standard data types. Given the column name includes \"studies\" and is under the \"profiel\" (profile) path, it likely contains information about educational requirements or study-related qualifications for the job positions, though the exact structure of this data cannot be determined from the provided profiling information alone."
        },
        {
            "column_name": "profiel > studiesGelijkwaardigDoorErvaring",
            "p_missing": 0.0,
            "p_distinct": 0.002,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 0,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 717,
                "true": 283
            },
            "description": "The column 'profiel > studiesGelijkwaardigDoorErvaring' is a boolean field that indicates whether equivalent experience can substitute for formal educational requirements in a job posting. In the dataset of 1,000 entries, this field is consistently populated (no missing values) with only two possible values: true or false. The majority of entries (717 or 71.7%) are marked as \"false,\" while 283 entries (28.3%) are marked as \"true,\" suggesting that most job postings do not accept experience as an equivalent substitute for the required educational qualifications."
        },
        {
            "column_name": "profiel > rijbewijzen",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "The column 'profiel > rijbewijzen' appears to be present in all 1,000 records with no missing values. It is classified as an \"Unsupported\" data type, which typically suggests it contains complex or structured data (possibly an array or nested object) rather than simple scalar values. Given the column name includes \"rijbewijzen\" (Dutch for \"driving licenses\"), it likely contains information about required or relevant driving licenses for the job positions, though the specific structure of this data cannot be determined from the provided profiling information alone."
        },
        {
            "column_name": "profiel > jobdomeinen",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "Based on the profiling data, the column 'profiel > jobdomeinen' is present in all 1,000 records with no missing values (0% missing rate). The column type is marked as \"Unsupported,\" which typically indicates it contains complex or nested data structures that don't fit standard data types. Given its name (\"jobdomeinen\" translates to \"job domains\" from Dutch), this column likely contains lists or structured data describing the professional domains or sectors relevant to each job posting, though the exact format cannot be determined from the provided profiling data alone."
        },
        {
            "column_name": "profiel > attesten",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "The column 'profiel > attesten' appears to be a special or complex data type (marked as \"Unsupported\" in the profiling) that is present in all 1,000 records with no missing values. Given its name (\"attesten\" means \"certificates\" in Dutch) and the context that this appears to be a job posting dataset, this column likely contains information about required certificates or qualifications for the job positions, though the specific structure or format of this data cannot be determined from the provided profiling information alone."
        },
        {
            "column_name": "profiel > talenKennis",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "The column 'profiel > talenKennis' appears to be present in all 1,000 records with no missing values. It is classified as an \"Unsupported\" data type, which typically indicates it contains complex or structured data (likely an array or nested object) rather than simple scalar values. Given the column name which translates to \"language knowledge\" in English, this column probably contains structured information about language requirements or skills for the job postings, though the exact format and structure cannot be determined from the provided profiling data alone."
        },
        {
            "column_name": "profiel > vakbewkaamheidsattesten",
            "p_missing": 0.0,
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1000,
            "description": "The column 'profiel > vakbewkaamheidsattesten' (professional competency certificates) is present in all 1,000 records with no missing values. It appears to contain data in an unsupported or complex format, likely an array or nested structure, which makes it difficult to analyze using conventional statistical methods. This column presumably stores information about professional certifications or competency attestations required or relevant for the job positions."
        },
        {
            "column_name": "profiel > c2BeroepsCompetentieProfielTitel",
            "p_missing": 0.003,
            "p_distinct": 0.12637913741223672,
            "n_distinct": 126,
            "type": "Text",
            "n_missing": 3,
            "n": 1000,
            "value_counts_without_nan": {
                "Software ontwikkelaar": 131,
                "Support medewerker ICT": 79,
                "Systeembeheerder": 63,
                "Integratie expert ICT": 59,
                "Data engineer": 52,
                "Expert productieproces en -methodes": 41,
                "Data scientist": 34,
                "Data manager": 28,
                "Verantwoordelijke kwaliteitscontrole": 27,
                "Productieplanner": 24,
                "more ...": -1
            },
            "description": "The column 'profiel > c2BeroepsCompetentieProfielTitel' appears to contain job profile or professional competency titles, with very high data completeness (only 0.3% missing values). From the 1,000 records analyzed, there are 126 unique titles (12.6% distinct values), suggesting this is a standardized list of professional roles. The most common job titles are technology-focused, with \"Software ontwikkelaar\" (Software developer) being the most frequent (131 occurrences), followed by \"Support medewerker ICT\" (ICT Support staff) and \"Systeembeheerder\" (System administrator). The data suggests this column is primarily used to categorize job positions with an emphasis on IT, data, and production-related roles."
        },
        {
            "column_name": "externeReferentie",
            "p_missing": 0.199,
            "p_distinct": 0.9962546816479401,
            "n_distinct": 798,
            "type": "Text",
            "n_missing": 199,
            "n": 1000,
            "value_counts_without_nan": {
                "YI": 3,
                "Lily": 2,
                "10485741": 1,
                "P1637486-189": 1,
                "001/002083/1629376674": 1,
                "P1907001-1": 1,
                "bbij0482918169BBBH12928": 1,
                "10597949": 1,
                "10527910": 1,
                "163352": 1,
                "more ...": -1
            },
            "description": "The 'externeReferentie' column appears to be a text field containing external reference codes or identifiers, with 19.9% of its values missing across the 1,000 records. The column shows high uniqueness, with 99.63% of non-null values being distinct (798 unique values). Most values appear to be alphanumeric codes or identifiers, with varying formats including simple numbers (like \"163352\"), complex codes with slashes (like \"001/002083/1629376674\"), and alphanumeric combinations (like \"bbij0482918169BBBH12928\"). Only a few values show any repetition, with \"YI\" appearing 3 times and \"Lily\" appearing twice, suggesting this column likely serves as an external reference or tracking number system with minimal duplication."
        },
        {
            "column_name": "profiel > opdrachtgever > tonenOpdrachtgever",
            "p_missing": 0.194,
            "p_distinct": 0.0024813895781637717,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 194,
            "n": 1000,
            "value_counts_without_nan": {
                "false": 525,
                "true": 281
            },
            "description": "The column 'profiel > opdrachtgever > tonenOpdrachtgever' is a boolean field that indicates whether the client/employer information should be displayed. In the dataset of 1,000 records, 19.4% of the entries are missing values. Among the non-missing values, \"false\" appears 525 times and \"true\" appears 281 times, showing that in most cases (about 65% of valid entries) the client information is not meant to be shown. This appears to be a display control flag that determines the visibility of employer details in the job posting system."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente",
            "p_missing": 0.727,
            "p_distinct": 0.2087912087912088,
            "n_distinct": 57,
            "type": "Text",
            "n_missing": 727,
            "n": 1000,
            "value_counts_without_nan": {
                "ANTWERPEN": 61,
                "BRUSSEL": 26,
                "ROESELARE": 20,
                "SINT-GILLIS": 14,
                "DIEGEM": 13,
                "MEERHOUT": 10,
                "ZAVENTEM": 10,
                "ELSENE": 9,
                "SINT-LAMBRECHTS-WOLUWE": 8,
                "OUDERGEM": 6,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente' contains municipality or city names in Belgium, with a notably high missing data rate of 72.7%. Among the 273 non-missing values, there are 57 distinct municipalities represented, indicating moderate variety in locations. Antwerp (ANTWERPEN) is the most frequently occurring municipality with 61 entries, followed by Brussels (BRUSSEL) with 26 entries and Roeselare with 20 entries. The data appears to cover both Dutch-speaking (e.g., Antwerpen, Roeselare) and French-speaking (e.g., Sint-Gillis, Oudergem) regions of Belgium, suggesting a nationwide distribution of locations."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode",
            "p_missing": 0.727,
            "p_distinct": 0.21245421245421245,
            "n_distinct": 58,
            "type": "Text",
            "n_missing": 727,
            "n": 1000,
            "value_counts_without_nan": {
                "2000": 47,
                "1000": 26,
                "8800": 20,
                "1060": 14,
                "2018": 13,
                "1831": 13,
                "2450": 10,
                "1930": 10,
                "1050": 9,
                "1200": 8,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode' contains Belgian postal codes, with a notably high missing data rate of 72.7%. Out of 1,000 records, only 273 have postal code values. The data is stored as text and includes 58 unique postal codes, with \"2000\" (Antwerp) being the most frequent, appearing 47 times, followed by \"1000\" (Brussels) with 26 occurrences, and \"8800\" (Roeselare) with 20 occurrences. The distribution suggests a concentration of job postings in major Belgian cities, particularly in the Flanders and Brussels regions."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus",
            "p_missing": 0.727,
            "p_distinct": 0.2967032967032967,
            "n_distinct": 81,
            "type": "Text",
            "n_missing": 727,
            "n": 1000,
            "value_counts_without_nan": {
                "": 46,
                "Frankrijklei 101": 21,
                "Houtskoolstraat 17": 13,
                "Fonsnylaan 20": 12,
                "Lil 24": 10,
                "Havenlaan 88": 8,
                "Lange Klarenstraat 19": 8,
                "Solvynsstraat 49": 7,
                "Avenue des Communautés 110": 7,
                "Frankrijklei 156": 7,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus' appears to contain street addresses with house numbers in Belgium, with a notably high missing data rate of 72.7%. Of the data that is present (273 entries), there are 81 unique values, suggesting multiple job listings share the same addresses. The most common non-empty value is \"Frankrijklei 101\", appearing 21 times, followed by \"Houtskoolstraat 17\" with 13 occurrences. Interestingly, there are also 46 empty strings among the non-null values, indicating that some records have this field present but without actual content. The addresses appear to be in both Dutch and French, reflecting Belgium's bilingual nature."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn",
            "p_missing": 0.727,
            "p_distinct": 0.3992673992673993,
            "n_distinct": 109,
            "type": "Text",
            "n_missing": 727,
            "n": 1000,
            "value_counts_without_nan": {
                "Frankrijklei 101 2000 ANTWERPEN": 21,
                "Houtskoolstraat 17 8800 ROESELARE": 13,
                "Fonsnylaan 20 1060 SINT-GILLIS": 12,
                "Lil 24 2450 MEERHOUT": 10,
                "1000 BRUSSEL": 9,
                "Lange Klarenstraat 19 2000 ANTWERPEN": 8,
                "Havenlaan 88 1000 BRUSSEL": 8,
                "Solvynsstraat 49 2018 ANTWERPEN": 7,
                "Frankrijklei 156 2000 ANTWERPEN": 7,
                "Avenue des Communautés 110 1200 SINT-LAMBRECHTS-WOLUWE": 7,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn' appears to contain structured address information in a single-line format for employer/client physical locations in Belgium. The column has a high missing rate of 72.7%, with only 273 out of 1000 entries containing data. Among the non-missing values, there are 109 unique addresses, suggesting some addresses are used multiple times. The most frequent address appears 21 times (\"Frankrijklei 101 2000 ANTWERPEN\"), and the addresses generally follow a consistent format of street name, number, postal code, and city name. The addresses are predominantly in Belgian cities like Antwerpen, Roeselare, Brussels, and Sint-Gillis, and are written in both Dutch and French, reflecting Belgium's bilingual nature."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > code",
            "p_missing": 0.727,
            "p_distinct": 0.007326007326007326,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 727,
            "n": 1000,
            "value_counts_without_nan": {
                "BE": 271,
                "NL": 2
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > code' contains country codes, with a high missing data rate of 72.7%. Among the 273 non-missing values, there are only two distinct codes: \"BE\" (Belgium) appearing 271 times and \"NL\" (Netherlands) appearing 2 times. This categorical column appears to primarily represent Belgian locations, with a very small representation of Dutch locations, suggesting that most job postings with available location data are based in Belgium."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > label",
            "p_missing": 0.727,
            "p_distinct": 0.007326007326007326,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 727,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 271,
                "Nederland": 2
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > label' contains country labels for the physical location of the client/contractor's contact method. This categorical field has a high missing rate of 72.7%, with only 273 non-null values out of 1,000 records. Among the populated values, there are only two distinct countries represented: \"België\" (Belgium) appears 271 times, while \"Nederland\" (Netherlands) appears just 2 times, showing a strong predominance of Belgian locations in the dataset."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > kortLabel",
            "p_missing": 0.727,
            "p_distinct": 0.007326007326007326,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 727,
            "n": 1000,
            "value_counts_without_nan": {
                "België": 271,
                "Nederland": 2
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > kortLabel' contains abbreviated country labels for the physical location of the client/contractor. It has a high missing data rate of 72.7%, with only 273 valid entries out of 1,000 records. Among the non-missing values, there are only two distinct countries represented: \"België\" (Belgium) appears 271 times, while \"Nederland\" (Netherlands) appears just 2 times, showing a strong predominance of Belgian locations in the dataset."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > naam",
            "p_missing": 0.721,
            "p_distinct": 0.3835125448028674,
            "n_distinct": 107,
            "type": "Text",
            "n_missing": 721,
            "n": 1000,
            "value_counts_without_nan": {
                "Smals": 15,
                "MICHAEL PAGE INTERNATIONAL (BELGIUM)": 11,
                "CLOVR": 10,
                "BIZZTALENT": 8,
                "VIVALDIS - HK": 8,
                "Digitaal Vlaanderen": 8,
                "Kingfisher IT": 7,
                "Madison Recruitment": 7,
                "Experis Belgium": 7,
                "LGA Engineering": 6,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > naam' appears to contain physical location names or company names associated with job postings, but has a notably high missing data rate of 72.1%. Among the 279 non-null entries, there are 107 unique values, indicating moderate variety in the locations/companies listed. The most frequently occurring entries include \"Smals\" (15 occurrences), \"MICHAEL PAGE INTERNATIONAL (BELGIUM)\" (11 occurrences), and \"CLOVR\" (10 occurrences), suggesting these are common employers or location names in the dataset. The column is text-based and appears to primarily contain company or organization names that are likely associated with physical business locations."
        },
        {
            "column_name": "profiel > opdrachtgever > naam",
            "p_missing": 0.721,
            "p_distinct": 0.3835125448028674,
            "n_distinct": 107,
            "type": "Text",
            "n_missing": 721,
            "n": 1000,
            "value_counts_without_nan": {
                "Smals": 15,
                "MICHAEL PAGE INTERNATIONAL (BELGIUM)": 11,
                "CLOVR": 10,
                "BIZZTALENT": 8,
                "VIVALDIS - HK": 8,
                "Digitaal Vlaanderen": 8,
                "Kingfisher IT": 7,
                "Madison Recruitment": 7,
                "Experis Belgium": 7,
                "LGA Engineering": 6,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > naam' appears to contain employer or client organization names in a job posting dataset. It has a notably high missing data rate of 72.1%, with only 279 out of 1000 entries containing values. Among the non-missing values, there are 107 distinct organization names, with companies like Smals (15 entries), MICHAEL PAGE INTERNATIONAL (BELGIUM) (11 entries), and CLOVR (10 entries) being the most frequently occurring. The data suggests this column primarily contains recruitment agencies, consulting firms, and technology companies, though many entries are either missing or distributed across a wide range of different organizations."
        },
        {
            "column_name": "profiel > opdrachtgever > ondernemingsnummer",
            "p_missing": 0.719,
            "p_distinct": 0.29537366548042704,
            "n_distinct": 83,
            "type": "Text",
            "n_missing": 719,
            "n": 1000,
            "value_counts_without_nan": {
                "": 22,
                "0477750635": 16,
                "0406798006": 15,
                "0402724895": 14,
                "0455332351": 13,
                "0473647436": 13,
                "0789240993": 10,
                "0843195858": 8,
                "0599940248": 8,
                "0728770304": 8,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > ondernemingsnummer' appears to contain Belgian company registration numbers (ondernemingsnummer/numéro d'entreprise), which are unique identifiers for businesses in Belgium. The column has a high missing rate of 71.9% (719 out of 1000 records), and among the non-missing values, there are 83 distinct numbers. The values are stored as text and typically follow a format of 10 digits (e.g., \"0477750635\", \"0406798006\"). Some entries are empty strings (\"\"), which appear 22 times in the dataset. This suggests that while the column is meant to capture company identification numbers, it's not consistently populated across all records."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus",
            "p_missing": 0.684,
            "p_distinct": 0.12341772151898735,
            "n_distinct": 39,
            "type": "Categorical",
            "n_missing": 684,
            "n": 1000,
            "value_counts_without_nan": {
                "2": 103,
                "101": 31,
                "60": 29,
                "B3": 20,
                "A": 18,
                "1": 17,
                "B": 16,
                "01": 14,
                "6": 8,
                "3.1": 6,
                "7": 6,
                "2a": 5,
                "001": 5,
                "ARC": 3,
                "205": 3,
                "4": 3,
                "82": 2,
                "3": 2,
                "31": 2,
                "UNIT 11": 2,
                "bus 2": 2,
                "13": 2,
                "0": 1,
                "B2": 1,
                "4.0": 1,
                "1a": 1,
                "495": 1,
                "b2": 1,
                "152": 1,
                "21": 1,
                "45": 1,
                "3000": 1,
                "0401": 1,
                "43": 1,
                "GN": 1,
                "8": 1,
                "5": 1,
                "D": 1,
                "16": 1
            },
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus' appears to contain mailbox or post box numbers for physical locations of suppliers. The data is notably sparse, with 68.4% of values missing across the 1,000 records. Among the 316 non-null entries, there are 39 unique values, with \"2\" being the most common (103 occurrences), followed by \"101\" (31 occurrences) and \"60\" (29 occurrences). The values vary in format, including simple numbers (\"2\", \"1\"), alphanumeric combinations (\"B3\", \"2a\"), and occasionally more descriptive entries (\"UNIT 11\", \"bus 2\"). This suggests some inconsistency in how mailbox numbers are recorded, though most entries are relatively simple numeric or alphanumeric identifiers."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer",
            "p_missing": 0.773,
            "p_distinct": 0.2643171806167401,
            "n_distinct": 60,
            "type": "Text",
            "n_missing": 773,
            "n": 1000,
            "value_counts_without_nan": {
                "101": 22,
                "17": 17,
                "24": 13,
                "20": 12,
                "5": 11,
                "49": 10,
                "11": 8,
                "110": 8,
                "19": 8,
                "88": 8,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer' appears to contain street numbers or building numbers for physical addresses. It has a notably high missing rate of 77.3%, with only 227 out of 1000 entries containing values. Among the non-null values, there are 60 distinct numbers, with \"101\" being the most frequent (22 occurrences), followed by \"17\" (17 occurrences) and \"24\" (13 occurrences). The values are stored as text type, suggesting they might include non-numeric characters, though the shown examples are all numeric. This column is likely part of a structured address format for employer contact information."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straat",
            "p_missing": 0.773,
            "p_distinct": 0.3303964757709251,
            "n_distinct": 75,
            "type": "Text",
            "n_missing": 773,
            "n": 1000,
            "value_counts_without_nan": {
                "Frankrijklei": 29,
                "Houtskoolstraat": 13,
                "Havenlaan": 12,
                "Fonsnylaan": 12,
                "Lil": 10,
                "Lange Klarenstraat": 8,
                "Avenue des Communautés": 7,
                "Solvynsstraat": 7,
                "Culliganlaan": 6,
                "Da Vincilaan": 6,
                "more ...": -1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straat' contains street names for physical locations, but has a notably high missing data rate of 77.3%. Among the 227 non-null entries, there are 75 unique street names, with \"Frankrijklei\" being the most frequent (29 occurrences), followed by \"Houtskoolstraat\" (13 occurrences), and \"Havenlaan\" and \"Fonsnylaan\" (12 occurrences each). The data appears to include both Dutch and French street names, suggesting locations in Belgium, and represents structured address information for employer contact methods."
        },
        {
            "column_name": "leverancier > organisatie > erkenningsnummer",
            "p_missing": 0.765,
            "p_distinct": 0.19148936170212766,
            "n_distinct": 45,
            "type": "Categorical",
            "n_missing": 765,
            "n": 1000,
            "value_counts_without_nan": {
                "VG. 2233/UC": 41,
                "VG 2406/U": 31,
                "VG.565/BO\r\n00217-405-20121108\r\nW.RS.153\r\nW.SO.153\r\nW.RE.153\r\n": 16,
                "VG/609/U/BUOSA 54-406 54-405 W.INT.511": 13,
                "\r\nActief Interim: V.G.20/BUP -W.INT.033-BXL\r\nActief Construct : V.G. 806/BC - W.INTC.002-BXL B-AA04.019\r\nActief NV: 01018": 13,
                " VG 158/BUC": 12,
                "Erkenningsnummer: : Vlaams gewest/Région Flamande: VG.153/BUOSAP - Brussel/Bruxelles:B.00202-406-20121106 - B.00202-405-20121106 - Waals gewest/Région Wallonne: W.INT.021 - W.RS.021 - W.RE.021 - W.SO.021": 11,
                "Vlaanderen VG .631/BUOP, Brussel Bruxelles 00254-406-20121120/00254-405-20121120, Wallonie W.RS.001/W.INT.001 ": 10,
                "VG.1038/BU - BHG: 00298-406-20121129 - BHG: 00298-405-20121129 - W.INT.279": 10,
                "VG.607/BUO\r\n0072-405-20121019\r\n0072-406-20121019\r\nW.RS.197\r\nW.INT.197\r\nW.SO.197": 7,
                "VG.361/BUOP | W-INT-RS-9 |  Bxl:00374-406-20130208 & 00374-405-20130123": 6,
                "VG 292/BUOSA Erkenning Brussels Gewest n�00322-406-20121217": 6,
                "VG.2019/U  \r\nW. DISP 999\r\n00558-406-20160504": 4,
                "VG.431/BUO W.INT.237 B-AA04.014": 4,
                "Erk. nr. VG.234/BUO - VG.234/BUOC - W.INT.041 - BHG 00269-40(6)(5)-20121121": 3,
                "VG.2313/U": 3,
                "VG 1176/BUOSAC": 3,
                "VG.458/BUOSAP,00256-406-20121120,01933": 3,
                "VG2262/U61104404": 3,
                "Agilitas wil de maatschappij zo goed mogelijk weerspiegelen. Kandidaten worden geselecteerd op basis van hun kwaliteiten en vaardigheden, ongeacht geslacht, leeftijd, afkomst of handicap. VG. 1246/BUOSAP - B-C07.002 - 00309-405-20121204 - 00309-406-20130311 - W.INT.RE.RS.SO.148 - DC:40103": 3,
                "Erk./Rec. VG 496/BUO & W020 & B 00424-406-20130311 & B 00424-405-20130311": 2,
                "VG599/BUOSAP": 2,
                "? 2014 Robert Half. A. Gossetlaan 28A b7 / 1702 Groot-Bijgaarden RPR Brussels - VG.453/BUO - W.INT.030 / W.RS.030 / Erkenning van het Brussels Hoofdstedelijk Gewest: 00238-406-20121114 / Geregistreerd in het Brussels Hoofdstedelijk Gewest: 00238-405-20121114 / Agrément de la Région de Bruxelles-Capitale: 00238-406-20121114 / Enregistré dans la Région de Bruxelles-Capitale: 00238-405-20121114": 2,
                "VG.13/BUO\r\n00305-406-20121204\r\nW.97.83": 2,
                "VG.1312/BC\r\n00137-406-20121024\r\nW.INT.10": 2,
                "Erkenning Vlaams gewest:\tVG2101/U\r\nErkenning Brussels gewest:\t00176-406-20150327\r\n": 2,
                "2062\\U\r\n2326\\U": 2,
                "VG:VG.1537/BU, BHG-UA:00134-406-20121024, WG:W.INT.534\r\n": 2,
                "VG 496/BUO & W020 & B 00424-406-20130311 & B 00424-405-20130311": 1,
                "2295/U": 1,
                "64675282\r\n": 1,
                "Erk.nr. VG 47/BU; W.INT.214; BHG 00354-406-20130122.": 1,
                "IMPACT NV - 00167-406-20121030, VG.277/BU, W.INT.692, DG-LAV-007\r\nIMPACT CONSTRUCTION NV - 00319-406-20121213, VG.1154/BC, W.DISPC.12, DG-LAV-008\t\r\n": 1,
                "65708407": 1,
                "VG/1380/BC 55-406 W.DISP.900": 1,
                "VG.1842/BU / VG.1842/BUC": 1,
                "71456473\r\n": 1,
                "VG 1570/BU\r\n00396-405-20130225\r\nW.INT.682 ": 1,
                "VG 2038/U ? W.DISP 938 VG 2089/U ? W.DISP 1067 VG 2214/U ? W.DISP 1322\r\n67950937 ": 1,
                "023/111747/1674223718": 1,
                "102/461647/1712570115": 1,
                "VG.71/BUOSAPC": 1,
                "VG. 2095/U": 1,
                "VG 2099/UP\r\n\r\n": 1,
                "Q Jobs - erkenningsnr: VG.1555/BUOC-W.INT.546-B-00197-405-20121106": 1
            },
            "description": "Based on the profiling data, 'leverancier > organisatie > erkenningsnummer' appears to be a categorical column containing various types of organizational recognition or license numbers, primarily for employment agencies in Belgian regions (Vlaanderen/VG, Brussels/BHG, and Wallonie/W). The column has a high missing rate of 76.5%, with only 235 out of 1000 entries containing values. Among the non-missing values, there are 45 distinct entries, with the most common being \"VG. 2233/UC\" (41 occurrences) and \"VG 2406/U\" (31 occurrences). The values typically follow regional coding patterns (e.g., VG for Vlaanderen, W for Wallonie) and often include multiple recognition numbers for different regions or services, suggesting these are official registration/license numbers for organizations operating across different Belgian jurisdictions."
        },
        {
            "column_name": "profiel > sollicitatieInfo > cvGewenst",
            "p_missing": 0.865,
            "p_distinct": 0.014814814814814815,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 865,
            "n": 1000,
            "value_counts_without_nan": {
                "true": 134,
                "false": 1
            },
            "description": "The column 'profiel > sollicitatieInfo > cvGewenst' appears to be a boolean field that indicates whether a CV is required for the job application. In the dataset of 1,000 entries, this field is largely missing with 865 null values (86.5% missing rate). Of the 135 records where this information is available, the vast majority (134 cases) indicate that a CV is required (true), while only 1 case indicates that a CV is not required (false). This suggests that when this field is explicitly specified, employers almost always require candidates to submit a CV with their application."
        },
        {
            "column_name": "profiel > aanbod > minimumBrutoloon",
            "p_missing": 0.784,
            "mean": 3252.703703703704,
            "p_distinct": 0.14351851851851852,
            "max": 5167.0,
            "n_distinct": 31,
            "type": "Numeric",
            "n_missing": 784,
            "std": 723.6750492565371,
            "min": 0.0,
            "n": 1000,
            "value_counts_without_nan": {
                "3000.0": 45,
                "3500.0": 36,
                "2500.0": 29,
                "4000.0": 28,
                "2800.0": 13,
                "3600.0": 8,
                "5000.0": 7,
                "3800.0": 7,
                "3300.0": 5,
                "2350.0": 5,
                "more ...": -1
            },
            "description": "The column 'profiel > aanbod > minimumBrutoloon' appears to represent minimum gross salary data in job postings. It has a high missing rate of 78.4%, with only 216 out of 1000 entries containing values. The salaries range from €0 to €5,167, with a mean of €3,253 and a standard deviation of €724. The most common minimum salary offered is €3,000 (45 occurrences), followed by €3,500 (36 occurrences) and €2,500 (29 occurrences). The column contains 31 distinct salary values, suggesting that employers tend to round these figures to common increments."
        },
        {
            "column_name": "profiel > aanbod > maximumBrutoloon",
            "p_missing": 0.784,
            "mean": 4676.231481481482,
            "p_distinct": 0.1574074074074074,
            "max": 7500.0,
            "n_distinct": 34,
            "type": "Numeric",
            "n_missing": 784,
            "std": 954.6467760891094,
            "min": 0.0,
            "n": 1000,
            "value_counts_without_nan": {
                "4500.0": 44,
                "5000.0": 38,
                "4000.0": 27,
                "6000.0": 19,
                "3500.0": 14,
                "5500.0": 13,
                "3800.0": 7,
                "4200.0": 5,
                "3600.0": 4,
                "5300.0": 3,
                "more ...": -1
            },
            "description": "The column 'profiel > aanbod > maximumBrutoloon' appears to represent the maximum gross salary offered for job positions, with values in what are likely euros. This column has a significant amount of missing data, with 78.4% of the 1,000 entries being empty. Among the populated entries, the values range from €0 to €7,500, with a mean of approximately €4,676 and a standard deviation of about €955. The most frequently occurring maximum salary amounts are €4,500 (44 occurrences) and €5,000 (38 occurrences). The column shows moderate diversity in its values, with 34 distinct amounts representing 15.7% of all non-null entries, suggesting that employers tend to cluster around certain standard salary bands."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > beginDatum",
            "p_missing": 0.924,
            "p_distinct": 0.618421052631579,
            "max": "2025-10-15 00:00:00",
            "n_distinct": 47,
            "type": "DateTime",
            "n_missing": 924,
            "min": "2024-06-11 00:00:00",
            "n": 1000,
            "value_counts_without_nan": {
                "2025-09-01 00:00:00": 5,
                "2025-08-29 00:00:00": 4,
                "2025-07-02 00:00:00": 4,
                "2025-07-09 00:00:00": 4,
                "2025-07-11 00:00:00": 4,
                "2025-08-21 00:00:00": 3,
                "2025-08-14 00:00:00": 2,
                "2025-07-01 00:00:00": 2,
                "2025-08-08 00:00:00": 2,
                "2025-08-04 00:00:00": 2,
                "more ...": -1
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > beginDatum' contains proposed start dates for employment contracts, stored as DateTime values. This column has a notably high missing rate of 92.4%, with only 76 out of 1000 records containing values. The dates range from June 11, 2024, to October 15, 2025, with 47 unique dates in total. Among the non-missing values, September 1, 2025, is the most common start date (appearing 5 times), followed by several dates in July and August 2025 (appearing 4 times each). The high proportion of missing values and the future-dated entries suggest this field is primarily used for positions with planned or scheduled start dates."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > onGestructureerdAdres > lijnen",
            "p_missing": 0.925,
            "type": "Unsupported",
            "n_missing": 925,
            "n": 1000,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > onGestructureerdAdres > lijnen' appears to contain unstructured address line information for business locations, but it is largely empty with 92.5% of its values missing (925 out of 1000 records). The data type is marked as \"Unsupported,\" suggesting it may contain complex or non-standard data formats. This column likely serves as an alternative way to store address information when structured address fields cannot be used, but its high missing rate indicates it's not commonly utilized in this dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > email",
            "p_missing": 0.677,
            "p_distinct": 0.44272445820433437,
            "n_distinct": 143,
            "type": "Text",
            "n_missing": 677,
            "n": 1000,
            "value_counts_without_nan": {
                "it@lga.jobs": 59,
                "selectiesvlaanderenconnect@vlaanderen.be": 18,
                "engineering@lga.jobs": 17,
                "supply@lga.jobs": 15,
                "legal@legrand-associates.com": 11,
                "outsourcing@bizztalent.be": 8,
                "roel@kingfisher-it.be": 7,
                "els@oxida.be": 5,
                "michael@kingfisher-it.be": 5,
                "jobs@newpointprofessionals.be": 5,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > email' contains email addresses for job application contact points. It has a notably high missing data rate of 67.7%, with only 323 out of 1000 entries containing values. Among the populated entries, there are 143 unique email addresses, indicating significant variety in contact points. The most frequently occurring email address is \"it@lga.jobs\" which appears 59 times, followed by \"selectiesvlaanderenconnect@vlaanderen.be\" with 18 occurrences. The data suggests this column primarily contains corporate recruitment email addresses, with several recruitment agencies and IT companies being prominent in the most frequent values."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > telefoon",
            "p_missing": 0.678,
            "p_distinct": 0.40683229813664595,
            "n_distinct": 131,
            "type": "Text",
            "n_missing": 678,
            "n": 1000,
            "value_counts_without_nan": {
                "+32 3 300 27 61": 30,
                "+32 51 49 51 01": 14,
                "+32 9 395 32 01": 12,
                "+32 9 352 00 29": 11,
                "093520104": 11,
                "+32 3 300 27 60": 10,
                "+32 51 49 51 00": 10,
                "+ 32 478 46 07 72": 7,
                "036480213": 7,
                "+32 471 50 78 51": 6,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > telefoon' contains telephone contact numbers, with a significant proportion of missing values (67.8% of entries are empty). Among the 322 non-empty entries, there are 131 unique phone numbers, suggesting some repetition of contact numbers across listings. The phone numbers appear to be predominantly Belgian numbers (indicated by the \"+32\" country code), though some are formatted without the international prefix. The most frequently occurring number appears 30 times (\"+32 3 300 27 61\"), and the format varies between international format with spaces and continuous digit strings, indicating inconsistent formatting across entries."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > onGestructureerdAdres > lijnen",
            "p_missing": 0.986,
            "type": "Unsupported",
            "n_missing": 986,
            "n": 1000,
            "description": "The column 'profiel > sollicitatieInfo > adres > onGestructureerdAdres > lijnen' appears to be an unsupported data type column that is largely empty, with 98.6% of its values (986 out of 1000 records) being missing. This extremely high missing rate suggests that this field, which likely contains unstructured address lines for job application contact information, is rarely used in the dataset, with only 14 records containing any data. The column's \"Unsupported\" type classification indicates that the data format may be complex or non-standard."
        },
        {
            "column_name": "bijlage",
            "p_missing": 0.958,
            "p_distinct": 1.0,
            "n_distinct": 42,
            "type": "Text",
            "n_missing": 958,
            "n": 1000,
            "value_counts_without_nan": {
                "VC_vacature_PO_2025_DFB.pdf": 1,
                "Vacature - Data Scientist Expert.pdf": 1,
                "Vacature project engineer.pdf": 1,
                "Data projectleider.pdf": 1,
                "20250822 Vacature System Engineer.pdf": 1,
                "Advert ITS Technician.pdf": 1,
                "Customer Success Manager CIOC Energy.pdf": 1,
                "Functioneel Analist Expert Loketplatform.pdf": 1,
                "Vacature_process-engineer.pdf": 1,
                "Vlaanderen connect-FB Functioneel en Test Analist _11042025.pdf": 1,
                "more ...": -1
            },
            "description": "The 'bijlage' (attachment) column is a text field that appears to contain filenames of job-related PDF documents, primarily consisting of vacancy announcements and job descriptions. This column is notably sparse, with 95.8% of the values being missing (958 out of 1000 records). When present, each value is unique (100% distinct values), with 42 different filenames in total. The filenames typically follow patterns like \"Vacature_[job title].pdf\" or specific job posting descriptions, suggesting these are attachments containing detailed job information. The files appear to be predominantly in Dutch/Flemish, with some English titles, and cover various professional roles such as Data Scientists, Engineers, and Analysts."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postbus",
            "p_missing": 0.949,
            "p_distinct": 0.3333333333333333,
            "n_distinct": 17,
            "type": "Categorical",
            "n_missing": 949,
            "n": 1000,
            "value_counts_without_nan": {
                "60": 27,
                "A": 6,
                "2": 3,
                "13": 2,
                "3": 1,
                "WEVELGEM": 1,
                "288": 1,
                "0021": 1,
                "31": 1,
                "UNI": 1,
                "3000": 1,
                "43": 1,
                "0.10": 1,
                "B": 1,
                "5": 1,
                "Roeselare": 1,
                "UNIT 11": 1
            },
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postbus' appears to be a categorical field containing post box information for business locations. It is sparsely populated, with 94.9% of the values being missing (949 out of 1000 records). Among the 51 non-missing values, there are 17 distinct entries, with \"60\" being the most common post box number (27 occurrences). The values include a mix of numeric post box numbers (like \"60\", \"2\", \"13\"), alphabetic identifiers (like \"A\", \"B\"), and some potentially erroneous entries that appear to be city names (like \"Roeselare\", \"WEVELGEM\"). The varied format of entries suggests some inconsistency in how post box information is recorded in this field."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > postbus",
            "p_missing": 0.9,
            "p_distinct": 0.21,
            "n_distinct": 21,
            "type": "Categorical",
            "n_missing": 900,
            "n": 1000,
            "value_counts_without_nan": {
                "60": 29,
                "B": 13,
                "1": 11,
                "0401": 8,
                "A": 6,
                "7": 5,
                "2": 5,
                "31": 3,
                "2a": 3,
                "5": 2,
                "3": 2,
                "UNI": 2,
                "bus 2": 2,
                "13": 2,
                "1A": 1,
                "4.0": 1,
                "21": 1,
                "45": 1,
                "3000": 1,
                "43": 1,
                "16": 1
            },
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > postbus' appears to contain post box or mailbox numbers for structured addresses in job application information. This field has a very high missing rate of 90%, with only 100 out of 1000 entries containing values. Among the non-missing values, there are 21 distinct entries, with \"60\" being the most common (29 occurrences), followed by \"B\" (13 occurrences) and \"1\" (11 occurrences). The values vary in format, including simple numbers (\"1\", \"2\", \"60\"), letters (\"A\", \"B\"), combinations (\"1A\", \"2a\"), and occasionally more specific formats like \"bus 2\" or four-digit numbers (\"0401\", \"3000\"), suggesting some inconsistency in how post box numbers are recorded."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > code",
            "p_missing": 0.88,
            "p_distinct": 0.016666666666666666,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 880,
            "n": 1000,
            "value_counts_without_nan": {
                "MVR": 82,
                "DHR": 38
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > code' appears to be a categorical field containing gender/title codes for contact persons, with only two possible values: \"MVR\" (likely meaning \"Mevrouw\" or \"Mrs.\") and \"DHR\" (likely meaning \"De Heer\" or \"Mr.\"). The column has a high missing rate of 88%, with only 120 non-null values out of 1000 records. Among the non-null values, \"MVR\" appears more frequently (82 times) than \"DHR\" (38 times), suggesting that female contact persons are more common in this dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > label",
            "p_missing": 0.88,
            "p_distinct": 0.016666666666666666,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 880,
            "n": 1000,
            "value_counts_without_nan": {
                "Mevr.": 82,
                "Dhr.": 38
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > label' contains formal titles for contact persons, specifically \"Mevr.\" (Mevrouw/Mrs.) and \"Dhr.\" (De heer/Mr.). This field has a high missing rate of 88%, with only 120 non-null values out of 1000 records. Among the populated entries, \"Mevr.\" appears more frequently (82 times) than \"Dhr.\" (38 times), suggesting that female contact persons are more common in this dataset. The column is categorical in nature with just two distinct values, making it a binary gender-specific title indicator when present."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > kortLabel",
            "p_missing": 0.88,
            "p_distinct": 0.016666666666666666,
            "n_distinct": 2,
            "type": "Categorical",
            "n_missing": 880,
            "n": 1000,
            "value_counts_without_nan": {
                "Mevrouw": 82,
                "Heer": 38
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > kortLabel' contains formal titles for contact persons, with only two distinct values: \"Mevrouw\" (Mrs./Ms.) and \"Heer\" (Mr.). This field has a high missing rate of 88%, with only 120 non-null values out of 1,000 records. Among the populated entries, \"Mevrouw\" appears more frequently (82 times) compared to \"Heer\" (38 times). The categorical nature and limited distinct values suggest this is a standardized field for formal addressing in contact information, though its high missing rate indicates it's not consistently populated in the dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > fax",
            "p_missing": 0.975,
            "p_distinct": 0.56,
            "n_distinct": 14,
            "type": "Text",
            "n_missing": 975,
            "n": 1000,
            "value_counts_without_nan": {
                "03 600 79 69": 10,
                "056 24 12 92": 3,
                "09 233 28 25": 1,
                "056 36 41 63": 1,
                "000-000 00 00": 1,
                "02 270 25 96": 1,
                "058 33 00 46": 1,
                "015 30 53 00": 1,
                "02 775 76 11": 1,
                "050 79 18 40": 1,
                "more ...": -1
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > fax' contains fax numbers for contact persons and shows very limited usage in the dataset. With 97.5% of values missing (975 out of 1000 records), it's clear that fax numbers are rarely provided in the contact information. When fax numbers are present, they follow a Belgian phone number format (e.g., \"03 600 79 69\"), and there are only 14 unique values across the entire dataset. The most frequently occurring fax number appears 10 times, suggesting minimal reuse of fax numbers across different listings. This low utilization rate reflects the declining relevance of fax communication in modern business practices."
        },
        {
            "column_name": "profiel > sollicitatieInfo > einddatumSollicitatie",
            "p_missing": 0.991,
            "p_distinct": 0.7777777777777778,
            "max": "2025-11-25 00:00:00",
            "n_distinct": 7,
            "type": "DateTime",
            "n_missing": 991,
            "min": "2025-09-03 00:00:00",
            "n": 1000,
            "value_counts_without_nan": {
                "2025-09-30 00:00:00": 3,
                "2025-09-03 00:00:00": 1,
                "2025-09-15 00:00:00": 1,
                "2025-09-09 00:00:00": 1,
                "2025-11-25 00:00:00": 1,
                "2025-09-22 00:00:00": 1,
                "2025-09-04 00:00:00": 1
            },
            "description": "The column 'profiel > sollicitatieInfo > einddatumSollicitatie' appears to contain application deadline dates for job postings. It is sparsely populated, with 99.1% of values being missing (991 out of 1000 records). Of the 9 non-null values present, there are 7 distinct dates, all falling between September 3, 2025, and November 25, 2025. The most frequently occurring deadline date is September 30, 2025, which appears 3 times, while all other dates appear only once. The data is stored in DateTime format with timestamps set to midnight (00:00:00)."
        },
        {
            "column_name": "profiel > sollicitatieInfo > motivatieGewenst",
            "p_missing": 0.95,
            "p_distinct": 0.04,
            "n_distinct": 2,
            "type": "Boolean",
            "n_missing": 950,
            "n": 1000,
            "value_counts_without_nan": {
                "true": 47,
                "false": 3
            },
            "description": "The column 'profiel > sollicitatieInfo > motivatieGewenst' is a boolean field that indicates whether a motivation letter is required for the job application. This column has a very high missing rate of 95% (950 out of 1000 records are null), and among the 50 non-null values, the vast majority (47) are marked as \"true\" while only 3 are \"false\". This suggests that when this field is explicitly specified, employers typically do require a motivation letter from applicants."
        },
        {
            "column_name": "laatstePublicatieDatum",
            "p_missing": 0.983,
            "p_distinct": 0.8235294117647058,
            "max": "2025-10-31 00:00:00+00:00",
            "n_distinct": 14,
            "type": "DateTime",
            "n_missing": 983,
            "min": "2025-01-21 00:00:00+00:00",
            "n": 1000,
            "value_counts_without_nan": {
                "2025-10-10 00:00:00+00:00": 3,
                "2025-08-18 00:00:00+00:00": 2,
                "2025-09-25 00:00:00+00:00": 1,
                "2025-10-31 00:00:00+00:00": 1,
                "2025-09-17 00:00:00+00:00": 1,
                "2025-09-22 00:00:00+00:00": 1,
                "2025-09-15 00:00:00+00:00": 1,
                "2025-08-11 00:00:00+00:00": 1,
                "2025-02-03 00:00:00+00:00": 1,
                "2025-01-21 00:00:00+00:00": 1,
                "more ...": -1
            },
            "description": "The 'laatstePublicatieDatum' (last publication date) column is a DateTime field that shows significant sparsity, with 98.3% of its values being missing (983 out of 1000 records). The non-null values span from January 21, 2025 to October 31, 2025, with only 17 total entries. Among these entries, there are 14 distinct dates, with October 10, 2025 being the most frequently occurring date (appearing 3 times), followed by August 18, 2025 (appearing twice), while the remaining dates appear only once each. This suggests the column might be used to track future publication dates for a small subset of records in the dataset."
        },
        {
            "column_name": "beheerder > email",
            "p_missing": 0.981,
            "p_distinct": 0.7368421052631579,
            "n_distinct": 14,
            "type": "Text",
            "n_missing": 981,
            "n": 1000,
            "value_counts_without_nan": {
                "Sigrid.Vanderstiggel@vdab.be": 3,
                "sara.opsomer@vdab.be": 2,
                "nancy.vervaet@vdab.be": 2,
                "Gerda.Piens@vdab.be": 2,
                "virginie.gielen@vdab.be": 1,
                "an.geerdens@vdab.be": 1,
                "oksana.willekens@vdab.be": 1,
                "Sellem.Zahir@vdab.be": 1,
                "kevin.bemelmans@vdab.be": 1,
                "Sahila.ElBoudaati@vdab.be": 1,
                "more ...": -1
            },
            "description": "The column 'beheerder > email' contains email addresses, predominantly from the vdab.be domain, and appears to represent administrator or manager contact information. This column is notably sparse, with 98.1% of the values being missing (981 out of 1000 records). Among the 19 non-null entries, there are 14 unique email addresses, suggesting some administrators manage multiple records. The most frequently occurring email address is \"Sigrid.Vanderstiggel@vdab.be\" which appears 3 times, followed by several addresses that appear twice, such as \"sara.opsomer@vdab.be\" and \"nancy.vervaet@vdab.be\"."
        },
        {
            "column_name": "beheerder > gebruikersnaam",
            "p_missing": 0.981,
            "p_distinct": 0.7368421052631579,
            "n_distinct": 14,
            "type": "Text",
            "n_missing": 981,
            "n": 1000,
            "value_counts_without_nan": {
                "SVDSTIGG": 3,
                "SOPSOME1": 2,
                "NVERVAET": 2,
                "GPIENS": 2,
                "VGIELEN2": 1,
                "AGEERDE1": 1,
                "OWILLEK1": 1,
                "SZAHIR": 1,
                "KBEMELMA": 1,
                "SELBOUDA": 1,
                "more ...": -1
            },
            "description": "The column 'beheerder > gebruikersnaam' appears to contain usernames or user IDs, with a very high missing data rate of 98.1%. Out of 1,000 total records, only 19 entries have values, and among these there are 14 unique usernames. The usernames follow an alphanumeric format, typically appearing as capitalized letters (like \"SVDSTIGG\" and \"SOPSOME1\"). Some usernames appear multiple times, with \"SVDSTIGG\" being the most frequent at 3 occurrences, while \"SOPSOME1\", \"NVERVAET\", and \"GPIENS\" each appear twice. Given the high missing rate and the format of the usernames, this column likely represents administrative or management user accounts associated with only a small subset of the records."
        },
        {
            "column_name": "beheerder > naam",
            "p_missing": 0.981,
            "p_distinct": 0.7368421052631579,
            "n_distinct": 14,
            "type": "Text",
            "n_missing": 981,
            "n": 1000,
            "value_counts_without_nan": {
                "Sigrid VANDERSTIGGEL": 3,
                "Sara OPSOMER": 2,
                "Nancy VERVAET": 2,
                "Gerda PIENS": 2,
                "Virginie GIELEN": 1,
                "An GEERDENS": 1,
                "Oksana WILLEKENS": 1,
                "Sellem ZAHIR": 1,
                "Kevin BEMELMANS": 1,
                "Sahila EL BOUDAATI": 1,
                "more ...": -1
            },
            "description": "The column 'beheerder > naam' appears to contain administrator or manager names and is sparsely populated, with 98.1% of its values being missing (981 out of 1000 records). Among the 19 non-missing values, there are 14 unique names, indicating some names appear multiple times. The most frequent name is \"Sigrid VANDERSTIGGEL\" appearing 3 times, followed by \"Sara OPSOMER,\" \"Nancy VERVAET,\" and \"Gerda PIENS\" each appearing twice. The names appear to be formatted in a standardized way with full names in what seems to be a Belgian/Dutch naming convention, using all capital letters for surnames."
        },
        {
            "column_name": "beheerder > telefoon",
            "p_missing": 0.988,
            "mean": 32478696822.333332,
            "p_distinct": 0.8333333333333334,
            "max": 32499594891.0,
            "n_distinct": 10,
            "type": "Numeric",
            "n_missing": 988,
            "std": 9481502.557126628,
            "min": 32470972815.0,
            "n": 1000,
            "value_counts_without_nan": {
                "32475827143.0": 2,
                "32470972815.0": 2,
                "32476951323.0": 1,
                "32474570691.0": 1,
                "32499594891.0": 1,
                "32473652086.0": 1,
                "32471792626.0": 1,
                "32477890438.0": 1,
                "32496628916.0": 1,
                "32479680981.0": 1
            },
            "description": "The column 'beheerder > telefoon' appears to contain phone numbers, likely Belgian phone numbers given their format and length. It is a notably sparse column with 98.8% of values being missing (988 out of 1000 records are null). Among the 12 non-null entries, there are 10 unique values, indicating very little duplication. The phone numbers are stored as numeric values ranging from 32470972815 to 32499594891, with the prefix \"32\" likely representing Belgium's country code. The most frequent values appear only twice in the dataset, suggesting these might be contact numbers for different administrators or managers (\"beheerder\" in Dutch)."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > functie",
            "p_missing": 0.927,
            "p_distinct": 0.4931506849315068,
            "n_distinct": 36,
            "type": "Categorical",
            "n_missing": 927,
            "n": 1000,
            "value_counts_without_nan": {
                "Recruiter": 9,
                "Recruitment Manager": 8,
                "Rekruteringsverantwoordelijke": 5,
                "HR": 5,
                "HR Business Partner": 4,
                "Bestuurder": 4,
                "HR Manager": 3,
                "Talent Acquisition Partner": 3,
                "Recruitment consultant": 2,
                "Matchmaker": 2,
                "Recruitment officer": 2,
                "Zaakvoerder": 2,
                "Consultant": 1,
                "Recruitment Consultant": 1,
                "Senior Consultant": 1,
                "zaakvoerder": 1,
                "Talent Acquisition Specialist": 1,
                "HR Recruiter": 1,
                "CEO": 1,
                "HR Admin Coordinator": 1,
                "Operationeel teamcoördinator": 1,
                "Finance & HR": 1,
                "Business Manager": 1,
                "HR-verantwoordelijke": 1,
                "Sales Development Manager": 1,
                "Directeur": 1,
                "HR Verantwoordelijke": 1,
                "Coördinator Rekrutering": 1,
                "CSO": 1,
                "HR manager": 1,
                "Teamlead": 1,
                "Recruitment Expert": 1,
                "COO": 1,
                "HR Consultant": 1,
                "Talent Acquisition Team Lead": 1,
                "HR consulente": 1
            },
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > functie' contains job titles or roles of contact persons for job applications, but is largely unpopulated with 92.7% missing values. Among the 73 entries that do have data, there are 36 unique job titles, indicating significant variety in how these roles are labeled. The most common titles are Recruiter (9 entries), Recruitment Manager (8 entries), and tied for third are Rekruteringsverantwoordelijke and HR (5 entries each). The titles appear to be primarily in English and Dutch, and are mostly related to HR, recruitment, and management positions, ranging from entry-level roles to executive positions (such as CEO, COO, and CSO)."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus",
            "p_missing": 0.995,
            "p_distinct": 0.6,
            "n_distinct": 3,
            "type": "Text",
            "n_missing": 995,
            "n": 1000,
            "value_counts_without_nan": {
                "31": 3,
                "4.2": 1,
                "0401": 1
            },
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus' appears to contain postal box numbers, but is very sparsely populated with 99.5% of values being missing (995 out of 1000 records are null). Among the few populated entries (only 5 records), there are 3 distinct values: \"31\" (occurring 3 times), \"4.2\" (occurring once), and \"0401\" (occurring once). This suggests that when present, the field stores postal box information in various formats, including both numeric and decimal notations."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeEindDatum",
            "p_missing": 0.995,
            "p_distinct": 1.0,
            "max": "2026-08-31 00:00:00",
            "n_distinct": 5,
            "type": "DateTime",
            "n_missing": 995,
            "min": "2025-08-27 00:00:00",
            "n": 1000,
            "value_counts_without_nan": {
                "2025-09-28 00:00:00": 1,
                "2025-12-31 00:00:00": 1,
                "2026-08-31 00:00:00": 1,
                "2025-08-27 00:00:00": 1,
                "2026-06-30 00:00:00": 1
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeEindDatum' appears to contain expected end dates for employment contracts. It is a DateTime column that is largely empty, with 99.5% of its values (995 out of 1000 records) being missing. Of the 5 existing values, each appears exactly once and ranges from August 27, 2025 to August 31, 2026. The sparse population of this field suggests it's an optional field that is rarely filled in, possibly only used for fixed-term employment contracts where an end date is known in advance."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeAanwerfDatum",
            "p_missing": 0.999,
            "p_distinct": 1.0,
            "max": "2025-07-28 00:00:00",
            "n_distinct": 1,
            "type": "DateTime",
            "n_missing": 999,
            "min": "2025-07-28 00:00:00",
            "n": 1000,
            "value_counts_without_nan": {
                "2025-07-28 00:00:00": 1
            },
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeAanwerfDatum' appears to be a DateTime field that represents the expected hiring date for job positions. This column is almost entirely empty, with 99.9% of its values (999 out of 1000 records) being missing. Only one record contains an actual date value of July 28, 2025. Given the extremely high percentage of missing values and single unique date entry, this suggests it's an optional field that is rarely utilized in the dataset."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen",
            "p_missing": 0.998,
            "type": "Unsupported",
            "n_missing": 998,
            "n": 1000,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen' appears to be a rarely populated field in the dataset, with 99.8% of its values missing (998 out of 1000 records). The column is marked as an \"Unsupported\" data type, suggesting it may contain complex or non-standard data structures. With only 2 non-null values in the entire dataset, this column is essentially sparse and likely not a primary or reliable source of information for analysis."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen",
            "p_missing": 0.998,
            "type": "Unsupported",
            "n_missing": 998,
            "n": 1000,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen' appears to be a rarely populated field in the dataset, with 99.8% of its values missing (998 out of 1000 records). The column is marked as an \"Unsupported\" type, suggesting it may contain complex or non-standard data structures. Given its nested path structure in the column name, it likely contains unstructured address line information for physical locations of suppliers (leveranciers), but its extremely high missing rate indicates it's not a commonly used field in the dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > fax",
            "p_missing": 0.999,
            "p_distinct": 1.0,
            "n_distinct": 1,
            "type": "Text",
            "n_missing": 999,
            "n": 1000,
            "value_counts_without_nan": {
                "056 61 72 06": 1
            },
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > fax' appears to be a text field containing fax numbers for job application contact information. It is very sparsely populated, with 99.9% of the values being missing (999 out of 1000 records are null). Only one record contains a fax number (\"056 61 72 06\"), making it an extremely rare data point in the dataset. This suggests that fax numbers are no longer a common or preferred method of contact for job applications in this system."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsNetCode > code",
            "p_missing": 0.999,
            "p_distinct": 1.0,
            "n_distinct": 1,
            "type": "Text",
            "n_missing": 999,
            "n": 1000,
            "value_counts_without_nan": {
                "0404": 1
            },
            "description": "The column 'onderwijsgegevens > onderwijsNetCode > code' is almost entirely empty, with 99.9% of its values being missing (999 out of 1000 records are null). In the single instance where data is present, it contains the text value \"0404\". This appears to be a rarely populated field that might represent some form of educational network code, though its extreme sparsity makes it difficult to draw broader conclusions about its typical usage or significance in the dataset."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsNetCode > label",
            "p_missing": 0.999,
            "p_distinct": 1.0,
            "n_distinct": 1,
            "type": "Text",
            "n_missing": 999,
            "n": 1000,
            "value_counts_without_nan": {
                "Wenst les te geven in het gemeentelijk, stedelijk en provinciaal onderwijs": 1
            },
            "description": "The column 'onderwijsgegevens > onderwijsNetCode > label' is a text field that is almost entirely empty, with 99.9% of its values (999 out of 1000 records) being missing. Only one record contains actual data, which is the text \"Wenst les te geven in het gemeentelijk, stedelijk en provinciaal onderwijs\" (indicating a preference to teach in municipal, city, and provincial education). This appears to be a highly sparse column that likely represents educational network preferences or teaching system designations in the Dutch/Flemish education system."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsNetCode > kortLabel",
            "p_missing": 0.999,
            "p_distinct": 1.0,
            "n_distinct": 1,
            "type": "Text",
            "n_missing": 999,
            "n": 1000,
            "value_counts_without_nan": {
                "het gemeentelijk, stedelijk en provinciaal onderwijs": 1
            },
            "description": "The column 'onderwijsgegevens > onderwijsNetCode > kortLabel' appears to be a text field that is almost entirely empty, with 99.9% of its values (999 out of 1000 records) being missing. Only one record contains actual data, which is the value \"het gemeentelijk, stedelijk en provinciaal onderwijs\". This suggests that this column is rarely used in the dataset and likely represents some form of educational network code label, specifically related to municipal, city, and provincial education systems."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsVakken",
            "p_missing": 0.999,
            "type": "Unsupported",
            "n_missing": 999,
            "n": 1000,
            "description": "The column 'onderwijsgegevens > onderwijsVakken' appears to be an unsupported data type column that is almost entirely empty, with 99.9% of its values (999 out of 1000 records) being missing. With only one non-missing value in the dataset and its unsupported type classification, this column likely contains specialized educational subject data but is very sparsely populated, making it of limited analytical value in its current state."
        }
    ]
}