{
    "description": "Based on the provided JSON data profile, this dataset appears to be a comprehensive job listings database, likely from a Belgian employment platform. Here's a detailed summary:\n\nThe dataset contains 1,878 active job listings, primarily focused on technical and IT-related positions such as Software Engineers, IT Support Engineers, System Engineers, and Data Engineers. The jobs are predominantly located in Belgium, with a small number of positions in the Netherlands.\n\nThe majority of positions (about 98%) are full-time roles with permanent contracts (onbepaalde duur). The listings come from three main sources: intermediaries (961 listings), third-party providers (498 listings), and direct company postings (419 listings).\n\nThe data structure includes detailed information about:\n- Job descriptions and requirements in multiple formats (HTML, plain text, and markdown)\n- Company and recruiter contact information\n- Salary ranges (when provided)\n- Work locations, with many positions concentrated in major Belgian cities like Antwerp, Brussels, and Ghent\n- Application methods and requirements (CV, motivation letter)\n- Employment terms and conditions\n- Company branding elements (logos, color schemes for job posting displays)\n\nThe listings appear to be current, with publication dates ranging into 2025, suggesting this is an active recruitment database. Most positions offer flexible work arrangements, with options for both office-based and hybrid working models. The dataset also includes comprehensive application tracking features and multiple language support, reflecting Belgium's multilingual business environment.\n\nThis appears to be a professional recruitment platform's database, likely used by both direct employers and recruitment agencies to post and manage job listings, with a particular focus on technical and professional roles in the Belgian market.",
    "columns": [
        {
            "column_name": "status",
            "value_counts_without_nan": {
                "ACTIEF": 1878
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0005324813631522897,
            "p_missing": 0.0,
            "n_distinct": 1,
            "description": "The 'status' column is a categorical field that contains information about the status of job listings. It has 1,878 entries with no missing values, and remarkably, it contains only one unique value: \"ACTIEF\" (meaning \"ACTIVE\" in Dutch), which appears in all rows. This suggests that this dataset only includes active job listings, with all inactive or closed listings likely being filtered out before the data was collected. The column is complete (0% missing values) and uniform in its content."
        },
        {
            "column_name": "gepubliceerd",
            "value_counts_without_nan": {
                "true": 1878
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0005324813631522897,
            "p_missing": 0.0,
            "n_distinct": 1,
            "description": "The column 'gepubliceerd' is a boolean field that appears in all 1,878 records with no missing values. It shows a single distinct value of \"true\" across all entries, indicating that every record in the dataset is in a published state. This suggests the dataset only contains published items and may be filtering out unpublished entries. The column is very uniform with zero variability in its values."
        },
        {
            "column_name": "gesloten",
            "value_counts_without_nan": {
                "false": 1878
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0005324813631522897,
            "p_missing": 0.0,
            "n_distinct": 1,
            "description": "The column 'gesloten' is a Boolean field that appears in all 1,878 records with no missing values. It contains exclusively \"false\" values, indicating it's likely a flag or status indicator that shows whether something is closed (with \"false\" presumably meaning \"not closed\"). The column has only one distinct value (false), making it a constant column in this dataset. While this might seem redundant, it could be part of a larger system where \"true\" values are possible but just don't appear in this particular dataset."
        },
        {
            "column_name": "aantalJobs",
            "min": 1,
            "value_counts_without_nan": {
                "1": 1856,
                "2": 11,
                "3": 6,
                "5": 3,
                "6": 1,
                "10": 1
            },
            "type": "Numeric",
            "n_missing": 0,
            "n": 1878,
            "max": 10,
            "p_distinct": 0.003194888178913738,
            "std": 0.3162458868877187,
            "p_missing": 0.0,
            "n_distinct": 6,
            "mean": 1.0260915867944622,
            "description": "The 'aantalJobs' column represents the number of job positions available for each job posting, ranging from 1 to 10 positions. The vast majority of postings (1,856 out of 1,878 total records) are for single positions, with only a small number of postings advertising multiple vacancies. The column has no missing values and contains just 6 distinct values (1, 2, 3, 5, 6, and 10 jobs), with an average of approximately 1.03 jobs per posting and a relatively small standard deviation of 0.32, indicating minimal variation from the predominant single-position pattern."
        },
        {
            "column_name": "dubbels",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'dubbels' appears to be a complete dataset with no missing values across all 1,878 records. It is classified as an \"Unsupported\" data type, which suggests it may contain complex or non-standard data structures that don't fit into common data types like numbers or strings. Without additional information about the actual values or content patterns in this column, I cannot make specific claims about what the data represents, though the Dutch word \"dubbels\" typically refers to \"duplicates\" or \"doubles.\""
        },
        {
            "column_name": "laatsteWijzigingDatum",
            "min": "2024-04-08 13:51:21+00:00",
            "value_counts_without_nan": {
                "2025-08-30 14:45:51+00:00": 2,
                "2025-09-01 09:26:49+00:00": 2,
                "2025-08-29 00:05:05+00:00": 2,
                "2025-08-14 09:16:21+00:00": 2,
                "2025-08-18 10:24:51+00:00": 2,
                "2025-08-30 14:45:46+00:00": 2,
                "2025-08-21 11:19:01+00:00": 1,
                "2025-08-27 14:34:27+00:00": 1,
                "2025-08-29 14:02:11+00:00": 1,
                "2025-08-15 00:04:02+00:00": 1,
                "more ...": -1
            },
            "type": "DateTime",
            "n_missing": 0,
            "n": 1878,
            "max": "2025-09-02 18:58:40+00:00",
            "p_distinct": 0.9968051118210862,
            "p_missing": 0.0,
            "n_distinct": 1872,
            "description": "The 'laatsteWijzigingDatum' column contains datetime values representing the last modification dates of entries, stored in UTC format (with +00:00 timezone offset). The column has 1,878 total entries with no missing values, and shows remarkably high uniqueness with 1,872 distinct values (99.7% distinct). The timestamps range from April 8, 2024, at 13:51:21 UTC to September 2, 2025, at 18:58:40 UTC, with a small number of duplicate timestamps occurring across multiple entries. This suggests the column tracks precise modification timestamps for records, with most modifications occurring at unique moments in time."
        },
        {
            "column_name": "eerstePublicatieDatum",
            "min": "2019-03-04 13:43:11+00:00",
            "value_counts_without_nan": {
                "2025-08-29 00:05:05+00:00": 2,
                "2025-08-14 09:16:21+00:00": 2,
                "2024-09-11 17:18:17+00:00": 2,
                "2025-09-01 09:17:03+00:00": 1,
                "2025-04-10 09:57:29+00:00": 1,
                "2025-07-30 14:27:27+00:00": 1,
                "2025-05-19 14:56:19+00:00": 1,
                "2024-08-20 10:01:57+00:00": 1,
                "2025-06-27 12:51:24+00:00": 1,
                "2025-07-05 02:58:44+00:00": 1,
                "more ...": -1
            },
            "type": "DateTime",
            "n_missing": 0,
            "n": 1878,
            "max": "2025-09-02 18:58:40+00:00",
            "p_distinct": 0.9984025559105432,
            "p_missing": 0.0,
            "n_distinct": 1875,
            "description": "The column 'eerstePublicatieDatum' (which appears to mean \"first publication date\" in Dutch) contains timestamp data with timezone information (UTC+00:00). It has 1,878 total entries with no missing values, and almost every entry is unique (99.84% distinct values). The timestamps range from March 4, 2019 13:43:11 UTC to September 2, 2025 18:58:40 UTC, with some dates appearing multiple times (for example, August 29, 2025 00:05:05 and August 14, 2025 09:16:21 each appear twice). The column is consistently formatted as DateTime values, suggesting it reliably tracks the initial publication timing of each record in the dataset."
        },
        {
            "column_name": "prioriteit",
            "value_counts_without_nan": {
                "3": 843,
                "1": 837,
                "5": 198
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.001597444089456869,
            "p_missing": 0.0,
            "n_distinct": 3,
            "description": "The 'prioriteit' (priority) column is a categorical field present in all 1,878 records with no missing values. It contains three distinct priority levels: 1, 3, and 5. The distribution shows that levels 3 and 1 are the most common, occurring 843 and 837 times respectively, while level 5 appears less frequently with 198 occurrences. This suggests a priority ranking system where most entries are classified as either low (1) or medium (3) priority, with fewer high-priority (5) items."
        },
        {
            "column_name": "deelDatabanken",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "Based on the provided profiling data, the 'deelDatabanken' column is present in all 1,878 records with no missing values (p_missing = 0.0). The column is classified as \"Unsupported\" type, which typically indicates it contains complex or non-standard data structures (possibly arrays, nested objects, or other specialized formats) that couldn't be analyzed using conventional statistical methods. Without additional information about the actual contents, we can only confirm that this column is consistently populated across the entire dataset."
        },
        {
            "column_name": "jobPosting",
            "value_counts_without_nan": {
                "{\"title\":\"Technisch projectingenieur energie\",\"description\":\"Ben jij het beu om vast te roesten achter een bureau? Zoek je **variatie**, verantwoordelijkheid en **vrijheid** in je job? Als jij houdt van techniek, zelf je planning regelt en je graag in het veld bewijst, lees dan zeker verder. **Geen prikklok**, wel vertrouwen.  \\n  \\n**Wat ga je doen?**  \\nAls **field engineer** ben jij de schakel tussen techniek, analyse en klantgerichte oplossingen. Als field service engineer:  \\n\\n\\n *  Analyseer je **technische problemen** op **locatie** en stel je structurele verbeteringen voor.\\n *  **Organiseer je zelf je agenda** en bepaal je eigen werkritme. Jij plant je week: soms één klant, soms vier. Geen dag is dezelfde.\\n *  **Start je installaties op** (commissioning) en voer je veiligheidscontroles uit, zodat alles draait zoals het hoort.\\n *  Zet je **meetcampagnes** op, stel je meetapparatuur in en trek je conclusies op basis van je data.\\n *  Stel je heldere rapporten op, werk je verbetervoorstellen uit en presenteer je die professioneel aan klanten.\\n *  Werk je nauw samen met engineering, service en sales, maar ga je ook geregeld solo op pad.\\n *  **Communiceer** je vlot en oplossingsgericht met klanten én collega’s.\\n\\n  \\n**Waar ga je werken?**  \\nJe komt terecht in een familiaal technisch bedrijf, actief in België en Nederland, waar eerlijkheid en wederzijds respect centraal staan. De sfeer is ontspannen, de structuur vlak en de werkplekken zijn proper en goed uitgerust. Je deelt je bureau met een andere field fngineer, maar je werk speelt zich vooral af bij klanten. Vrijheid, verantwoordelijkheid en vertrouwen? Check, check en check.\",\"hiringOrganization\":{\"name\":\"vind! Gent\",\"logo\":\"https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3899/mobileLogo.png\",\"sameAs\":\"http://www.vindeenjob.be/\",\"@type\":\"Organization\"},\"jobLocation\":[{\"address\":{\"addressCountry\":\"BE\",\"addressLocality\":\"MALDEGEM\",\"postalCode\":\"9990\",\"@type\":\"PostalAddress\"},\"@type\":\"Place\"}],\"employmentType\":[\"FULL_TIME\"],\"datePosted\":\"2025-08-14T09:16:21Z\",\"baseSalary\":{\"currency\":\"EUR\",\"value\":{\"minValue\":3300.0,\"maxValue\":6000.0,\"unitText\":\"MONTH\",\"@type\":\"QuantitativeValue\"},\"@type\":\"MonetaryAmount\"},\"@context\":\"https://schema.org/\",\"@type\":\"JobPosting\"}": 2,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 18,
            "n": 1878,
            "p_distinct": 0.9994623655913979,
            "p_missing": 0.009584664536741214,
            "n_distinct": 1859,
            "description": "Based on the profiling data, the 'jobPosting' column contains structured JSON data that follows the Schema.org JobPosting format, used to represent detailed job listings. The column has very high cardinality with 99.95% distinct values (1,859 unique entries out of 1,878 total records) and a low missing rate of about 0.96% (18 missing values). The data includes standardized job posting information such as job title, detailed description, hiring organization details (including name and logo URL), job location, employment type, posting date, and salary information (with minimum and maximum values in EUR). The example shown suggests the content is primarily in Dutch/Flemish, with structured fields that make the listings machine-readable and SEO-friendly."
        },
        {
            "column_name": "kaartTonen",
            "value_counts_without_nan": {
                "false": 1557,
                "true": 321
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The 'kaartTonen' column is a boolean field present in all 1,878 records (no missing values) that appears to indicate whether a map should be displayed (\"tonen\" means \"to show\" in Dutch). The column contains only two distinct values: \"false\" (1,557 occurrences) and \"true\" (321 occurrences), with false being the predominant value representing about 83% of the entries. This suggests that map display is disabled for the majority of the records in the dataset."
        },
        {
            "column_name": "referentie > id",
            "min": 59112381,
            "value_counts_without_nan": {
                "71350819": 1,
                "71805376": 1,
                "71704833": 1,
                "71760320": 1,
                "71590684": 1,
                "71499007": 1,
                "71423177": 1,
                "71719550": 1,
                "71742926": 1,
                "69084430": 1,
                "more ...": -1
            },
            "type": "Numeric",
            "n_missing": 0,
            "n": 1878,
            "max": 71848727,
            "p_distinct": 1.0,
            "std": 816060.9999334216,
            "p_missing": 0.0,
            "n_distinct": 1878,
            "mean": 71413215.10223642,
            "description": "The 'referentie > id' column contains unique numeric identifiers, with all 1,878 records having distinct values (100% distinct rate). The IDs range from 59,112,381 to 71,848,727, with an average value of approximately 71,413,215. There are no missing values in this column, and it shows a standard deviation of about 816,061, indicating moderate spread in the ID values. Based on these characteristics, this appears to be a primary key or unique identifier column used to distinctly identify each record in the dataset."
        },
        {
            "column_name": "referentie > uuid",
            "value_counts_without_nan": {
                "e398a808-9972-49aa-b220-2828f52d324c": 1,
                "71c206d0-f81d-461e-b743-25f7ae285695": 1,
                "b992f53d-a468-4d3e-9620-64d57bedeef6": 1,
                "185dba1e-8f3d-47e3-be73-e54a9312fafd": 1,
                "32e5146a-9e60-4a58-8a8b-e68ba67bc61d": 1,
                "ad270801-cc01-43d2-ae45-132b7b76ec3e": 1,
                "4cbe698a-44ef-4878-b78e-d8806022af02": 1,
                "ff96faf0-ad88-457a-a6eb-543f249621be": 1,
                "22d5a441-50c7-4683-9095-189cb3fec69b": 1,
                "0e11e466-e685-4cc1-abb7-ec0253d5c311": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 1.0,
            "p_missing": 0.0,
            "n_distinct": 1878,
            "description": "The 'referentie > uuid' column contains unique identifier strings in UUID (Universally Unique Identifier) format, consisting of 32 hexadecimal digits grouped into five sections separated by hyphens. The column has 1,878 entries with no missing values, and every single entry is unique (100% distinct values), making it an ideal primary key or unique identifier field. The UUIDs follow a consistent format as shown in examples like \"e398a808-9972-49aa-b220-2828f52d324c\", and each record in the dataset has its own unique UUID."
        },
        {
            "column_name": "functie > naam",
            "value_counts_without_nan": {
                "IT Support Engineer": 33,
                "System Engineer": 19,
                "Software Engineer": 14,
                "Data Engineer": 14,
                "Demand Planner": 12,
                "Data Analyst": 9,
                "Senior Python Developer": 9,
                "Process Engineer": 9,
                "Network Engineer": 9,
                "IT Azure Cloud Engineer": 7,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.7358892438764644,
            "p_missing": 0.0,
            "n_distinct": 1382,
            "description": "The 'functie > naam' column appears to be a text field containing job titles or position names, with 1,878 total entries and no missing values. It shows high diversity in job titles with 1,382 unique values (73.6% distinct). The most common job titles are technology-focused, with \"IT Support Engineer\" being the most frequent (33 occurrences), followed by \"System Engineer\" (19 occurrences), and both \"Software Engineer\" and \"Data Engineer\" (14 occurrences each). The column appears to predominantly contain technical and professional roles, with a particular emphasis on IT, engineering, and data-related positions."
        },
        {
            "column_name": "functie > omschrijving > html",
            "value_counts_without_nan": {
                "<p><strong data-start=\"726\" data-end=\"780\">Jouw rol als Linux System Engineer</strong></p> \n<p>Afhankelijk van je ervaring werk je aan projecten in o.a. healthcare, finance, overheid en energie. Denk aan:</p> \n<ul> \n<li>Beheer en optimalisatie van Linux-servers (Debian, Ubuntu, RHEL, AlmaLinux).</li> \n<li>Automatisatie van provisioning &amp; configuratie via Bash, Python, Ansible of Puppet.</li> \n<li>Opzetten en beheren van CI/CD pipelines en containerized workflows (Docker, Podman).</li> \n<li>Meewerken aan cloud- en hybrid cloudomgevingen (AWS, Azure, GCP).</li> \n<li>Uitvoeren van systeemupgrades, patchmanagement en hardening.</li> \n<li>Troubleshooting en performance tuning met tools zoals journalctl, htop, iostat, netdata.</li> \n<li>Versiebeheer en documentatie in Git, Wiki of Markdown.</li> \n<li>Advies geven over systeeminrichting, beveiliging en schaalbaarheid.</li> </ul>": 10,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.9185303514376997,
            "p_missing": 0.0,
            "n_distinct": 1725,
            "description": "Based on the profiling data, the 'functie > omschrijving > html' column is a text field that contains HTML-formatted job descriptions. The column has 1,878 total entries with no missing values, and features a high degree of uniqueness with 1,725 distinct values (91.85% distinct). The data appears to be structured HTML content, typically containing job role descriptions, responsibilities, and requirements. The example shown in the value counts suggests the content includes formatted elements like paragraphs (<p>), strong text (<strong>), and unordered lists (<ul>), with detailed job-related information. The HTML formatting indicates this column is likely used for web display purposes of job postings."
        },
        {
            "column_name": "functie > omschrijving > plainText",
            "value_counts_without_nan": {
                "Jouw rol als Linux System Engineer Afhankelijk van je ervaring werk je aan projecten in o.a. healthcare, finance, overheid en energie. Denk aan: Beheer en optimalisatie van Linux-servers (Debian, Ubuntu, RHEL, AlmaLinux). Automatisatie van provisioning & configuratie via Bash, Python, Ansible of Puppet. Opzetten en beheren van CI/CD pipelines en containerized workflows (Docker, Podman). Meewerken aan cloud- en hybrid cloudomgevingen (AWS, Azure, GCP). Uitvoeren van systeemupgrades, patchmanagement en hardening. Troubleshooting en performance tuning met tools zoals journalctl, htop, iostat, netdata. Versiebeheer en documentatie in Git, Wiki of Markdown. Advies geven over systeeminrichting, beveiliging en schaalbaarheid.": 10,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.8977635782747604,
            "p_missing": 0.0,
            "n_distinct": 1686,
            "description": "The column 'functie > omschrijving > plainText' contains job descriptions in plain text format. It is a complete dataset with no missing values across 1,878 entries, and features a high degree of uniqueness with approximately 89.8% of entries being distinct (1,686 unique descriptions). The content appears to be detailed job role descriptions in Dutch, as exemplified by the most common entry which describes a Linux System Engineer position, detailing responsibilities such as server management, automation, and cloud infrastructure work. The high distinctiveness ratio suggests that most job descriptions are uniquely written rather than using standardized templates, indicating detailed and specific job postings."
        },
        {
            "column_name": "functie > omschrijving > markdown",
            "value_counts_without_nan": {
                "**Jouw rol als Linux System Engineer**\n\nAfhankelijk van je ervaring werk je aan projecten in o.a. healthcare, finance, overheid en energie. Denk aan:\n\n *  Beheer en optimalisatie van Linux-servers (Debian, Ubuntu, RHEL, AlmaLinux).\n *  Automatisatie van provisioning & configuratie via Bash, Python, Ansible of Puppet.\n *  Opzetten en beheren van CI/CD pipelines en containerized workflows (Docker, Podman).\n *  Meewerken aan cloud- en hybrid cloudomgevingen (AWS, Azure, GCP).\n *  Uitvoeren van systeemupgrades, patchmanagement en hardening.\n *  Troubleshooting en performance tuning met tools zoals journalctl, htop, iostat, netdata.\n *  Versiebeheer en documentatie in Git, Wiki of Markdown.\n *  Advies geven over systeeminrichting, beveiliging en schaalbaarheid.": 10,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.9094781682641108,
            "p_missing": 0.0,
            "n_distinct": 1708,
            "description": "Based on the profiling data, the 'functie > omschrijving > markdown' column contains job descriptions formatted in Markdown syntax. The column has 1,878 total entries with no missing values, and features a high degree of uniqueness with 1,708 distinct values (about 91% of entries are unique). The example shown in the value counts suggests this column typically contains detailed job role descriptions with formatted text including bullet points, section headers in bold, and structured lists of responsibilities. The content appears to be technical in nature, written in Dutch, and follows a consistent markdown formatting pattern to describe job requirements, responsibilities, and technical skills needed for positions."
        },
        {
            "column_name": "functie > arbeidscircuit > code",
            "value_counts_without_nan": {
                "G": 1463,
                "IV": 204,
                "Z": 67,
                "CONTRACTONB": 53,
                "T": 30,
                "TV": 27,
                "I": 21,
                "FL": 4,
                "V": 3,
                "VU": 3,
                "Q": 1,
                "GB": 1,
                "GC": 1
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.006922257720979766,
            "p_missing": 0.0,
            "n_distinct": 13,
            "description": "The column 'functie > arbeidscircuit > code' is a categorical field containing employment circuit codes with 1,878 total entries and no missing values. It consists of 13 unique codes, with 'G' being the most dominant code appearing 1,463 times (about 78% of entries), followed by 'IV' with 204 occurrences and 'Z' with 67 occurrences. The column appears to use a standardized coding system for classifying different types of employment circuits or work arrangements, with some codes like 'FL', 'V', 'VU', 'Q', 'GB', and 'GC' being rarely used (4 or fewer occurrences each). The complete data coverage (0% missing values) suggests this is a mandatory field in the dataset."
        },
        {
            "column_name": "functie > arbeidscircuit > label",
            "value_counts_without_nan": {
                "Gewoon contract.": 1463,
                "Interim met optie 'vast werk'": 204,
                "Zelfstandige activiteit": 67,
                "Contractueel onbepaalde duur": 53,
                "Tijdelijke job.": 30,
                "Tijdelijke job (met optie vast)": 27,
                "Interimcontract.": 21,
                "Een flexijob is een bijverdienste en staat open voor iedereen die, reeds 3 kwartalen geleden, minstens 4/5 bij een andere werkgever, uit een andere sector, in vast dienstverband werkt.": 4,
                "Studentenjob.": 3,
                "Vaste job bij het uitzendkantoor": 3,
                "Vervangingscontract brugpensioen - Voorwaarden: uitkeringsgerechtigd werkloos of schoolverlater in wachttijd zijn.": 1,
                "Beperkte tewerkstelling <13 uren/week": 1,
                "Gewoon contract (dienstencheques)": 1
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.006922257720979766,
            "p_missing": 0.0,
            "n_distinct": 13,
            "description": "Based on the profiling data, the 'functie > arbeidscircuit > label' column is a categorical field that describes the type of employment contract or work arrangement for job positions. The column has no missing values across 1,878 records and contains 13 distinct categories. The most common employment type is \"Gewoon contract.\" (regular contract) which appears in 1,463 entries, followed by \"Interim met optie 'vast werk'\" (temporary work with option for permanent position) with 204 entries. The column covers various employment arrangements including permanent contracts, temporary positions, self-employment, student jobs, and specialized arrangements like \"flexijobs.\" Each entry clearly indicates the contractual nature of the position being offered, making it an important classification field for job listings."
        },
        {
            "column_name": "functie > arbeidscircuit > kortLabel",
            "value_counts_without_nan": {
                "Vaste Job": 1463,
                "Interim met optie \"vast werk\"": 204,
                "Zelfstandige activiteit": 67,
                "Contractueel onbepaalde duur": 53,
                "Tijdelijke job (niet via uitzendkantoren)": 30,
                "Tijdelijke job (met optie vast)": 27,
                "Interim Job (uitsluitend voor uitzendkantoren)": 21,
                "Flexijob": 4,
                "Studentenjob": 3,
                "Vaste job bij het uitzendkantoor": 3,
                "Vervanging brugpensioen": 1,
                "Beperkte tewerkstelling <13 uren/week": 1,
                "Dienstenchequebaan": 1
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.006922257720979766,
            "p_missing": 0.0,
            "n_distinct": 13,
            "description": "The column 'functie > arbeidscircuit > kortLabel' contains categorical data representing different types of employment arrangements or job circuits in the Belgian labor market. Out of 1,878 total entries, there are 13 distinct categories with no missing values. The most prevalent category is \"Vaste Job\" (permanent job) with 1,463 entries, followed by \"Interim met optie 'vast werk'\" (temporary work with option for permanent position) with 204 entries, and \"Zelfstandige activiteit\" (self-employed activity) with 67 entries. Less common categories include specialized arrangements like \"Flexijob\" (4 entries), \"Studentenjob\" (3 entries), and \"Dienstenchequebaan\" (service voucher job) with just 1 entry, reflecting the diverse but structured nature of employment types in the dataset."
        },
        {
            "column_name": "functie > arbeidscircuitLijn",
            "value_counts_without_nan": {
                "Vaste Job": 1463,
                "Interim met optie \"vast werk\"": 204,
                "Zelfstandige activiteit": 67,
                "Contractueel onbepaalde duur": 53,
                "Tijdelijke job (niet via uitzendkantoren)": 30,
                "Tijdelijke job (met optie vast)": 27,
                "Interim Job (uitsluitend voor uitzendkantoren)": 21,
                "Flexijob": 4,
                "Studentenjob": 3,
                "Vaste job bij het uitzendkantoor": 3,
                "Vervanging brugpensioen": 1,
                "Beperkte tewerkstelling <13 uren/week": 1,
                "Dienstenchequebaan": 1
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.006922257720979766,
            "p_missing": 0.0,
            "n_distinct": 13,
            "description": "The column 'functie > arbeidscircuitLijn' represents the type of employment arrangement or job circuit for each position, containing 1,878 entries with no missing values. It is a categorical column with 13 distinct categories, where \"Vaste Job\" (permanent position) is overwhelmingly the most common type, accounting for 1,463 entries, followed by \"Interim met optie 'vast werk'\" (temporary with option for permanent work) with 204 entries. The remaining categories cover various employment types including self-employment, fixed-term contracts, temporary positions, flexi-jobs, student jobs, and service voucher jobs, each representing smaller portions of the dataset. The column provides a clear classification of the employment type for each job posting, with permanent positions dominating the distribution at roughly 78% of all entries."
        },
        {
            "column_name": "opmaak > logo > url",
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3769/mobileLogo.jpg": 218,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/4151/mobileLogo.png": 167,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/2970/mobileLogo.png": 108,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3258/mobileLogo.jpg": 94,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3446/mobileLogo.png": 69,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/2969/mobileLogo.png": 67,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/4534/mobileLogo.png": 66,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/4618/mobileLogo.jpg": 64,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/1584/mobileLogo.jpg": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/3860/mobileLogo.jpg": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 498,
            "n": 1878,
            "p_distinct": 0.07753623188405798,
            "p_missing": 0.26517571884984026,
            "n_distinct": 107,
            "description": "The column 'opmaak > logo > url' contains URLs pointing to company logos hosted on VDAB's CDN (Content Delivery Network). Out of 1,878 total entries, approximately 26.5% (498) are missing values. The column contains 107 unique URLs (7.8% distinct values), suggesting that multiple job listings share the same company logos. The URLs follow a consistent pattern, pointing to either JPG or PNG image files stored in a 'mobileLogo' directory structure on AWS. The most frequently occurring logo URL appears 218 times, with the top 10 most common logos being used across multiple job listings. All URLs are structured as 'https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/bedrijven/{company_id}/mobileLogo.{extension}'."
        },
        {
            "column_name": "opmaak > logo > altText",
            "value_counts_without_nan": {
                "Logo Jobat": 218,
                "Logo Editx": 167,
                "Logo LGA IT": 108,
                "Logo ictjob": 94,
                "Logo Lagom Engineering": 69,
                "Logo LGA Engineering": 67,
                "Logo Kwery": 66,
                "Logo Spark HR": 64,
                "Logo Unique": 35,
                "Logo Cronos": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 498,
            "n": 1878,
            "p_distinct": 0.07753623188405798,
            "p_missing": 0.26517571884984026,
            "n_distinct": 107,
            "description": "The column 'opmaak > logo > altText' contains alternative text descriptions for company logos in job postings. Out of 1,878 total entries, approximately 27% (498) are missing values. The column contains 107 unique text values, with \"Logo Jobat\" being the most frequent (218 occurrences), followed by \"Logo Editx\" (167) and \"Logo LGA IT\" (108). The data appears to follow a consistent naming pattern of \"Logo\" followed by the company or platform name. This suggests the column is primarily used for accessibility purposes, providing text descriptions of company logos that appear in job listings, with a relatively concentrated distribution among a few major job posting platforms or companies."
        },
        {
            "column_name": "opmaak > h1TekstKleur",
            "value_counts_without_nan": {
                "#2f3535": 218,
                "#003187": 167,
                "#000000": 166,
                "#484848": 108,
                "#d27143": 69,
                "#eb980b": 67,
                "#0f282f": 66,
                "#322249": 64,
                "#0095db": 35,
                "#005699": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.06367583212735166,
            "p_missing": 0.2641107561235357,
            "n_distinct": 88,
            "description": "The column 'opmaak > h1TekstKleur' appears to contain hexadecimal color codes used for H1 (heading 1) text styling in the dataset. Out of 1,878 total entries, approximately 26.4% (496) of the values are missing. The column contains 88 unique color codes, with the most common being \"#2f3535\" (218 occurrences), \"#003187\" (167 occurrences), and \"#000000\" (black, 166 occurrences). The relatively low number of distinct values (6.4% of all entries are unique) suggests this is likely a controlled set of brand or design system colors rather than arbitrary color choices."
        },
        {
            "column_name": "opmaak > h2TekstKleur",
            "value_counts_without_nan": {
                "#2f3535": 218,
                "#000000": 183,
                "#003187": 167,
                "#2ec4b6": 108,
                "#d27143": 69,
                "#ef980c": 67,
                "#0f282f": 66,
                "#322249": 64,
                "#0095db": 35,
                "#005699": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.06150506512301013,
            "p_missing": 0.2641107561235357,
            "n_distinct": 85,
            "description": "The column 'opmaak > h2TekstKleur' appears to contain hex color codes used for h2 (heading level 2) text styling in the dataset. Out of 1,878 total entries, approximately 26.4% (496) of the values are missing. The column contains 85 unique color codes, with the most common being \"#2f3535\" (218 occurrences), \"#000000\" (black, 183 occurrences), and \"#003187\" (167 occurrences). The relatively low number of distinct values (85) compared to the total entries suggests this is likely a controlled set of brand or design system colors used across multiple job postings or listings."
        },
        {
            "column_name": "opmaak > h3TekstKleur",
            "value_counts_without_nan": {
                "#b7dbe7": 218,
                "#2f80ed": 167,
                "#2ec4b6": 108,
                "#f36d24": 94,
                "#000000": 92,
                "#d27143": 69,
                "#ef980c": 67,
                "#0f282f": 66,
                "#322249": 64,
                "#4c1a6b": 35,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.06367583212735166,
            "p_missing": 0.2641107561235357,
            "n_distinct": 88,
            "description": "The column 'opmaak > h3TekstKleur' appears to contain hex color codes used for h3 (heading level 3) text styling in the dataset. Out of 1,878 total entries, approximately 26.4% (496) of the values are missing. The column contains 88 unique color values, with the most common being \"#b7dbe7\" (218 occurrences), \"#2f80ed\" (167 occurrences), and \"#2ec4b6\" (108 occurrences). The data is stored as text values, and the relatively low proportion of distinct values (about 6.4%) suggests that there are standardized color schemes being used across multiple entries, with certain colors being heavily favored over others."
        },
        {
            "column_name": "opmaak > linksTekstKleur",
            "value_counts_without_nan": {
                "#000000": 572,
                "#b7dbe7": 218,
                "#10a2be": 94,
                "#ef980c": 67,
                "#0f282f": 66,
                "#4c1a6b": 35,
                "#616882": 29,
                "#ea5a40": 21,
                "#8aa0c9": 20,
                "#c56505": 20,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.04848046309696093,
            "p_missing": 0.2641107561235357,
            "n_distinct": 67,
            "description": "The column 'opmaak > linksTekstKleur' appears to store text color values for links in hexadecimal format (e.g., #000000). From the 1,878 total entries, about 26.4% (496) are missing values. The column contains 67 unique color codes, with black (#000000) being the most common color used in 572 cases, followed by a light blue shade (#b7dbe7) in 218 cases and a turquoise color (#10a2be) in 94 cases. The relatively low distinct value percentage (approximately 4.8%) suggests that most organizations stick to a limited set of standard colors for their link text, with black being the predominant choice."
        },
        {
            "column_name": "opmaak > bovenBalkTekstKleur",
            "value_counts_without_nan": {
                "#ffffff": 678,
                "#b7dbe7": 218,
                "#000000": 135,
                "#484848": 108,
                "#d27143": 69,
                "#0f282f": 66,
                "#9f9fc5": 64,
                "#004992": 19,
                "#f6f6f6": 14,
                "#672146": 5,
                "#eafafc": 3,
                "#463a2e": 2,
                "#001f5b": 1
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.009406657018813314,
            "p_missing": 0.2641107561235357,
            "n_distinct": 13,
            "description": "The column 'opmaak > bovenBalkTekstKleur' contains hexadecimal color codes that appear to specify text colors for an upper bar element in the interface. Out of 1,878 total entries, approximately 26.4% (496) are missing values. The column has 13 unique color codes, with white (#ffffff) being the most common (678 occurrences), followed by light blue (#b7dbe7, 218 occurrences) and black (#000000, 135 occurrences). The data is categorical in nature, with a relatively low distinct value proportion of about 0.94%, indicating that the same color codes are frequently reused across different entries."
        },
        {
            "column_name": "opmaak > bovenBalkAchtergrondKleur",
            "value_counts_without_nan": {
                "#2f3535": 218,
                "#2f80ed": 167,
                "#2ec4b6": 108,
                "#ffffff": 100,
                "#f36d24": 94,
                "#ef980c": 67,
                "#fff17c": 66,
                "#a61f69": 64,
                "#000000": 39,
                "#0095db": 35,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.06657018813314038,
            "p_missing": 0.2641107561235357,
            "n_distinct": 92,
            "description": "The column 'opmaak > bovenBalkAchtergrondKleur' appears to contain hexadecimal color codes that specify background colors for a top bar element in the interface. Out of 1,878 total entries, approximately 26.4% (496) are missing values. The column contains 92 unique color codes, with '#2f3535' (a dark gray) being the most common (218 occurrences), followed by '#2f80ed' (a blue tone, 167 occurrences) and '#2ec4b6' (a teal color, 108 occurrences). The data suggests this is a styling parameter used to customize the visual appearance of job postings or related interfaces, with a preference for professional colors ranging from neutral grays to blues and teals."
        },
        {
            "column_name": "opmaak > onderBalkAchtergrondKleur",
            "value_counts_without_nan": {
                "#ffffff": 272,
                "#2f3535": 218,
                "#2f80ed": 167,
                "#2ec4b6": 108,
                "#f36d24": 94,
                "#ef980c": 67,
                "#0095db": 35,
                "#616882": 29,
                "#000000": 23,
                "#003b5c": 22,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.060057887120115776,
            "p_missing": 0.2641107561235357,
            "n_distinct": 83,
            "description": "The column 'opmaak > onderBalkAchtergrondKleur' appears to contain hexadecimal color codes used for styling the background color of a bottom bar element in the interface. Out of 1,878 total entries, approximately 26.4% (496) are missing values. The column contains 83 unique color codes, with '#ffffff' (white) being the most common (272 occurrences), followed by '#2f3535' (a dark gray) with 218 occurrences, and '#2f80ed' (a blue shade) with 167 occurrences. The relatively low distinct value proportion (about 6%) suggests that there's a standardized set of colors being used across the dataset, with a few dominant color choices."
        },
        {
            "column_name": "opmaak > extraInformatieTekstKleur",
            "value_counts_without_nan": {
                "#000000": 744,
                "#2f3535": 218,
                "#484848": 108,
                "#d27143": 69,
                "#0f282f": 66,
                "#9f9fc5": 64,
                "#004992": 19,
                "#29d3df": 18,
                "#24402e": 12,
                "#ffffff": 11,
                "#00456e": 9,
                "#31363b": 5,
                "#4a4d4d": 5,
                "#113e5b": 5,
                "#d81a23": 4,
                "#6f1425": 3,
                "#333333": 3,
                "#0e1c39": 3,
                "#383639": 3,
                "#af9800": 2,
                "#572932": 2,
                "#00225f": 2,
                "#2bacde": 1,
                "#001f5b": 1,
                "#0c2d83": 1,
                "#3a4d89": 1,
                "#333f48": 1,
                "#002439": 1,
                "#97000c": 1
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.020984081041968163,
            "p_missing": 0.2641107561235357,
            "n_distinct": 29,
            "description": "The column 'opmaak > extraInformatieTekstKleur' contains hexadecimal color codes that specify the text color for extra information sections in job postings. Out of 1,878 total entries, 26.4% (496) are missing values, while the remaining entries are distributed across 29 unique color codes. The most commonly used color is black (#000000) appearing in 744 cases, followed by a dark gray (#2f3535) with 218 occurrences and a medium gray (#484848) with 108 occurrences. The data suggests a preference for neutral and professional colors, with some occasional usage of blues, reds, and other accent colors, though these appear much less frequently in the dataset."
        },
        {
            "column_name": "opmaak > extraInformatieAchtergrondKleur",
            "value_counts_without_nan": {
                "#ffffff": 775,
                "#f0efef": 219,
                "#f6f6f6": 85,
                "#ef980c": 67,
                "#fff17c": 66,
                "#eeeeee": 38,
                "#e7e3e2": 29,
                "#d9f4fd": 22,
                "#ea5a40": 21,
                "#f3f3f4": 18,
                "#f2f2f2": 11,
                "#f3f3f3": 7,
                "#009bdb": 6,
                "#fc4c02": 4,
                "#f4f3f2": 4,
                "#cccccc": 2,
                "#ffed00": 2,
                "#e30512": 1,
                "#667b69": 1,
                "#00ca88": 1,
                "#7c2855": 1,
                "#ffd923": 1,
                "#e30613": 1
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.016642547033285094,
            "p_missing": 0.2641107561235357,
            "n_distinct": 23,
            "description": "The column 'opmaak > extraInformatieAchtergrondKleur' contains hexadecimal color codes that specify background colors for extra information sections in job postings. Out of 1,878 total entries, approximately 26.4% (496) are missing values. The column has 23 unique color codes, with white (#ffffff) being the most common, appearing in 775 entries, followed by light gray (#f0efef) with 219 occurrences and a slightly darker gray (#f6f6f6) with 85 occurrences. The data suggests a strong preference for neutral, light background colors, though there are also instances of more vibrant colors like orange (#ef980c), yellow (#fff17c), and blue (#009bdb) being used less frequently."
        },
        {
            "column_name": "opmaak > bedrijfsInfoKnopTekstKleur",
            "value_counts_without_nan": {
                "#ffffff": 687,
                "#2f3535": 218,
                "#000000": 203,
                "#484848": 108,
                "#0f282f": 66,
                "#9f9fc5": 64,
                "#004992": 19,
                "#672146": 5,
                "#293133": 5,
                "#01212d": 3,
                "#463a2e": 2,
                "#3a4d89": 1,
                "#ffd923": 1
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.009406657018813314,
            "p_missing": 0.2641107561235357,
            "n_distinct": 13,
            "description": "The column 'opmaak > bedrijfsInfoKnopTekstKleur' contains hexadecimal color codes that specify the text color for company information buttons. Out of 1,878 total entries, 496 (26.4%) are missing values. The column has 13 unique color codes, with white (#ffffff) being the most common choice appearing 687 times, followed by dark gray (#2f3535) with 218 occurrences and black (#000000) with 203 occurrences. The data suggests a preference for neutral colors, with various shades of gray, black, and blue being common choices, though there are a few instances of more distinctive colors like yellow (#ffd923) and burgundy (#672146) appearing rarely."
        },
        {
            "column_name": "opmaak > bedrijfsInfoKnopAchtergrondKleur",
            "value_counts_without_nan": {
                "#b7dbe7": 218,
                "#2f80ed": 167,
                "#2ec4b6": 108,
                "#10a2be": 94,
                "#ffffff": 90,
                "#ef980c": 67,
                "#fff17c": 66,
                "#a61f69": 64,
                "#000000": 36,
                "#4c1a6b": 35,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.06801736613603473,
            "p_missing": 0.2641107561235357,
            "n_distinct": 94,
            "description": "The column 'opmaak > bedrijfsInfoKnopAchtergrondKleur' appears to store background color values for company information buttons, primarily using hexadecimal color codes. Out of 1,878 total entries, 496 (26.4%) are missing values, and there are 94 distinct color codes used across the dataset. The most common colors are #b7dbe7 (light blue, 218 occurrences), #2f80ed (blue, 167 occurrences), and #2ec4b6 (turquoise, 108 occurrences). The data suggests this is a styling parameter used to customize the appearance of company information buttons on what appears to be a job posting or company profile interface."
        },
        {
            "column_name": "opmaak > sollicitatieKnopTekstKleur",
            "value_counts_without_nan": {
                "#ffffff": 689,
                "#2f3535": 218,
                "#000000": 134,
                "#484848": 108,
                "#d27143": 69,
                "#0f282f": 66,
                "#9f9fc5": 64,
                "#004992": 19,
                "#672146": 5,
                "#01212d": 3,
                "#ff6e08": 2,
                "#463a2e": 2,
                "#ffd923": 1,
                "#012169": 1,
                "#3a4d89": 1
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.01085383502170767,
            "p_missing": 0.2641107561235357,
            "n_distinct": 15,
            "description": "The column 'opmaak > sollicitatieKnopTekstKleur' appears to store hexadecimal color codes that define the text color of application/apply buttons on job postings. From the 1,878 total entries, approximately 26.4% (496) are missing values. Among the non-missing values, there are 15 distinct colors used, with white (#ffffff) being the most common (689 instances), followed by dark gray (#2f3535) with 218 instances, and black (#000000) with 134 instances. The color palette appears to primarily consist of neutral tones with some occasional accent colors like orange (#ff6e08) and yellow (#ffd923), though these are used very infrequently."
        },
        {
            "column_name": "opmaak > sollicitatieKnopAchtergrondKleur",
            "value_counts_without_nan": {
                "#b7dbe7": 218,
                "#2f80ed": 167,
                "#2ec4b6": 108,
                "#000000": 101,
                "#10a2be": 94,
                "#ef980c": 67,
                "#fff17c": 66,
                "#a61f69": 64,
                "#0095db": 35,
                "#616882": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.07018813314037627,
            "p_missing": 0.2641107561235357,
            "n_distinct": 97,
            "description": "The column 'opmaak > sollicitatieKnopAchtergrondKleur' appears to store hexadecimal color codes that define the background color of application/apply buttons in job postings. Out of 1,878 total entries, approximately 26.4% (496) are missing values, while the remaining entries contain 97 unique color codes. The most commonly used colors are shades of blue (#b7dbe7, #2f80ed, #10a2be) and teal (#2ec4b6), with #b7dbe7 (a light blue) being the most frequent choice appearing 218 times. Other notable colors include black (#000000), orange (#ef980c), yellow (#fff17c), and purple (#a61f69), suggesting a diverse but controlled palette for application button styling across the job postings."
        },
        {
            "column_name": "opmaak > hoofdingAchtergrondKleur",
            "value_counts_without_nan": {
                "#ffffff": 1265,
                "#dbdbde": 108,
                "#ff7070": 5,
                "#ff4b00": 2,
                "#e30512": 1,
                "#667b69": 1
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.004341534008683068,
            "p_missing": 0.2641107561235357,
            "n_distinct": 6,
            "description": "The column 'opmaak > hoofdingAchtergrondKleur' contains hexadecimal color codes for background header colors, with 1,878 total entries of which 26.4% are missing values. The data is categorical with only 6 unique color codes, dominated by white (#ffffff) which appears 1,265 times, followed by a light gray (#dbdbde) with 108 occurrences. The remaining colors (various shades of red and one green) appear very infrequently, with just 1-5 occurrences each. This suggests that most entries use a conservative white or gray header background, with colored backgrounds being rare exceptions."
        },
        {
            "column_name": "opmaak > hoofdingAfbeelding > url",
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3770/header.jpg": 218,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4150/header.png": 167,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2973/header.png": 108,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3259/header.png": 94,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3447/header.jpg": 69,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2972/header.png": 67,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4533/header.png": 66,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4619/header.jpg": 64,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/1583/header.jpg": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3861/header.jpg": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.07742402315484805,
            "p_missing": 0.2641107561235357,
            "n_distinct": 107,
            "description": "The column 'opmaak > hoofdingAfbeelding > url' contains URLs pointing to header images hosted on VDAB's CDN (Content Delivery Network) for job postings. Out of 1,878 total entries, 496 (26.4%) are missing values, and there are 107 unique URLs (7.7% distinct values). The URLs follow a consistent pattern, pointing to either .jpg or .png header images stored in numbered template directories. The most frequently used header image appears 218 times, with the top three templates (3770, 4150, and 2973) accounting for a significant portion of the entries, suggesting some standardization in header image usage across job postings."
        },
        {
            "column_name": "opmaak > hoofdingAfbeelding > altText",
            "value_counts_without_nan": {
                "Hoofding afbeelding": 1382
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.000723589001447178,
            "p_missing": 0.2641107561235357,
            "n_distinct": 1,
            "description": "The column 'opmaak > hoofdingAfbeelding > altText' is a categorical field that contains alternative text descriptions for header images. In the dataset of 1,878 records, this column has only one unique value - \"Hoofding afbeelding\" - which appears in 1,382 entries. Notably, 496 entries (approximately 26.4% of the data) are missing values. The extremely low distinct proportion (0.07%) indicates this is essentially a single-value column when populated, suggesting it may be a default or standardized alternative text used across multiple records."
        },
        {
            "column_name": "opmaak > hoofdingAfbeeldingMobiel > url",
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3770/mobileLogo.jpg": 218,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4150/mobileLogo.png": 167,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2973/mobileLogo.png": 108,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3259/mobileLogo.jpg": 94,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3447/mobileLogo.png": 69,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2972/mobileLogo.png": 67,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4533/mobileLogo.png": 66,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4619/mobileLogo.jpg": 64,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/1583/mobileLogo.jpg": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3861/mobileLogo.jpg": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.07742402315484805,
            "p_missing": 0.2641107561235357,
            "n_distinct": 107,
            "description": "The column 'opmaak > hoofdingAfbeeldingMobiel > url' contains URLs pointing to mobile-optimized header images hosted on VDAB's CDN (Content Delivery Network). Out of 1,878 total entries, approximately 26.4% (496) are missing values, and there are 107 unique URLs (7.7% distinct values). The URLs follow a consistent pattern, pointing to either JPG or PNG images in a \"mobileLogo\" directory within the vacatures (vacancies) templates. The most frequently occurring URL appears 218 times, with the top 10 most common URLs ranging from 29 to 218 occurrences, suggesting that many job listings share common mobile header images."
        },
        {
            "column_name": "opmaak > hoofdingAfbeeldingMobiel > altText",
            "value_counts_without_nan": {
                "Mobiele hoofding afbeelding": 1382
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.000723589001447178,
            "p_missing": 0.2641107561235357,
            "n_distinct": 1,
            "description": "The column 'opmaak > hoofdingAfbeeldingMobiel > altText' is a categorical field that contains alternative text descriptions for mobile header images. In the dataset of 1,878 records, there is only one unique value (\"Mobiele hoofding afbeelding\") which appears 1,382 times, while 496 records (26.4%) have missing values. The extremely low distinct proportion (0.07%) indicates this is essentially a single-value field when populated, suggesting it might be a default or standardized alternative text used across mobile header images in the system."
        },
        {
            "column_name": "opmaak > signatuurAfbeelding > url",
            "value_counts_without_nan": {
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3770/signatuur.jpg": 218,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4150/signatuur.png": 167,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2973/signatuur.png": 108,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3259/signatuur.png": 94,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3447/signatuur.png": 69,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/2972/signatuur.png": 67,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4533/signatuur.png": 66,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/4619/signatuur.jpg": 64,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/1583/signatuur.jpg": 35,
                "https://cdn.app-prd-cdn.aws.vdab-prd.be/vindeenjob/templates/vacatures/3861/signatuur.jpg": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.07742402315484805,
            "p_missing": 0.2641107561235357,
            "n_distinct": 107,
            "description": "The column 'opmaak > signatuurAfbeelding > url' contains URLs pointing to signature images hosted on VDAB's CDN (Content Delivery Network). Out of 1,878 total entries, approximately 26.4% (496) are missing values, while the remaining entries contain 107 unique URLs (7.7% distinct values). The URLs follow a consistent pattern, pointing to either JPG or PNG signature images stored in different template directories on the CDN. The most frequently occurring signature image URL appears 218 times, with several other commonly used signatures appearing between 64-167 times, suggesting that certain signature templates are regularly reused across multiple entries."
        },
        {
            "column_name": "opmaak > signatuurAfbeelding > altText",
            "value_counts_without_nan": {
                "Signatuur afbeelding bedrijf": 1382
            },
            "type": "Categorical",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.000723589001447178,
            "p_missing": 0.2641107561235357,
            "n_distinct": 1,
            "description": "The column 'opmaak > signatuurAfbeelding > altText' is a categorical field that contains alternative text descriptions for signature images, presumably used for company branding or identification purposes. The column has 1,878 total entries, with 496 missing values (26.4% of the data). There is only one unique value in this column - \"Signatuur afbeelding bedrijf\" (which appears 1,382 times) - suggesting this is a standardized alt text description used consistently across all non-null entries in the dataset."
        },
        {
            "column_name": "opmaak > signatuurBedrijfsUrl",
            "value_counts_without_nan": {
                "http://www.jobat.be/nl/": 218,
                "https://editx.eu/nl/it-jobs": 167,
                "https://it.lga.jobs/": 108,
                "https://www.ictjob.be/nl/": 94,
                "https://www.lagom.jobs/nl": 69,
                "http://www.engineering.lga.jobs/": 67,
                "https://www.kwery.be/": 66,
                "http://www.sparkjobs.be/": 64,
                "https://www.unique.be/": 35,
                "https://cronos-groep.be/over-ons/": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 496,
            "n": 1878,
            "p_distinct": 0.07670043415340087,
            "p_missing": 0.2641107561235357,
            "n_distinct": 106,
            "description": "The column 'opmaak > signatuurBedrijfsUrl' contains website URLs associated with job postings or employer organizations. Out of 1,878 total entries, about 26.4% (496) are missing values. The column contains 106 unique URLs, with the most common being \"http://www.jobat.be/nl/\" (218 occurrences), followed by \"https://editx.eu/nl/it-jobs\" (167 occurrences), and \"https://it.lga.jobs/\" (108 occurrences). These appear to be primarily job board websites and company career pages, with many being focused on IT and engineering sectors in the Belgian market. The relatively low number of distinct values (7.67% of all entries are unique) suggests that these URLs represent a concentrated set of major job posting platforms and employer websites."
        },
        {
            "column_name": "opmaak > vacatureTemplateId",
            "min": 1559.0,
            "value_counts_without_nan": {
                "3770.0": 218,
                "4150.0": 167,
                "2973.0": 108,
                "3259.0": 94,
                "3447.0": 69,
                "2972.0": 67,
                "4533.0": 66,
                "4619.0": 64,
                "1583.0": 35,
                "3861.0": 29,
                "more ...": -1
            },
            "type": "Numeric",
            "n_missing": 496,
            "n": 1878,
            "max": 4975.0,
            "p_distinct": 0.07742402315484805,
            "std": 728.2118840133894,
            "p_missing": 0.2641107561235357,
            "n_distinct": 107,
            "mean": 3574.793053545586,
            "description": "The 'opmaak > vacatureTemplateId' column appears to be a numeric identifier for job posting templates, containing values ranging from 1,559 to 4,975. Out of 1,878 total entries, approximately 26.4% (496) are missing values, and there are 107 distinct template IDs used across the dataset. The most frequently used template ID is 3770 (appearing 218 times), followed by 4150 (167 times) and 2973 (108 times). The mean template ID is approximately 3,575 with a standard deviation of 728, suggesting a fairly wide spread of template usage. This column likely serves as a reference to different pre-defined layouts or formats used for job postings."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente",
            "value_counts_without_nan": {
                "ANTWERPEN": 297,
                "SINT-DENIJS-WESTREM": 201,
                "BRUSSEL": 181,
                "CHARLEROI": 167,
                "GENT": 93,
                "ZWIJNAARDE": 79,
                "HOOGLEDE": 58,
                "BRUGGE": 50,
                "KONTICH": 44,
                "HASSELT": 43,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.08413205537806177,
            "p_missing": 0.0,
            "n_distinct": 158,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente' contains municipality or city names in Belgium where suppliers/vendors are physically located. It has complete data with no missing values across all 1,878 records. The data shows a strong concentration in major Belgian cities, with Antwerp (297 entries), Sint-Denijs-Westrem (201 entries), Brussels (181 entries), and Charleroi (167 entries) being the most frequent locations. There are 158 unique municipalities in total, representing about 8.4% of all entries, which indicates that many suppliers are clustered in certain key urban areas. The column is stored as text data and appears to be consistently formatted with standardized Belgian municipality names."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer",
            "value_counts_without_nan": {
                "2": 399,
                "1146": 129,
                "17": 105,
                "70": 95,
                "74": 81,
                "91": 64,
                "311A": 57,
                "88": 55,
                "1": 37,
                "72": 30,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 5,
            "n": 1878,
            "p_distinct": 0.1003737319807795,
            "p_missing": 0.0026624068157614484,
            "n_distinct": 188,
            "description": "Based on the profiling data, 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer' is a text column that contains building or street numbers for physical locations of suppliers (leveranciers). The column has 1,878 total entries with only 5 missing values (0.27% missing rate). It contains 188 unique values (10% distinct values), suggesting that multiple suppliers share the same address numbers. The most common number is \"2\" appearing 399 times, followed by \"1146\" (129 times) and \"17\" (105 times). The presence of values like \"311A\" indicates that the column accepts both numeric and alphanumeric building numbers."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode",
            "value_counts_without_nan": {
                "9051": 265,
                "2050": 221,
                "1000": 181,
                "6000": 167,
                "9052": 79,
                "8830": 59,
                "8000": 47,
                "2550": 44,
                "8800": 43,
                "3500": 41,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.08892438764643237,
            "p_missing": 0.0,
            "n_distinct": 167,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode' contains postal codes for physical locations in Belgium. It has complete data with no missing values across all 1,878 records. The postal codes are stored as text values, with 167 unique codes representing approximately 8.9% of all entries. The most frequently occurring postal codes are 9051 (265 occurrences), 2050 (221 occurrences), and 1000 (181 occurrences), suggesting concentrations of locations in specific Belgian municipalities, with 1000 being central Brussels."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straat",
            "value_counts_without_nan": {
                "KATWILGWEG": 218,
                "QUAI PAUL VERLAINE": 167,
                "Kortrijksesteenweg": 156,
                "Wolstraat": 94,
                "RIJVISSCHEPARK": 78,
                "Leiepark": 67,
                "POORTAKKERSTRAAT": 64,
                "Bruggesteenweg": 58,
                "Havenlaan": 54,
                "VELDKANT": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 5,
            "n": 1878,
            "p_distinct": 0.20608649225840897,
            "p_missing": 0.0026624068157614484,
            "n_distinct": 386,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straat' contains street names for physical locations of service providers/suppliers. It has 1,878 total entries with only 5 missing values (0.27% missing rate). The data shows 386 unique street names (20.6% distinct values), suggesting multiple entries share the same street addresses. The most frequently occurring street names are \"KATWILGWEG\" (218 entries), \"QUAI PAUL VERLAINE\" (167 entries), and \"Kortrijksesteenweg\" (156 entries), indicating some concentration of businesses or services in these locations. The data appears to be in mixed case formatting and includes both Dutch and French street names, suggesting coverage across different linguistic regions."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus",
            "value_counts_without_nan": {
                "KATWILGWEG 2": 218,
                "QUAI PAUL VERLAINE 2 Postbus 2": 167,
                "Kortrijksesteenweg 1146": 129,
                "Wolstraat 70": 94,
                "RIJVISSCHEPARK 74": 78,
                "Leiepark 17": 67,
                "POORTAKKERSTRAAT 91 Postbus 101": 64,
                "Havenlaan 88 Postbus 60": 52,
                "Bruggesteenweg 311A Postbus B3": 45,
                "VELDKANT 35D": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.23109691160809373,
            "p_missing": 0.0,
            "n_distinct": 434,
            "description": "Based on the profiling data, the column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus' contains street addresses with house numbers and optional post box information for physical locations of suppliers. The column has 1,878 entries with no missing values, and contains 434 unique address combinations (23.1% distinct values). The most common addresses include \"KATWILGWEG 2\" (218 occurrences), \"QUAI PAUL VERLAINE 2 Postbus 2\" (167 occurrences), and \"Kortrijksesteenweg 1146\" (129 occurrences). The format appears to be consistent with Belgian address conventions, including street names followed by building numbers, and sometimes including \"Postbus\" (post box) information."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn",
            "value_counts_without_nan": {
                "KATWILGWEG 2 2050 ANTWERPEN": 218,
                "QUAI PAUL VERLAINE 2 Postbus 2 6000 CHARLEROI": 167,
                "Kortrijksesteenweg 1146 9051 SINT-DENIJS-WESTREM": 129,
                "Wolstraat 70 1000 BRUSSEL": 94,
                "RIJVISSCHEPARK 74 9052 ZWIJNAARDE": 78,
                "Leiepark 17 9051 SINT-DENIJS-WESTREM": 67,
                "POORTAKKERSTRAAT 91 Postbus 101 9051 GENT": 64,
                "Havenlaan 88 Postbus 60 1000 BRUSSEL": 52,
                "Bruggesteenweg 311A Postbus B3 8830 HOOGLEDE": 45,
                "VELDKANT 35D 2550 KONTICH": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.23375931842385517,
            "p_missing": 0.0,
            "n_distinct": 439,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn' contains structured address lines for physical locations of suppliers/vendors. It has 1,878 entries with no missing values, and contains 439 unique addresses (23.4% distinct values). The addresses appear to be primarily located in Belgian cities and municipalities, formatted with street names, building numbers, postal codes, and city names. The most frequent address appears 218 times (KATWILGWEG 2 2050 ANTWERPEN), followed by addresses in cities like Charleroi, Sint-Denijs-Westrem, and Brussels. The format consistently includes street address, postal code, and city name, with some entries also including post box numbers (\"Postbus\")."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > land > code",
            "value_counts_without_nan": {
                "BE": 1874,
                "NL": 4
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > land > code' contains country codes representing the physical location of the supplier's contact method. It is a categorical field with 1,878 total entries and no missing values. The data is dominated by \"BE\" (Belgium) with 1,874 entries, while \"NL\" (Netherlands) appears only 4 times. With just two distinct values (0.11% distinct rate), this column shows that the vast majority of suppliers are located in Belgium, with a very small presence in the Netherlands."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > land > label",
            "value_counts_without_nan": {
                "België": 1874,
                "Nederland": 4
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > land > label' contains country labels for physical locations of contact methods used by suppliers. It is a categorical field with 1,878 total entries and no missing values. The data is dominated by \"België\" (Belgium) with 1,874 entries, while \"Nederland\" (Netherlands) appears only 4 times. With just two distinct values representing 0.11% of possible distinct values, this column shows a very strong bias towards Belgian locations, suggesting the dataset primarily covers job listings or business activities in Belgium."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > land > kortLabel",
            "value_counts_without_nan": {
                "België": 1874,
                "Nederland": 4
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > land > kortLabel' contains country abbreviations or short labels for the physical location of the supplier's contact method. It has 1,878 total entries with no missing values. The data is categorical with only two unique values: \"België\" (appearing 1,874 times) and \"Nederland\" (appearing 4 times). The vast majority of entries (99.8%) are for Belgium, with only a tiny fraction (0.2%) representing the Netherlands. This suggests the dataset primarily contains information about Belgian-based suppliers or contacts."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > naam",
            "value_counts_without_nan": {
                "Jobat": 218,
                "Editx": 167,
                "LGA IT": 108,
                "ictjob.be": 94,
                "LGA Engineering": 67,
                "Kwery": 65,
                "Spark": 64,
                "Vlaanderen connect.": 52,
                "Lagom Engineering West-Vlaanderen": 45,
                "Cronos": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.20979765708200213,
            "p_missing": 0.0,
            "n_distinct": 394,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > naam' appears to contain the names of recruitment agencies or job posting organizations. It has 1,878 total entries with no missing values, and 394 unique names (approximately 21% distinct values). The most frequent organizations in the dataset are Jobat (218 entries), Editx (167 entries), and LGA IT (108 entries), followed by ictjob.be (94 entries) and LGA Engineering (67 entries). The data suggests this column represents the physical location names or business names of job listing providers, with a mix of general job boards (like Jobat), industry-specific recruiters (like LGA IT), and other recruitment organizations."
        },
        {
            "column_name": "leverancier > type",
            "value_counts_without_nan": {
                "INTERMEDIAIREN": 961,
                "DERDENLEVERANCIERS": 498,
                "GEWONE_BEDRIJVEN": 419
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.001597444089456869,
            "p_missing": 0.0,
            "n_distinct": 3,
            "description": "The column 'leverancier > type' is a categorical field that classifies the supplier or provider type for job postings. It contains exactly three distinct categories: \"INTERMEDIAIREN\" (intermediaries), which is the most common type with 961 entries, \"DERDENLEVERANCIERS\" (third-party suppliers) with 498 entries, and \"GEWONE_BEDRIJVEN\" (regular companies) with 419 entries. The column is completely populated with no missing values across all 1,878 records, suggesting it's a mandatory field in the dataset. The distribution shows that intermediaries make up roughly 51% of the suppliers, while third-party suppliers and regular companies account for approximately 27% and 22% respectively."
        },
        {
            "column_name": "leverancier > naam",
            "value_counts_without_nan": {
                "Jobat": 218,
                "Editx": 167,
                "LGA IT": 108,
                "ictjob.be": 94,
                "LGA Engineering": 67,
                "Kwery": 65,
                "Spark": 64,
                "Vlaanderen connect.": 52,
                "Lagom Engineering West-Vlaanderen": 45,
                "Cronos": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.20979765708200213,
            "p_missing": 0.0,
            "n_distinct": 394,
            "description": "The column 'leverancier > naam' appears to contain the names of job posting suppliers or recruitment agencies in the dataset. It is a text field that is consistently populated across all 1,878 records with no missing values. The data shows significant concentration among a few major suppliers, with Jobat (218 entries), Editx (167 entries), and LGA IT (108 entries) being the most frequent contributors. While there are 394 distinct supplier names in total (representing about 21% of all entries), the distribution is notably skewed towards these major players. This suggests a marketplace dominated by several large recruitment platforms but also including numerous smaller suppliers."
        },
        {
            "column_name": "leverancier > gemandateerd",
            "value_counts_without_nan": {
                "true": 1599,
                "false": 279
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'leverancier > gemandateerd' is a boolean field that indicates whether a supplier (leverancier) is mandated or not. The column contains 1,878 entries with no missing values, and only two distinct values: true (1,599 entries, approximately 85%) and false (279 entries, approximately 15%). The high proportion of \"true\" values suggests that the majority of suppliers in the dataset are mandated. This appears to be a complete and well-maintained field with 100% data completeness."
        },
        {
            "column_name": "leverancier > organisatie > id",
            "min": 352,
            "value_counts_without_nan": {
                "10684904": 218,
                "10714258": 167,
                "10697591": 108,
                "10409921": 94,
                "10697563": 67,
                "10757886": 66,
                "10777105": 64,
                "10628668": 52,
                "10692008": 45,
                "208538": 29,
                "more ...": -1
            },
            "type": "Numeric",
            "n_missing": 0,
            "n": 1878,
            "max": 10893669,
            "p_distinct": 0.23961661341853036,
            "std": 2833239.897135361,
            "p_missing": 0.0,
            "n_distinct": 450,
            "mean": 9791615.655484557,
            "description": "The column 'leverancier > organisatie > id' appears to be a numeric identifier field containing organizational IDs. It contains 1,878 entries with no missing values, ranging from 352 to 10,893,669. The data shows moderate uniqueness with 450 distinct values (about 24% of all entries), suggesting these IDs are reused across multiple records. Some organizations appear frequently in the dataset, with the most common ID \"10684904\" appearing 218 times, followed by \"10714258\" with 167 occurrences. The mean value is approximately 9,791,616 with a standard deviation of 2,833,240, indicating considerable variation in the ID numbers used."
        },
        {
            "column_name": "leverancier > organisatie > naam",
            "value_counts_without_nan": {
                "Jobat": 218,
                "Editx": 167,
                "LGA IT": 108,
                "ictjob.be": 94,
                "LGA Engineering": 67,
                "KWERY": 66,
                "Spark": 64,
                "Vlaanderen connect.": 52,
                "Lagom Engineering West-Vlaanderen": 45,
                "Cronos": 29,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.22097976570820022,
            "p_missing": 0.0,
            "n_distinct": 415,
            "description": "The column 'leverancier > organisatie > naam' contains the names of organizations or companies that are acting as job listing providers or recruiters. From the analysis of 1,878 records, there are 415 unique organization names (22.1% distinct values) with no missing values. The most frequent providers are Jobat (218 listings), Editx (167 listings), and LGA IT (108 listings), followed by ictjob.be (94 listings) and LGA Engineering (67 listings). This suggests that while there are many different organizations posting job listings, a small number of major recruitment companies and job boards dominate the platform, with Jobat being the most prominent provider."
        },
        {
            "column_name": "leverancier > organisatie > bedrijvenGalerijId",
            "min": 1567.0,
            "value_counts_without_nan": {
                "3769.0": 218,
                "4151.0": 167,
                "2970.0": 108,
                "3258.0": 94,
                "3446.0": 69,
                "2969.0": 67,
                "4534.0": 66,
                "4618.0": 64,
                "1584.0": 35,
                "3860.0": 29,
                "more ...": -1
            },
            "type": "Numeric",
            "n_missing": 498,
            "n": 1878,
            "max": 4974.0,
            "p_distinct": 0.07753623188405798,
            "std": 730.6651421227756,
            "p_missing": 0.26517571884984026,
            "n_distinct": 107,
            "mean": 3572.6652173913044,
            "description": "The column 'leverancier > organisatie > bedrijvenGalerijId' appears to be a numeric identifier field containing company gallery IDs. From the profiling data, it contains 1,878 total entries with 498 missing values (26.5% missing rate). The IDs range from 1,567 to 4,974, with a mean value of approximately 3,573. There are 107 distinct values in total (7.8% distinct rate), suggesting these IDs are reused across multiple records. The most frequent ID is 3769, appearing 218 times, followed by 4151 (167 occurrences) and 2970 (108 occurrences). The standard deviation of 730.67 indicates considerable spread in the ID values."
        },
        {
            "column_name": "leverancier > organisatie > omschrijving",
            "value_counts_without_nan": {
                "Jobat helpt je bij het zoeken naar dé job die bij je past. Je hebt keuze uit duizenden kwalitatieve jobs op Jobat.be: voltijds, deeltijds, voor elk ervaringsniveau, voor arbeiders of bedienden, in kleine en grote bedrijven, in alle sectoren en alle regios van België. Ook jij vindt dus vast en zeker je droomjob op Jobat.be. \r\n\r\nBovendien kan je op Jobat.be ook terecht voor inspirerende content, rekentools (Salariskompas, bruto-nettocalculator...), testen, podcasts en e-gidsen over solliciteren, ontslag, meer verdienen en nog veel meer.\r\n\r\nHet maakt dus niet uit of je op zoek bent naar een job, of eerder naar carrière-info, Jobat helpt jou graag in je zoektocht naar (werk)geluk.\r\n\r\nOok op zoek naar de perfecte match? Vind de job waar je écht gelukkig van wordt op Jobat.be\r\n\r\nJobat. Go for happy.\r\n\r\n \r\n\r\nwww.jobat.be\r\nVolg Jobat\r\nFacebook = https://www.facebook.com/jobat.be\r\nInstagram = https://www.instagram.com/jobat_be/\r\nTwitter = https://twitter.com/jobat\r\nLinkedIn = https://www.linkedin.com/company/jobat/\r\nYoutube = https://www.youtube.com/c/jobat": 218,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 399,
            "n": 1878,
            "p_distinct": 0.1460446247464503,
            "p_missing": 0.2124600638977636,
            "n_distinct": 216,
            "description": "The column 'leverancier > organisatie > omschrijving' appears to be a text field containing organizational descriptions, with a notable pattern where a significant portion (218 occurrences) contains a standard Jobat.be company description and social media links. The column has 399 missing values (21.25% of the total 1,878 records) and 216 unique values (14.6% distinctiveness). The predominant content appears to be a standardized company description for Jobat.be, a Belgian job search platform, which includes their mission statement, services offered, and social media contact information. This suggests the column is primarily used to store company/organization descriptions, with Jobat.be being a major contributor to the dataset."
        },
        {
            "column_name": "leverancier > organisatie > website",
            "value_counts_without_nan": {
                "http://www.legrand-associates.com": 196,
                "https://editx.eu/nl/it-jobs": 167,
                "http://www.ictjob.be": 94,
                "http://www.kwery.be": 66,
                "http://www.sparkjobs.be": 64,
                "http://www.tecjobz.be": 59,
                "http://www.vlaanderenconnect.be": 52,
                "http://www.unique.be": 32,
                "http://www.cronos.be": 29,
                "http://www.ago.jobs": 26,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 336,
            "n": 1878,
            "p_distinct": 0.18093385214007782,
            "p_missing": 0.17891373801916932,
            "n_distinct": 279,
            "description": "The column 'leverancier > organisatie > website' contains website URLs of organizations or companies posting job listings. Out of 1,878 total entries, 336 (17.9%) are missing values. The column contains 279 unique website URLs, representing about 18.1% of all entries, indicating that many organizations post multiple job listings. The most frequent websites include Legrand Associates (196 listings), EditX (167 listings), and ICTJob.be (94 listings), suggesting these are major job posting platforms or recruitment agencies. The data is stored as text and primarily consists of standard website URLs, with many appearing to be Belgian job sites or recruitment companies based on the .be domain extensions."
        },
        {
            "column_name": "leverancier > organisatie > prioritair",
            "value_counts_without_nan": {
                "false": 1680,
                "true": 198
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'leverancier > organisatie > prioritair' is a boolean field that indicates a priority status for organizations, with no missing values across all 1,878 records. The vast majority of organizations (1,680 or about 89.5%) are marked as \"false,\" while only 198 organizations (about 10.5%) are marked as \"true.\" This suggests it's a flag that distinguishes a select group of priority organizations from the standard ones, with priority status being relatively rare in the dataset."
        },
        {
            "column_name": "leverancier > organisatie > externeLinks",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'leverancier > organisatie > externeLinks' appears to be an unsupported data type in the dataset, containing 1,878 entries with no missing values (0% missing). While the exact content cannot be determined from the profiling data alone, based on the column name which translates to \"supplier > organization > external links\" in English, it likely contains URLs or references to external resources related to the supplying organizations. However, due to its \"Unsupported\" type classification, the data may be stored in a complex format (possibly an array or nested structure) that wasn't compatible with standard data profiling methods."
        },
        {
            "column_name": "leverancier > organisatie > gemeente",
            "value_counts_without_nan": {
                "ANTWERPEN": 293,
                "BRUSSEL": 189,
                "SINT-DENIJS-WESTREM": 176,
                "CHARLEROI": 167,
                "GENT": 124,
                "ZWIJNAARDE": 82,
                "HOOGLEDE": 59,
                "ROESELARE": 48,
                "KONTICH": 39,
                "HASSELT": 37,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.08040468583599573,
            "p_missing": 0.0,
            "n_distinct": 151,
            "description": "The column 'leverancier > organisatie > gemeente' contains municipality or city names where organizations (likely employers or recruitment agencies) are located in Belgium. The dataset has 1,878 entries with no missing values, and includes 151 unique municipalities (8% of all entries are distinct). The most frequently occurring cities are Antwerpen (293 entries), Brussel (189 entries), Sint-Denijs-Westrem (176 entries), Charleroi (167 entries), and Gent (124 entries), suggesting a concentration of organizations in these major Belgian urban centers. The data appears to be complete and well-maintained, with a mix of both Dutch and French municipality names represented."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > gemeente",
            "value_counts_without_nan": {
                "BRUSSEL": 131,
                "ANTWERPEN": 98,
                "ROESELARE": 92,
                "GENT": 80,
                "BRUGGE": 49,
                "KORTRIJK": 48,
                "MECHELEN": 43,
                "HERENTALS": 39,
                "KONTICH": 38,
                "HASSELT": 35,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 231,
            "n": 1878,
            "p_distinct": 0.13964784456587737,
            "p_missing": 0.12300319488817892,
            "n_distinct": 230,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > gemeente' contains municipality or city names in Belgium where job positions are located. From a total of 1,878 records, 231 (12.3%) have missing values. The column shows significant concentration in major Belgian cities, with Brussels (131 entries), Antwerp (98), Roeselare (92), and Ghent (80) being the most frequent locations. There are 230 unique municipality values in total, representing about 14% of all entries, which indicates a moderate level of geographic diversity in job locations while still showing clustering around major urban centers."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > nummer",
            "value_counts_without_nan": {
                "88": 54,
                "1": 20,
                "3": 18,
                "75": 15,
                "14": 13,
                "20": 12,
                "9": 10,
                "2": 9,
                "7": 6,
                "4": 5,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1557,
            "n": 1878,
            "p_distinct": 0.3052959501557632,
            "p_missing": 0.829073482428115,
            "n_distinct": 98,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > nummer' appears to contain street numbers for business locations. It has a high missing rate with 82.9% of values being null (1,557 out of 1,878 total entries). Among the non-missing values, there are 98 distinct numbers, with \"88\" being the most frequent (54 occurrences), followed by \"1\" (20 occurrences) and \"3\" (18 occurrences). The data is stored as text type, suggesting it can handle both simple numeric values and potentially alphanumeric street numbers, though the most common values shown are simple integers."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postcode",
            "value_counts_without_nan": {
                "1000": 131,
                "8800": 92,
                "9000": 76,
                "2000": 56,
                "8000": 49,
                "8500": 47,
                "2800": 43,
                "2200": 39,
                "2550": 38,
                "3920": 35,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 231,
            "n": 1878,
            "p_distinct": 0.14268366727383122,
            "p_missing": 0.12300319488817892,
            "n_distinct": 235,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postcode' contains Belgian postal codes for business locations. Out of 1,878 total entries, there are 235 unique postal codes (14.3% distinct values), with 231 missing values (12.3% of the dataset). The most frequently occurring postal codes include 1000 (Brussels) with 131 occurrences, 8800 (Roeselare) with 92 occurrences, and 9000 (Ghent) with 76 occurrences, suggesting a concentration of job listings in these major Belgian cities. The data appears to be stored as text values, which is appropriate for postal codes as they are not meant for numerical calculations."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straat",
            "value_counts_without_nan": {
                "Havenlaan": 47,
                "Kapeldreef": 14,
                "Smals vzw\nFonsnylaan 20\n1060 Brussel": 9,
                "Havenlaan 88, 1000 Brussel": 7,
                "Hof Ter Weze": 6,
                "Oude Brusselsestraat 14, 2800 Mechelen": 5,
                "Blekerijstraat": 4,
                "Hinnenboomstraat": 4,
                "OUDE BRUSSELSESTRAAT": 4,
                "Edingensesteenweg": 4,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1557,
            "n": 1878,
            "p_distinct": 0.5856697819314641,
            "p_missing": 0.829073482428115,
            "n_distinct": 188,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straat' contains street address information for business locations, but has a notably high missing data rate of about 83%. Of the 1,878 total entries, only 321 have street information, with 188 unique street values. The most frequently occurring street is \"Havenlaan\" with 47 occurrences, followed by \"Kapeldreef\" with 14 occurrences. The data format appears to be inconsistent, as some entries contain complete addresses with street numbers and postal codes (like \"Havenlaan 88, 1000 Brussel\"), while others only list the street name (like \"Blekerijstraat\"). This suggests there might be some data quality issues in terms of standardization of address formats."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straatNummerPostbus",
            "value_counts_without_nan": {
                "": 1326,
                "Havenlaan 88 Postbus 60": 46,
                "Kapeldreef 75": 14,
                "Smals vzw\nFonsnylaan 20\n1060 Brussel 20": 9,
                "Havenlaan 88, 1000 Brussel 88": 7,
                "Oude Brusselsestraat 14, 2800 Mechelen 14": 6,
                "Edingensesteenweg 196": 4,
                "Hinnenboomstraat 1 Postbus 2": 4,
                "OUDE BRUSSELSESTRAAT 14": 4,
                "Blekerijstraat 23-29": 4,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 231,
            "n": 1878,
            "p_distinct": 0.11839708561020036,
            "p_missing": 0.12300319488817892,
            "n_distinct": 195,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > straatNummerPostbus' appears to contain street addresses and post box information for business locations in Belgium. Out of 1,878 total entries, 231 (12.3%) are missing values, and there are 195 unique values (11.8% distinct). The most common entry is an empty string (1,326 occurrences), followed by \"Havenlaan 88 Postbus 60\" (46 occurrences). The data format varies, sometimes including just a street name and number (like \"Kapeldreef 75\"), while other entries contain full addresses with postal codes and post box numbers (like \"Havenlaan 88, 1000 Brussel 88\"). Many entries appear to be in Dutch/Flemish, consistent with Belgian business addresses."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > lijn",
            "value_counts_without_nan": {
                "8800 ROESELARE": 79,
                "9000 GENT": 65,
                "1000 BRUSSEL": 61,
                "2000 ANTWERPEN": 52,
                "8000 BRUGGE": 48,
                "Havenlaan 88 Postbus 60 1000 BRUSSEL": 46,
                "8500 KORTRIJK": 40,
                "2550 KONTICH": 35,
                "2200 HERENTALS": 34,
                "3920 LOMMEL": 33,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 231,
            "n": 1878,
            "p_distinct": 0.24772313296903462,
            "p_missing": 0.12300319488817892,
            "n_distinct": 408,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > lijn' contains structured address line information for business locations in Belgium. Out of 1,878 total entries, approximately 12.3% (231) are missing values. The column shows high diversity with 408 unique values (24.8% of all entries), suggesting varied business locations across different cities. The most frequent locations are in major Belgian cities, with Roeselare (79 entries), Gent (65 entries), Brussels (61 entries), and Antwerp (52 entries) being the most common. Some entries contain complete address information including street names and postal codes (like \"Havenlaan 88 Postbus 60 1000 BRUSSEL\"), while others appear to be simplified to just city name and postal code format."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > code",
            "value_counts_without_nan": {
                "BE": 1643,
                "NL": 4
            },
            "type": "Categorical",
            "n_missing": 231,
            "n": 1878,
            "p_distinct": 0.0012143290831815423,
            "p_missing": 0.12300319488817892,
            "n_distinct": 2,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > code' contains country codes representing the location of business sites. It has 1,878 total entries, with 231 missing values (12.3% of the data). The column contains only two distinct values: \"BE\" (Belgium) which appears 1,643 times, and \"NL\" (Netherlands) which appears 4 times. This strongly suggests that the vast majority of business locations (99.8% of non-missing values) are in Belgium, with only a tiny fraction in the Netherlands, making this a highly imbalanced categorical variable."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > label",
            "value_counts_without_nan": {
                "België": 1643,
                "Nederland": 4
            },
            "type": "Categorical",
            "n_missing": 231,
            "n": 1878,
            "p_distinct": 0.0012143290831815423,
            "p_missing": 0.12300319488817892,
            "n_distinct": 2,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > label' contains the country labels for job locations, with 1,878 total entries. It is a categorical field with only two distinct values: \"België\" (1,643 entries) and \"Nederland\" (4 entries). The column has 231 missing values, representing about 12.3% of the data. The vast majority of job locations (99.8% of non-missing values) are in Belgium, with only a tiny fraction located in the Netherlands, suggesting this dataset primarily focuses on Belgian job postings."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > kortLabel",
            "value_counts_without_nan": {
                "België": 1643,
                "Nederland": 4
            },
            "type": "Categorical",
            "n_missing": 231,
            "n": 1878,
            "p_distinct": 0.0012143290831815423,
            "p_missing": 0.12300319488817892,
            "n_distinct": 2,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > land > kortLabel' contains short country labels indicating the location of business sites. It has 1,878 total entries, with 231 missing values (12.3%). The data is categorical with only 2 distinct values: \"België\" appears 1,643 times and \"Nederland\" appears 4 times, showing that the vast majority of business locations are in Belgium. This column appears to be used to indicate the country of employment in a shortened label format, with a strong predominance of Belgian locations."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > naam",
            "value_counts_without_nan": {
                "Vlaanderen connect.": 46,
                "imec": 14,
                "BOGAERTS GREENHOUSE LOGISTICS": 4,
                "Datashift": 4,
                "COLRUYT": 4,
                "VDL Bus Roeselare N.V.": 3,
                "LAB Motion Systems": 3,
                "JOBUP": 3,
                "NEDSCHROEF HERENTALS": 3,
                "Altro Vastgoed": 3,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1645,
            "n": 1878,
            "p_distinct": 0.6180257510729614,
            "p_missing": 0.8759318423855165,
            "n_distinct": 144,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > naam' appears to contain company or business location names where jobs are located. It's a text field that is largely sparse, with about 88% of the 1,878 entries being missing values. Among the non-missing values, there is significant variety with 144 unique business names (62% distinct values). The most frequent business location is \"Vlaanderen connect.\" appearing 46 times, followed by \"imec\" with 14 occurrences, while several other companies like COLRUYT, Datashift, and BOGAERTS GREENHOUSE LOGISTICS appear 3-4 times each. This suggests the column primarily tracks employer or facility names where positions are based."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regio > code",
            "value_counts_without_nan": {
                "BE234B": 179,
                "BE211A": 146,
                "BE256A": 121,
                "BE254A": 77,
                "BE241D": 77,
                "BE251A": 73,
                "BE213B": 73,
                "BE211D": 60,
                "BE242B": 58,
                "BE212B": 55,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 216,
            "n": 1878,
            "p_distinct": 0.03429602888086643,
            "p_missing": 0.11501597444089456,
            "n_distinct": 57,
            "description": "The column 'profiel > tewerkstellingsLocatie > regio > code' appears to contain regional codes, likely representing different geographical areas in Belgium (given the \"BE\" prefix in the codes). It contains 1,878 total entries, with 216 missing values (11.5% of the data). There are 57 unique codes in use, with the most frequent being \"BE234B\" (179 occurrences), \"BE211A\" (146 occurrences), and \"BE256A\" (121 occurrences). The column is stored as text data, and the relatively low number of distinct values (3.4% of all entries are unique) suggests this is a standardized coding system for administrative or geographical regions."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regio > label",
            "value_counts_without_nan": {
                "Regio Gent": 179,
                "Regio Antwerpen": 146,
                "Regio Roeselare - Izegem": 121,
                "Regio Kortrijk": 77,
                "Regio Vilvoorde - Zaventem": 77,
                "Regio Brugge": 73,
                "Regio Herentals - Westerlo": 73,
                "Regio Kontich - Mortsel - Ranst": 60,
                "Regio Leuven": 58,
                "Regio Mechelen": 55,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 216,
            "n": 1878,
            "p_distinct": 0.03429602888086643,
            "p_missing": 0.11501597444089456,
            "n_distinct": 57,
            "description": "The column 'profiel > tewerkstellingsLocatie > regio > label' contains regional location information for job postings in Belgium, with a total of 1,878 entries. It has 57 unique region labels (3.4% distinct values), with the most common regions being Gent (179 entries), Antwerpen (146 entries), and Roeselare - Izegem (121 entries). Approximately 11.5% of the entries (216) are missing values. The data appears to be structured as standardized regional labels, primarily covering major Belgian metropolitan areas and their surrounding regions, which suggests this column is used to categorize job locations by official administrative or economic regions."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regio > kortLabel",
            "value_counts_without_nan": {
                "Regio Gent": 179,
                "Regio Antwerpen": 146,
                "Regio Roeselare - Izegem": 121,
                "Regio Kortrijk": 77,
                "Regio Vilvoorde - Zaventem": 77,
                "Regio Brugge": 73,
                "Regio Herentals - Westerlo": 73,
                "Regio Kontich - Mortsel - Ranst": 60,
                "Regio Leuven": 58,
                "Regio Mechelen": 55,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 216,
            "n": 1878,
            "p_distinct": 0.03429602888086643,
            "p_missing": 0.11501597444089456,
            "n_distinct": 57,
            "description": "The column 'profiel > tewerkstellingsLocatie > regio > kortLabel' contains short regional labels indicating job locations in Belgium, with 1,878 total entries and 216 missing values (11.5% of the data). It has 57 unique regional labels, with the most common being \"Regio Gent\" (179 entries), \"Regio Antwerpen\" (146 entries), and \"Regio Roeselare - Izegem\" (121 entries). The data appears to be standardized text entries representing geographic regions, primarily focused on major Belgian metropolitan areas and their surrounding territories. The relatively low number of distinct values (3.4% of total entries) suggests this is a controlled vocabulary used for consistent regional classification in job postings."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > regioOfAdres",
            "value_counts_without_nan": {
                "BRUSSEL": 131,
                "ANTWERPEN": 98,
                "ROESELARE": 92,
                "GENT": 80,
                "BRUGGE": 49,
                "KORTRIJK": 48,
                "Brussel": 48,
                "MECHELEN": 43,
                "HERENTALS": 39,
                "KONTICH": 38,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.14004259850905218,
            "p_missing": 0.0,
            "n_distinct": 263,
            "description": "The column 'profiel > tewerkstellingsLocatie > regioOfAdres' contains location information for job positions, primarily consisting of Belgian cities and regions. It has 1,878 total entries with no missing values, and 263 unique locations (14% distinct values). The most frequently occurring locations are major Belgian cities, with Brussels (131 entries), Antwerp (98 entries), Roeselare (92 entries), and Ghent (80 entries) being the most common. The data appears to be text-based and shows some inconsistency in capitalization (e.g., \"BRUSSEL\" vs \"Brussel\"), suggesting potential standardization issues in how the location names are recorded."
        },
        {
            "column_name": "profiel > dienstregeling > dienstregelingen",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "Based on the provided profiling data, the column 'profiel > dienstregeling > dienstregelingen' appears to be an \"Unsupported\" data type column that contains information about work schedules or service arrangements. The column has 1,878 entries with no missing values (0% missing data). Due to its \"Unsupported\" type classification, it likely contains complex or structured data (possibly arrays or nested objects) that couldn't be categorized into standard data types during the profiling process."
        },
        {
            "column_name": "profiel > dienstregeling > arbeidsDuur > code",
            "value_counts_without_nan": {
                "V": 1849,
                "D": 29
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > dienstregeling > arbeidsDuur > code' is a categorical field with 1,878 total entries and no missing values. It contains only two distinct codes: \"V\" (which appears 1,849 times) and \"D\" (which appears 29 times). The distribution is highly skewed, with \"V\" being the dominant code representing approximately 98.5% of all entries. Given this is part of a \"dienstregeling\" (work schedule) and \"arbeidsDuur\" (working hours) structure, these codes likely represent different types of working time arrangements, though the specific meaning of \"V\" and \"D\" would require additional context to interpret."
        },
        {
            "column_name": "profiel > dienstregeling > arbeidsDuur > label",
            "value_counts_without_nan": {
                "voltijds": 1849,
                "deeltijds": 29
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > dienstregeling > arbeidsDuur > label' is a categorical field that indicates whether a job position is full-time (\"voltijds\") or part-time (\"deeltijds\"). The data is complete with no missing values across all 1,878 records. The vast majority of positions (1,849 or approximately 98.5%) are full-time, while only 29 positions (approximately 1.5%) are part-time. This column has just two distinct values, making it effectively a binary categorical variable that describes the working time arrangement of the job posting."
        },
        {
            "column_name": "profiel > dienstregeling > arbeidsDuur > kortLabel",
            "value_counts_without_nan": {
                "voltijds": 1849,
                "deeltijds": 29
            },
            "type": "Categorical",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > dienstregeling > arbeidsDuur > kortLabel' is a categorical field that indicates whether a job position is full-time (\"voltijds\") or part-time (\"deeltijds\"). The data is complete with no missing values across all 1,878 records. The vast majority of positions (1,849 or approximately 98.5%) are full-time, while only 29 positions (approximately 1.5%) are part-time. This column has just two distinct values, making it effectively a binary categorical variable that captures the basic working time arrangement of the job posting."
        },
        {
            "column_name": "profiel > dienstregeling > werkshiften",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "Based on the provided profiling data, the column 'profiel > dienstregeling > werkshiften' appears to be an \"Unsupported\" data type column that contains information about work shifts or schedules. The column has complete data with no missing values across all 1,878 records (n_missing: 0, p_missing: 0.0). While the specific format and content of the work shift data cannot be determined from the profiling information alone, the column name suggests it contains details about working schedules or shift patterns for the job positions in the dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > gemeente",
            "value_counts_without_nan": {
                "ANTWERPEN": 114,
                "GENT": 105,
                "HOOGLEDE": 82,
                "BRUSSEL": 69,
                "ROESELARE": 67,
                "HASSELT": 45,
                "HERENTALS": 44,
                "KORTRIJK": 42,
                "MECHELEN": 41,
                "KONTICH": 38,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 497,
            "n": 1878,
            "p_distinct": 0.14047791455467054,
            "p_missing": 0.26464323748668794,
            "n_distinct": 194,
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > gemeente' contains municipality or city names in Belgium where job applications should be sent. Out of 1,878 total entries, about 26.5% are missing values. The column contains 194 unique municipalities, with Antwerpen (114 entries), Gent (105 entries), and Hooglede (82 entries) being the most frequently occurring locations. Major Belgian cities like Brussel, Roeselare, Hasselt, and Kortrijk are also prominently represented. This structured address field appears to be primarily used to specify the geographic location for job application submissions, with a clear focus on Belgian urban centers."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > nummer",
            "value_counts_without_nan": {
                "88": 51,
                "1": 42,
                "5": 26,
                "131": 23,
                "105": 20,
                "4": 20,
                "72 1": 17,
                "16": 16,
                "75": 16,
                "26": 14,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1203,
            "n": 1878,
            "p_distinct": 0.23407407407407407,
            "p_missing": 0.6405750798722045,
            "n_distinct": 158,
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > nummer' appears to contain street numbers or building numbers as part of structured address information for job application contact details. It's a text field that is missing in about 64% of the records (1,203 out of 1,878 total entries). Among the entries that do have values, there are 158 unique numbers, representing about 23.4% distinctness in the data. The most common numbers are \"88\" (appearing 51 times), \"1\" (42 times), and \"5\" (26 times), suggesting some addresses are used repeatedly across multiple job postings. The format appears to accommodate both simple numbers and occasionally compound numbers (like \"72 1\"), indicating it can handle various address number formats."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > postcode",
            "value_counts_without_nan": {
                "8830": 82,
                "2000": 72,
                "9051": 71,
                "1000": 69,
                "8800": 67,
                "2200": 44,
                "3500": 44,
                "2800": 41,
                "8500": 41,
                "2550": 38,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 497,
            "n": 1878,
            "p_distinct": 0.14409847936278058,
            "p_missing": 0.26464323748668794,
            "n_distinct": 199,
            "description": "Based on the profiling data, 'profiel > sollicitatieInfo > adres > gestructureerdAdres > postcode' is a text column containing Belgian postal codes for job application addresses. The column has 1,878 total entries, with 497 missing values (26.5% of the data). There are 199 unique postal codes used (14.4% distinct values), suggesting a good distribution across different locations in Belgium. The most frequently occurring postal codes are 8830, 2000 (Antwerp), and 9051 (Ghent area), with 82, 72, and 71 occurrences respectively. The presence of postal codes like 1000 (Brussels) and other major city codes indicates this dataset covers job opportunities across various Belgian metropolitan areas."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > straat",
            "value_counts_without_nan": {
                "Havenlaan": 51,
                "Poederleeseweg": 23,
                "Beelbroekstraat": 20,
                "Sint-Piterskaai": 17,
                "Kapeldreef": 14,
                "Frankrijklei": 13,
                "Scheldestraat": 13,
                "Markt": 10,
                "Kempische steenweg": 10,
                "Sint-Michielsstraat": 9,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1183,
            "n": 1878,
            "p_distinct": 0.460431654676259,
            "p_missing": 0.6299254526091587,
            "n_distinct": 320,
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > straat' contains street names for job application addresses in what appears to be a Belgian job posting dataset. Out of 1,878 total entries, about 63% (1,183) are missing values, indicating that street address information is often not provided. Where data is present, there are 320 unique street names, with \"Havenlaan\" being the most frequent (51 occurrences), followed by \"Poederleeseweg\" (23 occurrences) and \"Beelbroekstraat\" (20 occurrences). The high number of distinct values (46% of non-null values are unique) suggests this is a diverse dataset covering many different locations."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > straatNummerPostbus",
            "value_counts_without_nan": {
                "": 686,
                "Havenlaan 88 Postbus 60": 50,
                "Poederleeseweg 131": 23,
                "Beelbroekstraat 105 Postbus B": 20,
                "Sint-Piterskaai 72 1": 17,
                "Kapeldreef 75": 14,
                "Frankrijklei 5 Postbus 0401": 13,
                "Scheldestraat 26 Postbus 1": 12,
                "Sint-Michielsstraat 27": 9,
                "Kempische steenweg 305 Postbus 7": 9,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 497,
            "n": 1878,
            "p_distinct": 0.2512671976828385,
            "p_missing": 0.26464323748668794,
            "n_distinct": 347,
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > straatNummerPostbus' appears to contain street addresses and post box information for job application locations in Belgium. Out of 1,878 total entries, about 26.5% (497) are missing values, and there are 347 unique address combinations (25.1% distinct values). The most common entry is an empty string (686 occurrences), followed by \"Havenlaan 88 Postbus 60\" (50 occurrences). The data format typically includes street names with house numbers and, where applicable, post box numbers (e.g., \"Frankrijklei 5 Postbus 0401\"). This suggests the column is used to store detailed address information for where job applications should be sent."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > lijn",
            "value_counts_without_nan": {
                "8830 HOOGLEDE": 77,
                "9051 GENT": 64,
                "Havenlaan 88 Postbus 60 1000 BRUSSEL": 50,
                "8800 ROESELARE": 44,
                "2000 ANTWERPEN": 35,
                "2550 KONTICH": 33,
                "2800 MECHELEN": 26,
                "Poederleeseweg 131 2200 HERENTALS": 23,
                "Beelbroekstraat 105 Postbus B 9040 SINT-AMANDSBERG": 20,
                "8530 HARELBEKE": 18,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 497,
            "n": 1878,
            "p_distinct": 0.3461259956553222,
            "p_missing": 0.26464323748668794,
            "n_distinct": 478,
            "description": "Based on the profiling data, the column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > lijn' contains structured address information for job postings, typically combining street addresses, postal codes, and city names in Belgium. The column has 1,878 total entries with 497 missing values (26.5% of the data). It shows significant variety with 478 unique values (34.6% of non-missing values), suggesting many different address locations. The most frequent addresses appear to be in various Belgian cities, with \"8830 HOOGLEDE\" (77 occurrences), \"9051 GENT\" (64 occurrences), and \"Havenlaan 88 Postbus 60 1000 BRUSSEL\" (50 occurrences) being the most common. The format varies between simple city-postal code combinations and full street addresses with postal boxes."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > land > code",
            "value_counts_without_nan": {
                "BE": 1375,
                "NL": 6
            },
            "type": "Categorical",
            "n_missing": 497,
            "n": 1878,
            "p_distinct": 0.001448225923244026,
            "p_missing": 0.26464323748668794,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > adres > land > code' contains country codes used for job application addresses. It is a categorical field with only 2 unique values: \"BE\" (Belgium) and \"NL\" (Netherlands). Out of 1,878 total entries, Belgium is overwhelmingly the most common with 1,375 occurrences, while the Netherlands appears only 6 times. The column has a significant number of missing values (497 entries, or about 26.5% of the data), suggesting that country code information is not always provided in the job postings."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > land > label",
            "value_counts_without_nan": {
                "België": 1375,
                "Nederland": 6
            },
            "type": "Categorical",
            "n_missing": 497,
            "n": 1878,
            "p_distinct": 0.001448225923244026,
            "p_missing": 0.26464323748668794,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > adres > land > label' is a categorical field that contains the country name where job applications should be sent. It has 1,878 total entries, with 497 missing values (26.46% of the data). The column contains only two distinct values: \"België\" appears 1,375 times and \"Nederland\" appears 6 times, indicating that the vast majority of job application addresses are located in Belgium. This suggests the dataset primarily focuses on job postings in the Belgian market, with only a very small number of positions requiring applications to be sent to the Netherlands."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > land > kortLabel",
            "value_counts_without_nan": {
                "België": 1375,
                "Nederland": 6
            },
            "type": "Categorical",
            "n_missing": 497,
            "n": 1878,
            "p_distinct": 0.001448225923244026,
            "p_missing": 0.26464323748668794,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > adres > land > kortLabel' contains country abbreviations or short labels for job application addresses, with only two unique values: \"België\" and \"Nederland\". Out of 1,878 total entries, 1,375 are for Belgium and only 6 for Netherlands, while 497 entries (approximately 26.5%) are missing values. This suggests that the dataset primarily contains job postings or applications from Belgium, with a very small representation from the Netherlands, and about a quarter of the records lacking country information."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > naam",
            "value_counts_without_nan": {
                "LGA IT": 108,
                "Tecjobz": 76,
                "LGA Engineering": 67,
                "Spark HR": 64,
                "Vlaanderen connect.": 50,
                "Kingfisher IT, Engineering, Supply Chain én Finance & Legal": 23,
                "Oxida": 23,
                "Le Grand & Associates": 21,
                "The Bee Academy": 20,
                "vind!": 20,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 918,
            "n": 1878,
            "p_distinct": 0.278125,
            "p_missing": 0.48881789137380194,
            "n_distinct": 267,
            "description": "The column 'profiel > sollicitatieInfo > adres > naam' appears to contain company or organization names associated with job application addresses. From the profiling data, this field is present in about 51% of the records (960 out of 1,878 entries), with 918 missing values. There are 267 unique names in the dataset, representing about 28% of all values. The most frequently occurring names are recruitment or HR-related companies, with \"LGA IT\" (108 occurrences), \"Tecjobz\" (76 occurrences), and \"LGA Engineering\" (67 occurrences) being the top three most common entries. The data suggests this column primarily contains names of recruitment agencies or hiring organizations where job applications should be submitted."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > email",
            "value_counts_without_nan": {
                "selectiesvlaanderenconnect@vlaanderen.be": 42,
                "hr@thebeeacademy.be": 20,
                "outsourcing@bizztalent.be": 13,
                "gitte.collier@vlaanderen.be": 10,
                "jobs@newpointprofessionals.be": 9,
                "info@konnekt.be": 8,
                "betterwork4me@gmail.com": 6,
                "fien.desmet@vintecc.com": 5,
                "Sandra.Kolaric@imec.be": 5,
                "Jobs@HEADHUNTER.vlaanderen": 5,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1468,
            "n": 1878,
            "p_distinct": 0.5536585365853659,
            "p_missing": 0.7816826411075612,
            "n_distinct": 227,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > email' contains contact email addresses for job applications, but is notably sparse with 78.2% of entries being missing (1,468 out of 1,878 total records). Where data is present, there are 227 unique email addresses, representing about 55.4% of the non-missing values. The most frequently occurring email address is \"selectiesvlaanderenconnect@vlaanderen.be\" which appears 42 times, followed by \"hr@thebeeacademy.be\" with 20 occurrences. The data appears to be primarily composed of professional email addresses from various organizations and recruitment agencies in the Flemish region."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > telefoon",
            "value_counts_without_nan": {
                "0000000000": 20,
                "/": 12,
                "0492183185": 11,
                "03 689 14 91": 8,
                "09 298 01 07": 5,
                "016283079": 5,
                "050893807": 5,
                "0477/97.33.74": 5,
                "+32471611344": 4,
                "016 28 39 75": 4,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1519,
            "n": 1878,
            "p_distinct": 0.6350974930362117,
            "p_missing": 0.808839190628328,
            "n_distinct": 228,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > telefoon' contains contact telephone numbers for job postings, but is notably sparse with about 81% of entries being missing. When present, the numbers appear in various formats including standard Belgian phone numbers (both mobile and landline) with different formatting styles - some with spaces, some with slashes, and some without separators. The most common single value is \"0000000000\" (appearing 20 times), followed by \"/\" (12 times), suggesting some placeholder or invalid entries. Out of the 1,878 total entries, there are 228 unique phone number values, indicating significant variation in the data. The numbers follow Belgian telephone number patterns, including both local area codes (like \"03\", \"09\", \"016\") and mobile prefixes, with some international format entries (\"+32\") also present."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > familienaam",
            "value_counts_without_nan": {
                "Verantwoordelijke Human Resources": 218,
                "LGA IT": 108,
                "LGA Engineering": 67,
                "Kwery ": 65,
                "Ellen Vanderschueren": 28,
                "AGO Jobs & HR": 26,
                "-": 23,
                "Le Grand & Associates": 21,
                "The Bee Academy": 20,
                "Kwery": 16,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.3226837060702875,
            "p_missing": 0.0,
            "n_distinct": 606,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > familienaam' contains contact person surnames or department names for job applications, with 1,878 total entries and no missing values. It shows moderate variety with 606 distinct values (32.3% uniqueness). The most common entries are \"Verantwoordelijke Human Resources\" (218 occurrences), \"LGA IT\" (108 occurrences), and \"LGA Engineering\" (67 occurrences), suggesting that some entries represent department names rather than actual surnames. The data appears to be used for recruitment contact information, mixing both individual surnames and organizational department names as contact points for job applications."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > volledigeNaam",
            "value_counts_without_nan": {
                "Verantwoordelijke Human Resources": 218,
                "LGA IT": 108,
                "LGA Engineering": 67,
                "Kwery ": 65,
                "Ellen Vanderschueren": 28,
                "AGO Jobs & HR": 26,
                "-": 23,
                "Le Grand & Associates": 21,
                "The Bee Academy": 20,
                "Kwery": 16,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.3226837060702875,
            "p_missing": 0.0,
            "n_distinct": 606,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > volledigeNaam' contains contact person names for job applications, with 1,878 total entries and no missing values. It shows moderate variety with 606 unique values (32.3% distinct). The most frequent contact name is \"Verantwoordelijke Human Resources\" (218 occurrences), followed by \"LGA IT\" (108 occurrences) and \"LGA Engineering\" (67 occurrences). Some entries appear to be department or company names rather than individual names, suggesting inconsistent data entry practices. The column is stored as text type and appears to be used for identifying the primary contact person or department for job applications."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > webadres",
            "value_counts_without_nan": {
                "https://www.squarecity.be/jobs/project-engineer-2/": 2,
                "https://app.beehire.com/invite/pbfq7KHY3": 2,
                "https://werkenbijdehora.be/vacature/junior-backend-ontwikkelaar/": 2,
                "https://ses.howest.be": 2,
                "https://www.squarecity.be/jobs/senior-recruiter/": 2,
                "https://werkenbijdehora.be/vacature/backend-ontwikkelaar/": 2,
                "https://editx.eu/en/job/11154/network-security-engineer?utm_source=vdab&utm_medium=cpc&utm_campaign=multicasting_vdab": 2,
                "https://app.beehire.com/invite/d-hfTZRVz": 2,
                "https://goodturn.recruitee.com/o/fondsenwerver/c/new": 2,
                "https://www.aplitrak.com/?adid=RXZ5TG9leXMuODQyMTUuMTAyMEBodWJvLmFwbGl0cmFrLmNvbQ": 2,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 274,
            "n": 1878,
            "p_distinct": 0.9937655860349127,
            "p_missing": 0.14589989350372737,
            "n_distinct": 1594,
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > webadres' appears to contain web addresses (URLs) where job seekers can apply for positions online. From the data profile, it's a text field containing 1,878 entries, with 274 missing values (approximately 14.6% of the total). The column shows high uniqueness, with 1,594 distinct values representing about 99.4% of all non-null entries. The sample URLs point to various job application platforms and company career pages, including recruitment systems (like Beehire), company websites, and job posting platforms. Most URLs appear to be specific to individual job postings, with some examples showing direct application links to positions like \"Project Engineer,\" \"Senior Recruiter,\" and \"Backend Developer.\""
        },
        {
            "column_name": "profiel > sollicitatieInfo > viaBrief",
            "value_counts_without_nan": {
                "false": 1865,
                "true": 13
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > viaBrief' is a boolean field that indicates whether job applications can be submitted via letter. Out of 1,878 total entries, only 13 jobs (0.7%) accept applications by letter, while the vast majority (1,865 entries or 99.3%) do not accept this application method. The column is complete with no missing values and contains only two distinct values (true/false), suggesting it is a consistently tracked, binary feature of the job application process."
        },
        {
            "column_name": "profiel > sollicitatieInfo > viaVDAB",
            "value_counts_without_nan": {
                "false": 1423,
                "true": 455
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > viaVDAB' is a boolean field that indicates whether job applications can be submitted through VDAB (likely the Flemish Employment and Vocational Training Service). The column has no missing values across all 1,878 records and contains only two distinct values: false (1,423 instances) and true (455 instances). Approximately 24% of the job postings accept applications through VDAB, while 76% do not use this application method. This is a complete and clean dataset for this particular field, with every record having a clear yes/no indication regarding VDAB application acceptance."
        },
        {
            "column_name": "profiel > sollicitatieInfo > viaBezoek",
            "value_counts_without_nan": {
                "false": 1624,
                "true": 254
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > viaBezoek' is a boolean field that indicates whether in-person visits are accepted as a method of job application. Out of 1,878 total entries, there are no missing values, and the data shows that in-person visits are not accepted (false) in the majority of cases (1,624 entries or about 86.5%), while only 254 entries (about 13.5%) accept in-person visits (true) as an application method. This appears to be a consistently populated field with only two distinct values possible."
        },
        {
            "column_name": "profiel > sollicitatieInfo > extraInfo > html",
            "value_counts_without_nan": {
                "<p><span>Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.</span></p>": 30,
                "<b>Nieuw: Mobiel solliciteren</b> met je job board CV!": 12,
                "Heb je interesse? Kom dan langs in ons kantoor of contacteer ons via +32 14 88 88 03 of www.ago.jobs en schrijf je in!": 7,
                "<p><span lang=\"EN-GB\">Interesse in deze job? </span><span>Of discreet op zoek naar een nieuwe uitdaging binnen IT, neem zeker contact met ons op. Wij nodigen u graag uit voor een kennismakend gesprek. </span></p> \n<p><span>Info@konnekt.be tav Amaury Locy - 09 298 01 07</span></p>": 5,
                "<p>Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.</p>": 5,
                "<p><span>Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.</span></p>": 4,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1553,
            "n": 1878,
            "p_distinct": 0.7353846153846154,
            "p_missing": 0.8269435569755058,
            "n_distinct": 239,
            "description": "Based on the profiling data, the column 'profiel > sollicitatieInfo > extraInfo > html' contains HTML-formatted additional information related to job application procedures. This column is sparsely populated, with about 82.7% of entries being missing (1,553 out of 1,878 total records). When data is present, it contains HTML-formatted text with various types of supplementary application information, including statements about salary scales, mobile application options, and contact instructions. The most common value (appearing 30 times) is a notice about Vlaanderen Connect's salary structure, while other frequent entries include information about mobile application options and contact details for applying. The column shows high variability in its content, with 239 distinct values representing about 73.5% of the non-missing entries."
        },
        {
            "column_name": "profiel > sollicitatieInfo > extraInfo > plainText",
            "value_counts_without_nan": {
                "Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 38,
                "Nieuw: Mobiel solliciteren met je job board CV!": 12,
                "Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 7,
                "Heb je interesse? Kom dan langs in ons kantoor of contacteer ons via +32 14 88 88 03 of www.ago.jobs en schrijf je in!": 7,
                "Interesse in deze job? Of discreet op zoek naar een nieuwe uitdaging binnen IT, neem zeker contact met ons op. Wij nodigen u graag uit voor een kennismakend gesprek. Info@konnekt.be tav Amaury Locy - 09 298 01 07": 6,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1553,
            "n": 1878,
            "p_distinct": 0.7046153846153846,
            "p_missing": 0.8269435569755058,
            "n_distinct": 229,
            "description": "The column 'profiel > sollicitatieInfo > extraInfo > plainText' appears to contain additional application information or instructions in plain text format for job postings. This is a sparsely populated field, with 82.7% of entries being missing (1,553 out of 1,878 total records). When present, the content typically includes information about salary scales, application procedures, or contact details for interested candidates. The field has 229 unique values, representing about 70.5% of all non-null entries. The most common entry (appearing 38 times) relates to Vlaanderen Connect's salary structure, while other frequent entries include mobile application instructions and contact information for recruitment agencies. The text appears to be primarily in Dutch and English, suggesting this is likely from a Belgian job posting system."
        },
        {
            "column_name": "profiel > sollicitatieInfo > extraInfo > markdown",
            "value_counts_without_nan": {
                "Vlaanderen Connect werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 38,
                "**Nieuw: Mobiel solliciteren** met je job board CV!": 12,
                "Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.be is dus niet van toepassing op deze functie.": 7,
                "Heb je interesse? Kom dan langs in ons kantoor of contacteer ons via +32 14 88 88 03 of www.ago.jobs en schrijf je in!": 7,
                "Interesse in deze job? Of discreet op zoek naar een nieuwe uitdaging binnen IT, neem zeker contact met ons op. Wij nodigen u graag uit voor een kennismakend gesprek. \n\nInfo@konnekt.be tav Amaury Locy - 09 298 01 07": 5,
                "Vlaanderen connect. werkt met eigen loonbarema's. De salarissimulator op werkenvoorvlaanderen.beis dus niet van toepassing op deze functie.": 4,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1553,
            "n": 1878,
            "p_distinct": 0.7107692307692308,
            "p_missing": 0.8269435569755058,
            "n_distinct": 231,
            "description": "The column 'profiel > sollicitatieInfo > extraInfo > markdown' appears to contain additional application information in Markdown format for job postings. It is sparsely populated, with about 82.7% of the 1,878 entries being missing values. Among the non-missing entries, there is a high degree of variety with 231 distinct values (71% uniqueness rate). The most common entry, appearing 38 times, relates to salary information for Vlaanderen Connect positions, while other frequent entries include information about mobile application options and contact details for specific recruiters. The content appears to be primarily in Dutch and includes various types of supplementary application instructions, salary information, and contact details for job seekers."
        },
        {
            "column_name": "profiel > aanbod > aanbodEnVoordelen > html",
            "value_counts_without_nan": {
                "-": 39,
                "<p><strong><span lang=\"NL\">Diversiteit:</span></strong><span lang=\"NL\"> Projecten in sectoren zoals fintech, healthcare, retail en overheid.</span></p> \n<p><strong><span lang=\"NL\">Groei:</span></strong><span lang=\"NL\"> Opleidingsbudget voor certificeringen.</span></p> \n<p><strong><span lang=\"NL\">Flexibiliteit:</span></strong><span lang=\"NL\"> Hybride werken en keuze uit projecten die aansluiten bij jouw interesses.</span></p> \n<p><strong>Part of the hive:</strong> Samenwerking met collega experts in cloud, security en data.</p> \n<p><strong><span lang=\"NL\">Salaris:</span></strong><span lang=\"NL\"> Competetief pakket met bonusregeling, afhankelijk van ervaring en inzet.</span></p>": 20,
                ".": 15,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 33,
            "n": 1878,
            "p_distinct": 0.8341463414634146,
            "p_missing": 0.01757188498402556,
            "n_distinct": 1539,
            "description": "The column 'profiel > aanbod > aanbodEnVoordelen > html' appears to contain HTML-formatted text describing job offers and benefits for positions in Dutch/Belgian job listings. From the profiling data, it's a text field with 1,878 total entries, of which only 33 (1.76%) are missing. The column has high variability with 1,539 unique values (83.4% distinct entries). While most entries appear to be unique, there are some common patterns including 39 entries containing just a dash (\"-\"), 20 entries containing a standardized HTML-formatted list of benefits (covering aspects like diversity, growth opportunities, flexibility, collaboration, and salary), and 15 entries containing just a period (\".\"). The content typically includes HTML formatting tags like <p> and <strong> and appears to be bilingual, containing both Dutch and English text."
        },
        {
            "column_name": "profiel > aanbod > aanbodEnVoordelen > plainText",
            "value_counts_without_nan": {
                "-": 39,
                "Diversiteit: Projecten in sectoren zoals fintech, healthcare, retail en overheid. Groei: Opleidingsbudget voor certificeringen. Flexibiliteit: Hybride werken en keuze uit projecten die aansluiten bij jouw interesses. Part of the hive: Samenwerking met collega experts in cloud, security en data. Salaris: Competetief pakket met bonusregeling, afhankelijk van ervaring en inzet.": 20,
                ".": 15,
                "Wat mag je verwachten? Boeiende projecten bij gerenommeerde klanten, waar je echt het verschil kan maken Een cultuur waarin kennisdeling en continue groei centraal staan Opleidingsmogelijkheden afgestemd op jouw ambities en loopbaanpad Een dynamische omgeving met ruimte om door te groeien binnen een snelgroeiend bedrijf Veel autonomie, gecombineerd met de juiste ondersteuning wanneer je die nodig hebt Een competitief loonpakket, aangevuld met mooie extralegale voordelen Een uitgebreide hospitalisatie- en groepsverzekering Een stijlvolle bedrijfswagen waarmee je professioneel voor de dag komt": 14,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 33,
            "n": 1878,
            "p_distinct": 0.7723577235772358,
            "p_missing": 0.01757188498402556,
            "n_distinct": 1425,
            "description": "The column 'profiel > aanbod > aanbodEnVoordelen > plainText' appears to contain text descriptions of job benefits and offers in Dutch/Flemish. From the profiling data, it's a text field with 1,878 total entries, of which only 1.76% (33 entries) are missing. The column has a high degree of uniqueness with 1,425 distinct values (77.2% of all entries). Common standardized entries include \"-\" (39 occurrences) and \".\" (15 occurrences), while more detailed entries describe comprehensive benefit packages including aspects like project diversity, growth opportunities, flexible working conditions, competitive salary packages, training budgets, and company cars. The content appears to be primarily used to outline employee benefits and value propositions for job postings."
        },
        {
            "column_name": "profiel > aanbod > aanbodEnVoordelen > markdown",
            "value_counts_without_nan": {
                "\\-": 39,
                "**Diversiteit:** Projecten in sectoren zoals fintech, healthcare, retail en overheid.\n\n**Groei:** Opleidingsbudget voor certificeringen.\n\n**Flexibiliteit:** Hybride werken en keuze uit projecten die aansluiten bij jouw interesses.\n\n**Part of the hive:** Samenwerking met collega experts in cloud, security en data.\n\n**Salaris:** Competetief pakket met bonusregeling, afhankelijk van ervaring en inzet.": 20,
                ".": 15,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 33,
            "n": 1878,
            "p_distinct": 0.8010840108401084,
            "p_missing": 0.01757188498402556,
            "n_distinct": 1478,
            "description": "The column 'profiel > aanbod > aanbodEnVoordelen > markdown' contains text descriptions of job offers and benefits in Markdown format. Based on the profiling data, it appears in 1,878 records with only 1.76% missing values. The column has high variability with 1,478 unique values (80.1% distinct), suggesting that most job postings have customized benefit descriptions. Common patterns include simple punctuation marks like \"-\" (39 occurrences) and \".\" (15 occurrences), while more detailed entries describe comprehensive benefit packages including information about project diversity, growth opportunities, flexibility, team collaboration, and salary packages. The format appears to support structured Markdown text with features like bold text formatting (**) for emphasis on key benefit categories."
        },
        {
            "column_name": "profiel > vereisteKwalificaties > html",
            "value_counts_without_nan": {
                "-": 14,
                ".": 14,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 31,
            "n": 1878,
            "p_distinct": 0.881429344883595,
            "p_missing": 0.01650692225772098,
            "n_distinct": 1628,
            "description": "The column 'profiel > vereisteKwalificaties > html' appears to contain HTML-formatted text describing required qualifications for job positions. It is a text field with 1,878 total entries, of which 31 (1.65%) are missing values. The column shows high variability with 1,628 unique values, representing about 88.1% of all non-null entries. Some standardized values appear multiple times, with both \"-\" and \".\" occurring 14 times each. The high number of distinct values suggests that most qualification requirements are uniquely written for each job posting, rather than using standardized templates."
        },
        {
            "column_name": "profiel > vereisteKwalificaties > plainText",
            "value_counts_without_nan": {
                "-": 14,
                ".": 14,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 31,
            "n": 1878,
            "p_distinct": 0.8094206821873308,
            "p_missing": 0.01650692225772098,
            "n_distinct": 1495,
            "description": "The column 'profiel > vereisteKwalificaties > plainText' appears to contain text descriptions of required qualifications for job positions. It has 1,878 total entries with a relatively high number of unique values (1,495 distinct entries, representing about 81% of all values), suggesting that qualification requirements vary significantly across job postings. The column has only 31 missing values (approximately 1.7% of entries), indicating good data completeness. Some standardized entries appear multiple times, with both \"-\" and \".\" occurring 14 times each, possibly serving as placeholders or indicating no specific qualifications. The high proportion of unique entries suggests that employers typically provide customized, detailed qualification requirements for each position."
        },
        {
            "column_name": "profiel > vereisteKwalificaties > markdown",
            "value_counts_without_nan": {
                ".": 14,
                "\\-": 14,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 31,
            "n": 1878,
            "p_distinct": 0.8332430969139144,
            "p_missing": 0.01650692225772098,
            "n_distinct": 1539,
            "description": "The column 'profiel > vereisteKwalificaties > markdown' is a text field containing required qualifications for job positions, with 1,878 total entries and 31 missing values (1.65% missing rate). It shows high variability in its content, with 1,539 unique values representing 83.3% of all entries. The most common values include \".\" and \"-\" which each appear 14 times, suggesting these might be used as placeholders or formatting elements. The high proportion of distinct values indicates that qualification requirements are typically unique or customized for each job posting rather than following standardized templates."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > code",
            "value_counts_without_nan": {
                "ONBEPAALD": 1670,
                "BEPAALD": 12
            },
            "type": "Categorical",
            "n_missing": 196,
            "n": 1878,
            "p_distinct": 0.0011890606420927466,
            "p_missing": 0.10436634717784878,
            "n_distinct": 2,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > code' is a categorical field that represents the type of employment contract being offered in job postings. It contains 1,878 total entries, with 196 missing values (10.44% of the data). The column has only two distinct values: \"ONBEPAALD\" (indefinite contract) which appears 1,670 times, and \"BEPAALD\" (fixed-term contract) which appears 12 times. The data shows a strong preference for indefinite contracts, with \"ONBEPAALD\" being the overwhelmingly dominant category representing about 99% of the non-missing values."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > label",
            "value_counts_without_nan": {
                "onbepaalde duur": 1670,
                "bepaalde duur": 12
            },
            "type": "Categorical",
            "n_missing": 196,
            "n": 1878,
            "p_distinct": 0.0011890606420927466,
            "p_missing": 0.10436634717784878,
            "n_distinct": 2,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > label' contains categorical data about contract types in employment agreements. Out of 1,878 total entries, there are only 2 distinct values: \"onbepaalde duur\" (indefinite duration) and \"bepaalde duur\" (fixed duration), with indefinite duration contracts being significantly more common (1,670 instances) compared to fixed duration contracts (12 instances). The column has 196 missing values (10.44% of the data). This suggests that the vast majority of job postings in the dataset offer permanent contracts rather than fixed-term positions."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > kortLabel",
            "value_counts_without_nan": {
                "onbepaalde duur": 1670,
                "bepaalde duur": 12
            },
            "type": "Categorical",
            "n_missing": 196,
            "n": 1878,
            "p_distinct": 0.0011890606420927466,
            "p_missing": 0.10436634717784878,
            "n_distinct": 2,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontract > kortLabel' contains categorical data about contract types, with 1,878 total entries. It has only two distinct values: \"onbepaalde duur\" (indefinite duration) which appears 1,670 times, and \"bepaalde duur\" (fixed duration) which appears 12 times. The column has 196 missing values (10.44% of the data). The overwhelming majority of contracts are of indefinite duration, representing about 89% of the non-missing values, while fixed-term contracts make up less than 1% of the valid entries."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > zoSpoedigMogelijkStarten",
            "value_counts_without_nan": {
                "false": 1069,
                "true": 809
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > zoSpoedigMogelijkStarten' is a boolean field that indicates whether a job position requires the candidate to start as soon as possible. The column has complete data with no missing values across all 1,878 records. It contains only two distinct values: \"false\" (1,069 instances) and \"true\" (809 instances), showing that approximately 43% of the job postings require immediate start, while 57% do not have this requirement. This appears to be a mandatory field in the dataset as there are no null values."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > arbeidscontractLijn",
            "value_counts_without_nan": {
                "onbepaalde duur": 1670,
                "bepaalde duur": 12
            },
            "type": "Categorical",
            "n_missing": 196,
            "n": 1878,
            "p_distinct": 0.0011890606420927466,
            "p_missing": 0.10436634717784878,
            "n_distinct": 2,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > arbeidscontractLijn' contains information about the type of employment contract duration. It is a categorical field with only two possible values: \"onbepaalde duur\" (indefinite duration) and \"bepaalde duur\" (fixed-term). Out of 1,878 total entries, 1,670 are indefinite duration contracts while only 12 are fixed-term contracts, showing a strong preference for indefinite duration contracts. The column has 196 missing values (10.44% of the data), and with just 2 distinct categories, it has a very low distinct proportion of 0.12%."
        },
        {
            "column_name": "profiel > beroepCompetenties",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'profiel > beroepCompetenties' appears to be a specialized field containing unsupported data types, suggesting it may contain complex or nested data structures. The column is completely populated with no missing values across all 1,878 records (0% missing). Given its name which translates from Dutch to \"professional competencies,\" it likely contains information about job-related skills or competencies required for the positions, though the specific format and structure of this data cannot be determined from the provided profiling information."
        },
        {
            "column_name": "profiel > persoonsGebondenCompetenties",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'profiel > persoonsGebondenCompetenties' appears to be a specialized field that contains person-bound or personal competencies data. While present in all 1,878 records (no missing values), it is marked as an \"Unsupported\" type, which suggests it likely contains complex or nested data structures that couldn't be directly analyzed by the profiling tool. This could indicate that the data is stored in a format like arrays, objects, or specialized data structures that require specific handling to process."
        },
        {
            "column_name": "profiel > studies",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'profiel > studies' appears to be an unsupported data type in the dataset, containing 1,878 entries with no missing values (0% missing). Given its name structure with \"profiel > studies\" and the fact it's marked as unsupported, it likely contains complex or nested data about educational requirements or study qualifications for job positions, but the exact structure and content cannot be determined from the provided profiling data alone."
        },
        {
            "column_name": "profiel > studiesGelijkwaardigDoorErvaring",
            "value_counts_without_nan": {
                "false": 1359,
                "true": 519
            },
            "type": "Boolean",
            "n_missing": 0,
            "n": 1878,
            "p_distinct": 0.0010649627263045794,
            "p_missing": 0.0,
            "n_distinct": 2,
            "description": "The column 'profiel > studiesGelijkwaardigDoorErvaring' is a boolean field that indicates whether equivalent experience can substitute for formal educational requirements in a job posting. Out of 1,878 total entries, there are no missing values, and the data is split between 1,359 entries marked as \"false\" (72.4%) and 519 entries marked as \"true\" (27.6%). This suggests that in roughly a quarter of the job postings, employers are willing to consider practical experience as an alternative to formal educational qualifications."
        },
        {
            "column_name": "profiel > rijbewijzen",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'profiel > rijbewijzen' appears to be an unsupported data type in the dataset, containing 1,878 entries with no missing values. Based on the column name (which appears to be Dutch and translates to \"profile > driving licenses\" in English), this column likely contains information about required driving licenses for the job positions, but the exact format or structure of this data cannot be determined from the provided profiling information alone."
        },
        {
            "column_name": "profiel > jobdomeinen",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "Based on the provided profiling data, the column 'profiel > jobdomeinen' appears to be present in all 1,878 records with no missing values (n_missing: 0, p_missing: 0.0). The column is marked as having an \"Unsupported\" type, which suggests it likely contains complex or nested data structures that couldn't be analyzed using standard statistical methods. Given its name \"jobdomeinen\" (job domains in Dutch) and its location within the \"profiel\" (profile) hierarchy, this column probably contains information about the professional fields or job sectors relevant to each job posting."
        },
        {
            "column_name": "profiel > attesten",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'profiel > attesten' appears to be an unsupported data type in the dataset, containing 1,878 entries with no missing values (0% missing). Based on the column name structure and the Dutch language context (\"attesten\" meaning \"certificates\" or \"attestations\"), this column likely contains information about required certificates or qualifications for the job positions, but its exact data structure cannot be determined from the provided profiling information due to its unsupported type classification."
        },
        {
            "column_name": "profiel > talenKennis",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'profiel > talenKennis' appears to contain language proficiency requirements for job postings. It is present in all 1,878 records with no missing values (0% missing). The column is marked as an \"Unsupported\" type, which suggests it likely contains complex data structures (possibly nested objects or arrays) that detail language requirements, though the specific format and structure cannot be determined from the provided profiling data alone."
        },
        {
            "column_name": "profiel > vakbewkaamheidsattesten",
            "type": "Unsupported",
            "n_missing": 0,
            "n": 1878,
            "p_missing": 0.0,
            "description": "The column 'profiel > vakbewkaamheidsattesten' appears to be a specialized field containing unsupported data types, suggesting it may contain complex or structured data related to professional certifications or competency attestations. While the column is consistently populated with no missing values across all 1,878 records (0% missing rate), its exact format and contents cannot be directly analyzed through conventional statistical methods due to its unsupported data type classification."
        },
        {
            "column_name": "profiel > c2BeroepsCompetentieProfielTitel",
            "value_counts_without_nan": {
                "Software ontwikkelaar": 263,
                "Support medewerker ICT": 138,
                "Systeembeheerder": 119,
                "Integratie expert ICT": 101,
                "Data engineer": 90,
                "Expert productieproces en -methodes": 81,
                "Data scientist": 65,
                "Verantwoordelijke kwaliteitscontrole": 45,
                "Productieplanner": 45,
                "Data manager": 42,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 5,
            "n": 1878,
            "p_distinct": 0.08222103577148959,
            "p_missing": 0.0026624068157614484,
            "n_distinct": 154,
            "description": "The column 'profiel > c2BeroepsCompetentieProfielTitel' appears to contain job profile or professional competency titles, with a strong focus on IT and production-related roles. From the 1,878 total entries, only 0.27% (5 entries) are missing values, and there are 154 unique titles (8.22% distinct values). The most common roles are technology-focused, with \"Software ontwikkelaar\" (Software developer) appearing 263 times, followed by \"Support medewerker ICT\" (ICT Support staff) with 138 occurrences, and \"Systeembeheerder\" (System administrator) with 119 occurrences. Other frequent titles include data-related roles (Data engineer, Data scientist, Data manager) and production management positions, suggesting this column represents standardized job profile titles used for classification purposes in what appears to be a Dutch or Flemish job posting system."
        },
        {
            "column_name": "externeReferentie",
            "value_counts_without_nan": {
                "YI": 3,
                "BD": 3,
                "Lily": 2,
                "JS": 2,
                "338830": 2,
                "11154": 2,
                "10687019": 1,
                "HK.1811678-VDAB-BE-120812": 1,
                "10718641": 1,
                "339050": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 364,
            "n": 1878,
            "p_distinct": 0.9947159841479525,
            "p_missing": 0.19382321618743345,
            "n_distinct": 1506,
            "description": "The 'externeReferentie' column appears to be a text field containing external reference codes or identifiers, with significant variety in its format. Out of 1,878 total entries, approximately 19.4% (364) are missing values, and there are 1,506 unique values, indicating very high cardinality with about 99.5% of the non-null values being distinct. The most frequent values appear to be simple codes like \"YI\" and \"BD\" (occurring 3 times each), followed by \"Lily\" and \"JS\" (2 times each), and various numeric and alphanumeric identifiers. The highly unique nature of these values suggests this column likely serves as an external reference or tracking number, possibly used to link job postings to external systems or employer databases."
        },
        {
            "column_name": "profiel > opdrachtgever > tonenOpdrachtgever",
            "value_counts_without_nan": {
                "false": 978,
                "true": 531
            },
            "type": "Boolean",
            "n_missing": 369,
            "n": 1878,
            "p_distinct": 0.0013253810470510272,
            "p_missing": 0.1964856230031949,
            "n_distinct": 2,
            "description": "The column 'profiel > opdrachtgever > tonenOpdrachtgever' is a boolean field that indicates whether the client/employer information should be displayed or not. Out of 1,878 total entries, 978 are set to \"false\" and 531 are set to \"true\", while 369 entries (approximately 19.6%) have missing values. This appears to be a display preference setting where \"false\" is the more common choice, suggesting that in most cases, the client/employer information is not meant to be shown publicly."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente",
            "value_counts_without_nan": {
                "ANTWERPEN": 123,
                "ROESELARE": 42,
                "BRUSSEL": 41,
                "SINT-GILLIS": 32,
                "DIEGEM": 21,
                "SINT-LAMBRECHTS-WOLUWE": 19,
                "ZAVENTEM": 16,
                "ELSENE": 13,
                "OUDERGEM": 13,
                "MEERHOUT": 12,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1359,
            "n": 1878,
            "p_distinct": 0.1599229287090559,
            "p_missing": 0.7236421725239617,
            "n_distinct": 83,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > gemeente' contains municipality/city names in Belgium, with a high proportion of missing values (72.4%). Out of 1,878 total entries, only 519 have valid values, with 83 unique municipalities represented. Antwerp is the most frequently occurring municipality (123 entries), followed by Roeselare (42) and Brussels (41). The data appears to be focused on major Belgian cities and municipalities, particularly in the Flanders and Brussels regions. The column uses uppercase text format for all municipality names, and while it contains a moderate level of distinct values (16% of non-null entries are unique), there is a clear concentration in certain major urban areas."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode",
            "value_counts_without_nan": {
                "2000": 96,
                "8800": 42,
                "1000": 41,
                "1060": 32,
                "2018": 23,
                "1831": 21,
                "1200": 19,
                "1930": 16,
                "1160": 13,
                "1050": 13,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1359,
            "n": 1878,
            "p_distinct": 0.16570327552986513,
            "p_missing": 0.7236421725239617,
            "n_distinct": 86,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postcode' contains Belgian postal codes, with only about 28% of the 1,878 records having a value (1,359 missing entries). There are 86 unique postal codes in the dataset, representing different municipalities across Belgium. The most frequently occurring postal code is \"2000\" (Antwerp) with 96 occurrences, followed by \"8800\" (Roeselare) with 42 occurrences and \"1000\" (Brussels) with 41 occurrences. The data is stored as text format, and the relatively high number of distinct values (16.6% of non-missing values are unique) suggests a good geographical distribution of locations across different Belgian municipalities."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus",
            "value_counts_without_nan": {
                "": 89,
                "Frankrijklei 101": 49,
                "Houtskoolstraat 17": 33,
                "Fonsnylaan 20": 27,
                "Frankrijklei 156": 15,
                "Lange Klarenstraat 19": 15,
                "Avenue des Communautés 110": 14,
                "Solvynsstraat 49": 12,
                "Havenlaan 88": 12,
                "Lil 24": 12,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1359,
            "n": 1878,
            "p_distinct": 0.21772639691714837,
            "p_missing": 0.7236421725239617,
            "n_distinct": 113,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straatNummerPostbus' contains street addresses with house numbers for physical locations. It has a high missing data rate (72.4%) with only 519 non-null values out of 1,878 total entries. Among the non-missing values, there are 113 unique addresses (21.8% distinct values), with the most common being an empty string (89 occurrences), followed by \"Frankrijklei 101\" (49 occurrences) and \"Houtskoolstraat 17\" (33 occurrences). The addresses appear to be primarily Belgian locations, written in both Dutch and French."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn",
            "value_counts_without_nan": {
                "Frankrijklei 101 2000 ANTWERPEN": 49,
                "Houtskoolstraat 17 8800 ROESELARE": 33,
                "Fonsnylaan 20 1060 SINT-GILLIS": 27,
                "1000 BRUSSEL": 17,
                "Frankrijklei 156 2000 ANTWERPEN": 15,
                "Lange Klarenstraat 19 2000 ANTWERPEN": 15,
                "Avenue des Communautés 110 1200 SINT-LAMBRECHTS-WOLUWE": 14,
                "Havenlaan 88 1000 BRUSSEL": 12,
                "Lil 24 2450 MEERHOUT": 12,
                "Solvynsstraat 49 2018 ANTWERPEN": 12,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1359,
            "n": 1878,
            "p_distinct": 0.3063583815028902,
            "p_missing": 0.7236421725239617,
            "n_distinct": 159,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > lijn' appears to contain structured address information for physical locations in Belgium, primarily consisting of street addresses with postal codes and municipalities. Out of 1,878 total entries, approximately 72.4% of the values are missing, and there are 159 unique address combinations (30.6% distinct values). The most frequently occurring addresses are located in major Belgian cities like Antwerp (\"Frankrijklei 101 2000 ANTWERPEN\" appearing 49 times), Roeselare, and Brussels. The data format consistently follows a pattern of street name, house number, postal code, and municipality name, suggesting this is a standardized address line field used for employer/client contact information."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > code",
            "value_counts_without_nan": {
                "BE": 517,
                "NL": 2
            },
            "type": "Categorical",
            "n_missing": 1359,
            "n": 1878,
            "p_distinct": 0.0038535645472061657,
            "p_missing": 0.7236421725239617,
            "n_distinct": 2,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > code' contains country codes, with only two unique values: \"BE\" (Belgium) and \"NL\" (Netherlands). It has a high missing rate of approximately 72.4% (1,359 missing values out of 1,878 total entries). Among the 519 non-missing values, the vast majority (517) are \"BE\" while only 2 entries are \"NL\", indicating this dataset predominantly contains Belgian locations. The column is categorical in nature with a very low distinct value proportion of about 0.4%."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > label",
            "value_counts_without_nan": {
                "België": 517,
                "Nederland": 2
            },
            "type": "Categorical",
            "n_missing": 1359,
            "n": 1878,
            "p_distinct": 0.0038535645472061657,
            "p_missing": 0.7236421725239617,
            "n_distinct": 2,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > label' contains country labels for physical locations, with a high proportion of missing values (72.4%). Out of 1,878 total entries, only 519 have values, predominantly showing \"België\" (517 entries) with a small number showing \"Nederland\" (2 entries). This categorical column has just 2 distinct values, making it a very low-cardinality field that primarily identifies Belgian locations when populated."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > kortLabel",
            "value_counts_without_nan": {
                "België": 517,
                "Nederland": 2
            },
            "type": "Categorical",
            "n_missing": 1359,
            "n": 1878,
            "p_distinct": 0.0038535645472061657,
            "p_missing": 0.7236421725239617,
            "n_distinct": 2,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > land > kortLabel' contains abbreviated country labels for the physical location of the client's contact method. It is a categorical field with only 2 unique values: \"België\" (517 occurrences) and \"Nederland\" (2 occurrences). Notably, this column has a high percentage of missing values (72.4%), with 1,359 out of 1,878 entries being null. When data is present, it overwhelmingly refers to Belgium, suggesting this dataset primarily deals with Belgian job postings or employers."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > naam",
            "value_counts_without_nan": {
                "Smals": 33,
                "Kingfisher IT": 19,
                "MICHAEL PAGE INTERNATIONAL (BELGIUM)": 18,
                "ICT Gent": 18,
                "Madison Recruitment": 15,
                "VIVALDIS - HK": 14,
                "Experis Belgium": 14,
                "BIZZTALENT": 13,
                "Start People": 12,
                "CLOVR": 12,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1350,
            "n": 1878,
            "p_distinct": 0.2708333333333333,
            "p_missing": 0.7188498402555911,
            "n_distinct": 143,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > naam' appears to contain the physical location names or business names of employers or recruiting agencies. Out of 1,878 total entries, this field is largely empty with 71.9% missing values (1,350 entries). Where data is present, there are 143 unique values, with the most frequent being \"Smals\" (33 occurrences), \"Kingfisher IT\" (19 occurrences), and \"MICHAEL PAGE INTERNATIONAL (BELGIUM)\" (18 occurrences). The data suggests this column primarily lists recruitment agencies and companies' physical location names, with a relatively high diversity of values (27.1% distinct entries among non-missing values), indicating a wide variety of different organizations posting job listings."
        },
        {
            "column_name": "profiel > opdrachtgever > naam",
            "value_counts_without_nan": {
                "Smals": 33,
                "Kingfisher IT": 19,
                "MICHAEL PAGE INTERNATIONAL (BELGIUM)": 18,
                "ICT Gent": 18,
                "Madison Recruitment": 15,
                "VIVALDIS - HK": 14,
                "Experis Belgium": 14,
                "BIZZTALENT": 13,
                "Start People": 12,
                "CLOVR": 12,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1350,
            "n": 1878,
            "p_distinct": 0.2708333333333333,
            "p_missing": 0.7188498402555911,
            "n_distinct": 143,
            "description": "The column 'profiel > opdrachtgever > naam' contains employer or client organization names in text format. Out of 1,878 total entries, this field is predominantly empty with 1,350 missing values (71.9% missing rate). Among the populated entries, there are 143 unique employer names (27.1% distinct values), suggesting a moderate level of diversity in the organizations listed. The most frequent employers include Smals (33 entries), Kingfisher IT (19 entries), and MICHAEL PAGE INTERNATIONAL (BELGIUM) (18 entries), indicating that the data likely represents job postings from various recruiting agencies and direct employers, with a notable concentration among certain major organizations."
        },
        {
            "column_name": "profiel > opdrachtgever > ondernemingsnummer",
            "value_counts_without_nan": {
                "": 35,
                "0455332351": 33,
                "0406798006": 33,
                "0402724895": 32,
                "0473647436": 24,
                "0477750635": 24,
                "0728770304": 21,
                "0666740287": 15,
                "0443052646": 15,
                "0843195858": 13,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1347,
            "n": 1878,
            "p_distinct": 0.20903954802259886,
            "p_missing": 0.7172523961661342,
            "n_distinct": 111,
            "description": "The column 'profiel > opdrachtgever > ondernemingsnummer' appears to contain Belgian company registration numbers (ondernemingsnummer/numéro d'entreprise), which are unique identifiers for businesses in Belgium. Out of 1,878 total entries, this field is predominantly empty with 1,347 missing values (71.7% of the data). Where values are present, they consist of 10-digit numeric codes like \"0455332351\" and \"0406798006\". The column has 111 distinct values, representing about 20.9% of all entries, suggesting that multiple job listings are associated with the same companies. The most frequent values appear multiple times, with some companies having 20-35 job listings each, while many others appear less frequently."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus",
            "value_counts_without_nan": {
                "2": 181,
                "101": 64,
                "60": 52,
                "B3": 45,
                "A": 27,
                "01": 27,
                "B": 26,
                "1": 25,
                "6": 17,
                "7": 14,
                "3.1": 12,
                "001": 10,
                "2a": 8,
                "3": 5,
                "ARC": 5,
                "bus 2": 5,
                "205": 4,
                "4": 3,
                "82": 3,
                "16": 3,
                "13": 3,
                "8": 3,
                "5": 3,
                "UNIT 11": 2,
                "a": 2,
                "31": 2,
                "0401": 2,
                "301": 2,
                "0": 1,
                "b2": 1,
                "1a": 1,
                "45": 1,
                "152": 1,
                "495": 1,
                "GN": 1,
                "43": 1,
                "3000": 1,
                "21": 1,
                "4.0": 1,
                "B2": 1,
                "2.0": 1,
                "D": 1,
                "GLV": 1,
                "20": 1,
                "18": 1,
                "73": 1,
                "1.1": 1,
                "104": 1,
                "102": 1,
                "009": 1
            },
            "type": "Categorical",
            "n_missing": 1301,
            "n": 1878,
            "p_distinct": 0.08665511265164645,
            "p_missing": 0.6927582534611288,
            "n_distinct": 50,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus' appears to contain mailbox or post box numbers for physical business locations. This is a categorical field with a high missing rate (69.3% of values are missing) across the 1,878 records. Of the populated values, there are 50 distinct entries, with \"2\" being the most common (181 occurrences), followed by \"101\" (64 occurrences) and \"60\" (52 occurrences). The values appear to be a mix of numeric and alphanumeric identifiers, ranging from simple numbers like \"0\" to more complex designations like \"UNIT 11\" or \"GLV\", suggesting various formats for post box identification in business addresses."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer",
            "value_counts_without_nan": {
                "101": 51,
                "17": 41,
                "20": 29,
                "110": 19,
                "49": 19,
                "24": 16,
                "156": 15,
                "19": 15,
                "5": 15,
                "88": 12,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1451,
            "n": 1878,
            "p_distinct": 0.17330210772833723,
            "p_missing": 0.7726304579339723,
            "n_distinct": 74,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > nummer' appears to contain street numbers or building numbers for physical locations. It is sparsely populated, with 77.3% of values being missing (1,451 out of 1,878 total entries). Where data exists, there are 74 unique values, with the most common numbers being \"101\" (51 occurrences), \"17\" (41 occurrences), and \"20\" (29 occurrences). The data is stored as text type, suggesting it can handle both numeric and potentially alphanumeric building numbers, though the most frequent values shown are purely numeric."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straat",
            "value_counts_without_nan": {
                "Frankrijklei": 65,
                "Houtskoolstraat": 33,
                "Fonsnylaan": 27,
                "Havenlaan": 20,
                "Lange Klarenstraat": 15,
                "Avenue des Communautés": 14,
                "Lil": 12,
                "Solvynsstraat": 12,
                "Primary Triomflaan": 10,
                "Culliganlaan": 9,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1448,
            "n": 1878,
            "p_distinct": 0.24186046511627907,
            "p_missing": 0.7710330138445154,
            "n_distinct": 104,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > straat' contains street names for physical locations, but has a high missing data rate of 77.1%. Out of 1,878 total entries, only 430 have street information, with 104 unique street names appearing in the dataset. The most frequently occurring street names are Frankrijklei (65 occurrences), Houtskoolstraat (33 occurrences), and Fonsnylaan (27 occurrences). This appears to be a text field primarily containing Belgian street names, given the mixture of Dutch and French language street nomenclature."
        },
        {
            "column_name": "leverancier > organisatie > erkenningsnummer",
            "value_counts_without_nan": {
                "VG. 2233/UC": 83,
                "VG 2406/U": 64,
                "VG.565/BO\r\n00217-405-20121108\r\nW.RS.153\r\nW.SO.153\r\nW.RE.153\r\n": 35,
                "VG.1038/BU - BHG: 00298-406-20121129 - BHG: 00298-405-20121129 - W.INT.279": 26,
                " VG 158/BUC": 20,
                "\r\nActief Interim: V.G.20/BUP -W.INT.033-BXL\r\nActief Construct : V.G. 806/BC - W.INTC.002-BXL B-AA04.019\r\nActief NV: 01018": 19,
                "VG/609/U/BUOSA 54-406 54-405 W.INT.511": 19,
                "VG.607/BUO\r\n0072-405-20121019\r\n0072-406-20121019\r\nW.RS.197\r\nW.INT.197\r\nW.SO.197": 15,
                "Vlaanderen VG .631/BUOP, Brussel Bruxelles 00254-406-20121120/00254-405-20121120, Wallonie W.RS.001/W.INT.001 ": 14,
                "Erkenningsnummer: : Vlaams gewest/Région Flamande: VG.153/BUOSAP - Brussel/Bruxelles:B.00202-406-20121106 - B.00202-405-20121106 - Waals gewest/Région Wallonne: W.INT.021 - W.RS.021 - W.RE.021 - W.SO.021": 14,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1433,
            "n": 1878,
            "p_distinct": 0.11685393258426967,
            "p_missing": 0.7630457933972311,
            "n_distinct": 52,
            "description": "The column 'leverancier > organisatie > erkenningsnummer' appears to contain official recognition or license numbers for organizations, likely in the Belgian employment sector. This field is predominantly empty, with 76.3% of the 1,878 entries being missing values. When present, the numbers follow various standardized formats that often include regional prefixes like \"VG\" (likely referring to Vlaams Gewest/Flemish Region), \"BHG\" (Brussels), and \"W\" (Wallonia), followed by numerical identifiers and additional classification codes. The most common number format is \"VG. 2233/UC\" appearing 83 times, followed by \"VG 2406/U\" with 64 occurrences. The data shows relatively low diversity with only about 11.7% of entries being unique values, suggesting a standardized system of recognition numbers used across different organizations."
        },
        {
            "column_name": "profiel > sollicitatieInfo > cvGewenst",
            "value_counts_without_nan": {
                "true": 239,
                "false": 3
            },
            "type": "Boolean",
            "n_missing": 1636,
            "n": 1878,
            "p_distinct": 0.008264462809917356,
            "p_missing": 0.8711395101171459,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > cvGewenst' is a boolean field that indicates whether a CV is required for the job application. Out of 1,878 total entries, only 242 have a specified value, with a high missing data rate of 87.1% (1,636 missing values). Among the non-missing values, the vast majority (239) are marked as \"true\" indicating that a CV is required, while only 3 entries are marked as \"false.\" This suggests that when this field is explicitly specified, employers overwhelmingly require candidates to submit a CV with their application."
        },
        {
            "column_name": "profiel > aanbod > minimumBrutoloon",
            "min": 0.0,
            "value_counts_without_nan": {
                "3000.0": 93,
                "3500.0": 64,
                "2500.0": 53,
                "4000.0": 44,
                "2800.0": 22,
                "5000.0": 14,
                "3800.0": 12,
                "3600.0": 11,
                "4500.0": 10,
                "2350.0": 10,
                "more ...": -1
            },
            "type": "Numeric",
            "n_missing": 1463,
            "n": 1878,
            "max": 493620.0,
            "p_distinct": 0.10602409638554217,
            "std": 34011.338492072304,
            "p_missing": 0.7790202342917998,
            "n_distinct": 44,
            "mean": 5598.722602409638,
            "description": "The column 'profiel > aanbod > minimumBrutoloon' represents the minimum gross salary offered for job positions, with values in what appears to be euros. This column has significant missing data, with 77.9% of the 1,878 entries being empty. Among the populated entries, there are 44 distinct salary values, with the most common being €3,000 (93 occurrences), followed by €3,500 (64 occurrences) and €2,500 (53 occurrences). While the average minimum gross salary is €5,598.72, this is skewed by some extreme values, as evidenced by the maximum value of €493,620 and the large standard deviation of €34,011.34. The minimum value recorded is €0, which might represent unpaid positions or data entry errors."
        },
        {
            "column_name": "profiel > aanbod > maximumBrutoloon",
            "min": 0.0,
            "value_counts_without_nan": {
                "5000.0": 76,
                "4500.0": 68,
                "4000.0": 57,
                "6000.0": 33,
                "5500.0": 30,
                "3500.0": 25,
                "3800.0": 12,
                "4200.0": 12,
                "4800.0": 8,
                "5900.0": 7,
                "more ...": -1
            },
            "type": "Numeric",
            "n_missing": 1464,
            "n": 1878,
            "max": 658160.0,
            "p_distinct": 0.1280193236714976,
            "std": 42621.90631023222,
            "p_missing": 0.7795527156549521,
            "n_distinct": 53,
            "mean": 7594.147053140096,
            "description": "The column 'profiel > aanbod > maximumBrutoloon' represents the maximum gross salary offered for job positions, with values ranging from €0 to €658,160. Notably, this field is missing in about 78% of the records (1,464 out of 1,878 entries). Where data is present, the average maximum gross salary is approximately €7,594, with a high standard deviation of €42,622 indicating significant variation in salary ranges. The most common maximum salary offerings are clustered around €4,000-€5,000, with €5,000 being the most frequent value (76 occurrences), followed by €4,500 (68 occurrences) and €4,000 (57 occurrences). There are 53 distinct salary values in total, representing about 13% of all non-null entries."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > beginDatum",
            "min": "2024-06-11 00:00:00",
            "value_counts_without_nan": {
                "2025-09-01 00:00:00": 8,
                "2025-08-08 00:00:00": 7,
                "2025-07-09 00:00:00": 6,
                "2025-08-29 00:00:00": 6,
                "2025-07-17 00:00:00": 5,
                "2025-07-02 00:00:00": 5,
                "2025-06-19 00:00:00": 5,
                "2025-08-14 00:00:00": 5,
                "2025-08-26 00:00:00": 4,
                "2025-07-11 00:00:00": 4,
                "more ...": -1
            },
            "type": "DateTime",
            "n_missing": 1737,
            "n": 1878,
            "max": "2025-10-15 00:00:00",
            "p_distinct": 0.425531914893617,
            "p_missing": 0.9249201277955271,
            "n_distinct": 60,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > beginDatum' contains proposed start dates for employment contracts, stored as DateTime values. The data spans from June 11, 2024, to October 15, 2025, with only 141 non-null values out of 1,878 total records (92.5% missing data). Among the available dates, there are 60 unique values, representing about 42.6% of the non-null entries. The most frequently occurring start date is September 1, 2025 (8 occurrences), followed by August 8, 2025 (7 occurrences), suggesting some clustering around the late summer period of 2025 for job start dates."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > onGestructureerdAdres > lijnen",
            "type": "Unsupported",
            "n_missing": 1741,
            "n": 1878,
            "p_missing": 0.9270500532481363,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > onGestructureerdAdres > lijnen' appears to be a rarely populated field in the dataset, with 92.7% of its values (1,741 out of 1,878 records) being missing. The column type is marked as \"Unsupported,\" suggesting it may contain complex or non-standard data structures. Given its nested path structure and name (\"lijnen\" meaning \"lines\" in Dutch), it likely contains unstructured address information for business locations, but its sparse population indicates it's not a primary method for storing address data in this dataset."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > email",
            "value_counts_without_nan": {
                "it@lga.jobs": 108,
                "engineering@lga.jobs": 32,
                "selectiesvlaanderenconnect@vlaanderen.be": 29,
                "supply@lga.jobs": 27,
                "legal@legrand-associates.com": 21,
                "outsourcing@bizztalent.be": 13,
                "roel@kingfisher-it.be": 10,
                "michael@kingfisher-it.be": 10,
                "els@oxida.be": 10,
                "jobs@newpointprofessionals.be": 9,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1265,
            "n": 1878,
            "p_distinct": 0.37846655791190864,
            "p_missing": 0.6735889243876464,
            "n_distinct": 232,
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > email' contains email addresses used for job application purposes. Out of 1,878 total entries, approximately 67.4% (1,265) are missing values, indicating that this field is often left empty. There are 232 unique email addresses in the dataset, with some addresses appearing multiple times. The most frequently used email address is \"it@lga.jobs\" (108 occurrences), followed by \"engineering@lga.jobs\" (32 occurrences) and \"selectiesvlaanderenconnect@vlaanderen.be\" (29 occurrences). The pattern of email addresses suggests they belong to recruitment agencies, IT companies, and government organizations handling job applications."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > telefoon",
            "value_counts_without_nan": {
                "+32 3 300 27 61": 48,
                "+32 51 49 51 01": 33,
                "+32 3 300 27 60": 21,
                "+32 51 49 51 00": 20,
                "+32 9 352 00 29": 20,
                "+32 9 395 32 01": 20,
                "+32486630134": 15,
                "093520104": 13,
                "+32 471 50 78 51": 12,
                "+32 470 69 52 00": 10,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1267,
            "n": 1878,
            "p_distinct": 0.31260229132569556,
            "p_missing": 0.674653887113951,
            "n_distinct": 191,
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > telefoon' contains phone numbers for job application contact purposes, primarily in Belgian format (starting with +32). Out of 1,878 total entries, approximately 67.5% (1,267) are missing values, and there are 191 unique phone numbers in use. The most frequently occurring number appears 48 times (+32 3 300 27 61), followed by other Belgian landline and mobile numbers. The format varies between standardized international format (with +32 prefix and spaces) and more compact representations (without spaces or international prefix), suggesting some inconsistency in how phone numbers are entered into the system."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > onGestructureerdAdres > lijnen",
            "type": "Unsupported",
            "n_missing": 1854,
            "n": 1878,
            "p_missing": 0.987220447284345,
            "description": "The column 'profiel > sollicitatieInfo > adres > onGestructureerdAdres > lijnen' appears to be an unsupported data type column that contains unstructured address line information related to job application contact details. The column is notably sparse, with 1,854 missing values out of 1,878 total records (98.72% missing data). With only about 1.28% of entries containing data, this suggests the column is rarely used in the dataset, with structured address fields likely being preferred for storing address information."
        },
        {
            "column_name": "bijlage",
            "value_counts_without_nan": {
                "Vacature coördinator De Ouders.pdf": 2,
                "VC_vacature_PO_2025_DFB.pdf": 1,
                "Vacature project engineer.pdf": 1,
                "Data projectleider.pdf": 1,
                "20250822 Vacature System Engineer.pdf": 1,
                "Advert ITS Technician.pdf": 1,
                "Customer Success Manager CIOC Energy.pdf": 1,
                "Functioneel Analist Expert Loketplatform.pdf": 1,
                "Vacature_process-engineer.pdf": 1,
                "Vacature - Data Scientist Expert.pdf": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1803,
            "n": 1878,
            "p_distinct": 0.9866666666666667,
            "p_missing": 0.9600638977635783,
            "n_distinct": 74,
            "description": "The 'bijlage' (attachment) column contains file names of PDF documents that appear to be detailed job vacancy descriptions or job postings. This column is sparsely populated, with only about 4% of the records containing values (75 entries out of 1,878 total records). When present, the values are almost entirely unique (98.7% distinct values), typically consisting of PDF files with descriptive names relating to specific job positions such as coordinators, engineers, technicians, and analysts. The file names are predominantly in Dutch and English, suggesting a bilingual or international context for these job postings."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postbus",
            "value_counts_without_nan": {
                "60": 46,
                "A": 9,
                "2": 4,
                "5": 3,
                "B": 3,
                "13": 3,
                "301": 2,
                "31": 2,
                "a": 2,
                "UNI": 1,
                "0021": 1,
                "288": 1,
                "WEVELGEM": 1,
                "3": 1,
                "0.10": 1,
                "43": 1,
                "3000": 1,
                "UNIT 11": 1,
                "Roeselare": 1,
                "18": 1,
                "73": 1,
                "1": 1,
                "1.1": 1,
                "104": 1,
                "009": 1
            },
            "type": "Categorical",
            "n_missing": 1788,
            "n": 1878,
            "p_distinct": 0.2777777777777778,
            "p_missing": 0.952076677316294,
            "n_distinct": 25,
            "description": "The column 'profiel > tewerkstellingsLocatie > bedrijfsLocatie > gestructureerdAdres > postbus' appears to be a categorical field containing post box numbers or unit identifiers for business locations. It is very sparsely populated, with 95.2% of the values (1,788 out of 1,878 records) being missing. Among the non-missing values, there are 25 distinct entries, with \"60\" being the most common (46 occurrences), followed by \"A\" (9 occurrences). The values range from simple numeric post box numbers (like \"2\", \"5\", \"13\") to alphanumeric identifiers (like \"UNI\", \"UNIT 11\") and occasionally location names (like \"WEVELGEM\", \"Roeselare\"). The high missing rate suggests this field is optional and only used when a post box is specifically part of the business address."
        },
        {
            "column_name": "profiel > sollicitatieInfo > adres > gestructureerdAdres > postbus",
            "value_counts_without_nan": {
                "60": 50,
                "B": 22,
                "1": 19,
                "0401": 13,
                "7": 9,
                "A": 8,
                "2": 7,
                "2a": 6,
                "bus 2": 5,
                "5": 4,
                "31": 4,
                "13": 3,
                "3": 3,
                "a": 2,
                "6": 2,
                "16": 2,
                "UNI": 2,
                "301": 2,
                "1A": 1,
                "4.0": 1,
                "45": 1,
                "3000": 1,
                "43": 1,
                "21": 1,
                "18": 1,
                "73": 1,
                "1.1": 1,
                "104": 1,
                "009": 1
            },
            "type": "Categorical",
            "n_missing": 1704,
            "n": 1878,
            "p_distinct": 0.16666666666666666,
            "p_missing": 0.9073482428115016,
            "n_distinct": 29,
            "description": "The column 'profiel > sollicitatieInfo > adres > gestructureerdAdres > postbus' appears to contain mailbox or post box numbers for job application addresses. This field is sparsely populated, with 90.7% of the 1,878 entries being missing values. When present, the data consists of various mailbox identifiers ranging from simple numeric values (like \"1\", \"2\", \"60\") to alphanumeric combinations (like \"2a\", \"1A\") and formatted numbers (like \"0401\", \"3000\"). The most common value is \"60\", appearing 50 times, followed by \"B\" occurring 22 times. Despite having only 174 non-missing values, the field shows considerable variety with 29 distinct values, suggesting that while rarely used, this field captures diverse mailbox identification formats."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > code",
            "value_counts_without_nan": {
                "MVR": 154,
                "DHR": 66
            },
            "type": "Categorical",
            "n_missing": 1658,
            "n": 1878,
            "p_distinct": 0.00909090909090909,
            "p_missing": 0.8828541001064962,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > code' appears to contain gender title codes for contact persons, with only two possible values: \"MVR\" (likely meaning \"Mevrouw\" or \"Mrs.\") and \"DHR\" (likely meaning \"De Heer\" or \"Mr.\"). The column is sparsely populated, with 88.3% of the data (1,658 out of 1,878 entries) being missing values. Of the 220 non-missing entries, \"MVR\" appears 154 times and \"DHR\" appears 66 times, indicating that female contact persons are more common in this dataset when the title is specified."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > label",
            "value_counts_without_nan": {
                "Mevr.": 154,
                "Dhr.": 66
            },
            "type": "Categorical",
            "n_missing": 1658,
            "n": 1878,
            "p_distinct": 0.00909090909090909,
            "p_missing": 0.8828541001064962,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > label' contains formal title labels for contact persons, with only two distinct values: \"Mevr.\" (Mrs.) and \"Dhr.\" (Mr.). This categorical field is largely unpopulated, with 88.3% of the entries (1,658 out of 1,878 total records) being missing values. Where the data is present, \"Mevr.\" appears more frequently with 154 occurrences compared to \"Dhr.\" with 66 occurrences, suggesting that female contact persons are more common in the available data."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > kortLabel",
            "value_counts_without_nan": {
                "Mevrouw": 154,
                "Heer": 66
            },
            "type": "Categorical",
            "n_missing": 1658,
            "n": 1878,
            "p_distinct": 0.00909090909090909,
            "p_missing": 0.8828541001064962,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > aanspreekTitel > kortLabel' contains honorific titles used to address contact persons in job postings, with only two distinct values: \"Mevrouw\" (Mrs./Ms.) and \"Heer\" (Mr.). This categorical field is largely unpopulated, with 88.3% of the entries (1,658 out of 1,878 total records) being missing values. Where the field is populated, \"Mevrouw\" appears more frequently with 154 instances compared to \"Heer\" with 66 instances, suggesting that female contact persons are more common in the available data."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > fax",
            "value_counts_without_nan": {
                "03 600 79 69": 13,
                "056 24 12 92": 3,
                "09 233 28 25": 1,
                "056 36 41 63": 1,
                "000-000 00 00": 1,
                "02 270 25 96": 1,
                "058 33 00 46": 1,
                "015 30 53 00": 1,
                "02 775 76 11": 1,
                "050 79 18 40": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1845,
            "n": 1878,
            "p_distinct": 0.5757575757575758,
            "p_missing": 0.9824281150159745,
            "n_distinct": 19,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > fax' contains fax numbers for contact persons associated with job postings. This field is sparsely populated, with only about 1.8% of records (33 out of 1,878 total entries) containing fax numbers, while the vast majority (1,845 entries) are missing values. Among the provided fax numbers, there is relatively high variety with 19 distinct values, representing about 58% uniqueness among non-missing values. The most frequently occurring fax number is \"03 600 79 69\" which appears 13 times, followed by \"056 24 12 92\" appearing 3 times, while most other fax numbers appear only once, suggesting this is becoming an increasingly obsolete contact method."
        },
        {
            "column_name": "profiel > sollicitatieInfo > einddatumSollicitatie",
            "min": "2025-09-03 00:00:00",
            "value_counts_without_nan": {
                "2025-09-30 00:00:00": 5,
                "2025-09-09 00:00:00": 3,
                "2025-09-22 00:00:00": 2,
                "2025-09-03 00:00:00": 2,
                "2025-09-17 00:00:00": 2,
                "2025-09-15 00:00:00": 1,
                "2025-11-25 00:00:00": 1,
                "2025-09-04 00:00:00": 1,
                "2025-09-16 00:00:00": 1,
                "2025-09-07 00:00:00": 1
            },
            "type": "DateTime",
            "n_missing": 1859,
            "n": 1878,
            "max": "2025-11-25 00:00:00",
            "p_distinct": 0.5263157894736842,
            "p_missing": 0.9898828541001065,
            "n_distinct": 10,
            "description": "The column 'profiel > sollicitatieInfo > einddatumSollicitatie' appears to contain application deadline dates for job postings. It's a DateTime field that is sparsely populated, with only 19 non-null values out of 1,878 total records (98.99% missing values). The dates range from September 3, 2025, to November 25, 2025, with September 30, 2025, being the most common deadline date (occurring 5 times). There are 10 unique dates in total, with most deadlines falling in September 2025. The high percentage of missing values suggests that this field is optional and not consistently used across job postings."
        },
        {
            "column_name": "profiel > sollicitatieInfo > motivatieGewenst",
            "value_counts_without_nan": {
                "true": 82,
                "false": 8
            },
            "type": "Boolean",
            "n_missing": 1788,
            "n": 1878,
            "p_distinct": 0.022222222222222223,
            "p_missing": 0.952076677316294,
            "n_distinct": 2,
            "description": "The column 'profiel > sollicitatieInfo > motivatieGewenst' is a boolean field that indicates whether a motivation letter is required for the job application. Out of 1,878 total entries, only 90 (about 4.8%) have a specified value, with the vast majority (1,788 entries or 95.2%) being missing data. Among the non-missing values, 82 entries require a motivation letter (true) while 8 entries explicitly don't require one (false), showing a strong preference for requiring motivation letters when this information is specified."
        },
        {
            "column_name": "laatstePublicatieDatum",
            "min": "2025-01-21 00:00:00+00:00",
            "value_counts_without_nan": {
                "2025-10-10 00:00:00+00:00": 5,
                "2025-09-15 00:00:00+00:00": 3,
                "2025-08-18 00:00:00+00:00": 2,
                "2025-10-31 00:00:00+00:00": 2,
                "2025-09-22 00:00:00+00:00": 1,
                "2025-09-25 00:00:00+00:00": 1,
                "2025-09-17 00:00:00+00:00": 1,
                "2025-08-11 00:00:00+00:00": 1,
                "2025-02-03 00:00:00+00:00": 1,
                "2025-01-21 00:00:00+00:00": 1,
                "more ...": -1
            },
            "type": "DateTime",
            "n_missing": 1852,
            "n": 1878,
            "max": "2025-10-31 00:00:00+00:00",
            "p_distinct": 0.6923076923076923,
            "p_missing": 0.9861554845580405,
            "n_distinct": 18,
            "description": "The 'laatstePublicatieDatum' (last publication date) column contains datetime values with timezone information (UTC+00:00), ranging from January 21, 2025, to October 31, 2025. This column has a very high missing rate with 98.6% of its values (1,852 out of 1,878 records) being null. Among the 26 non-null values, there are 18 distinct dates, indicating some dates appear multiple times, with October 10, 2025, being the most frequent (5 occurrences), followed by September 15, 2025 (3 occurrences). The data suggests this column might be used to track future publication end dates for job postings, though its high missing rate indicates it's not consistently populated across the dataset."
        },
        {
            "column_name": "beheerder > email",
            "value_counts_without_nan": {
                "Gerda.Piens@vdab.be": 4,
                "Sigrid.Vanderstiggel@vdab.be": 3,
                "nancy.vervaet@vdab.be": 3,
                "oksana.willekens@vdab.be": 2,
                "sara.opsomer@vdab.be": 2,
                "virginie.gielen@vdab.be": 1,
                "an.geerdens@vdab.be": 1,
                "kevin.bemelmans@vdab.be": 1,
                "Sellem.Zahir@vdab.be": 1,
                "Sahila.ElBoudaati@vdab.be": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1850,
            "n": 1878,
            "p_distinct": 0.6785714285714286,
            "p_missing": 0.9850905218317358,
            "n_distinct": 19,
            "description": "The column 'beheerder > email' contains VDAB staff email addresses, but is largely unpopulated with 98.5% of the 1,878 records being missing values (1,850 null entries). Of the 28 non-null entries, there are 19 unique email addresses, indicating a diverse set of administrators. The most frequent email addresses belong to Gerda.Piens@vdab.be (4 occurrences), followed by Sigrid.Vanderstiggel@vdab.be and nancy.vervaet@vdab.be (3 occurrences each). All email addresses follow the pattern of firstname.lastname@vdab.be, suggesting these are official organizational email addresses for VDAB administrators."
        },
        {
            "column_name": "beheerder > gebruikersnaam",
            "value_counts_without_nan": {
                "GPIENS": 4,
                "SVDSTIGG": 3,
                "NVERVAET": 3,
                "OWILLEK1": 2,
                "SOPSOME1": 2,
                "VGIELEN2": 1,
                "AGEERDE1": 1,
                "KBEMELMA": 1,
                "SZAHIR": 1,
                "SELBOUDA": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1850,
            "n": 1878,
            "p_distinct": 0.6785714285714286,
            "p_missing": 0.9850905218317358,
            "n_distinct": 19,
            "description": "The column 'beheerder > gebruikersnaam' appears to be a text field containing administrator usernames, but it is very sparsely populated with data present in only about 1.5% of the records (28 out of 1,878 total entries). Where values do exist, they typically appear to be alphanumeric usernames in uppercase letters, with \"GPIENS\" being the most frequent (4 occurrences), followed by \"SVDSTIGG\" and \"NVERVAET\" (3 occurrences each). The column has 19 unique values in total, indicating a relatively high distinctness among the non-null values, with approximately 68% of the populated entries being unique usernames."
        },
        {
            "column_name": "beheerder > naam",
            "value_counts_without_nan": {
                "Gerda PIENS": 4,
                "Sigrid VANDERSTIGGEL": 3,
                "Nancy VERVAET": 3,
                "Oksana WILLEKENS": 2,
                "Sara OPSOMER": 2,
                "Virginie GIELEN": 1,
                "An GEERDENS": 1,
                "Kevin BEMELMANS": 1,
                "Sellem ZAHIR": 1,
                "Sahila EL BOUDAATI": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1850,
            "n": 1878,
            "p_distinct": 0.6785714285714286,
            "p_missing": 0.9850905218317358,
            "n_distinct": 19,
            "description": "The column 'beheerder > naam' appears to contain administrator or manager names in a full name format. Out of 1,878 total records, this column is largely empty with 1,850 missing values (98.5% missing rate). Among the 28 non-null entries, there are 19 unique names, suggesting these represent different administrators. The most frequent names are Gerda PIENS (4 occurrences), followed by Sigrid VANDERSTIGGEL and Nancy VERVAET (3 occurrences each). The format appears to be consistent with first name followed by capitalized surname. This column likely identifies the personnel responsible for managing or overseeing specific records in the system, though its high missing value rate suggests this information is not consistently recorded."
        },
        {
            "column_name": "beheerder > telefoon",
            "value_counts_without_nan": {
                "+32470972815": 4,
                "+32475827143": 2,
                " ": 2,
                "+32476951323": 1,
                "+32499594891": 1,
                "+32474570691": 1,
                "+32473652086": 1,
                "+32471792626": 1,
                "+32496628916": 1,
                "+32477890438": 1,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1859,
            "n": 1878,
            "p_distinct": 0.7368421052631579,
            "p_missing": 0.9898828541001065,
            "n_distinct": 14,
            "description": "The column 'beheerder > telefoon' contains phone numbers for administrators or managers, primarily in Belgian format (starting with +32). It is sparsely populated, with only 19 non-null values out of 1,878 total records (98.99% missing values). Among the non-null values, there is relatively high variety with 14 distinct phone numbers, representing about 73.7% distinctness among populated values. The most frequently occurring phone number appears 4 times (+32470972815), followed by another number occurring twice (+32475827143), with most other numbers appearing just once. The column also contains some blank spaces, suggesting potential data quality issues in a small number of entries."
        },
        {
            "column_name": "profiel > sollicitatieInfo > contactPersoon > functie",
            "value_counts_without_nan": {
                "Recruiter": 14,
                "Recruitment Manager": 13,
                "HR": 11,
                "Rekruteringsverantwoordelijke": 11,
                "HR Manager": 8,
                "Bestuurder": 7,
                "HR Business Partner": 6,
                "Talent Acquisition Partner": 4,
                "Talent Acquisition Specialist": 2,
                "Recruitment consultant": 2,
                "more ...": -1
            },
            "type": "Text",
            "n_missing": 1740,
            "n": 1878,
            "p_distinct": 0.427536231884058,
            "p_missing": 0.9265175718849841,
            "n_distinct": 59,
            "description": "The column 'profiel > sollicitatieInfo > contactPersoon > functie' contains job titles or roles of contact persons for job applications. Out of 1,878 total entries, only about 7.3% (138) have values while the vast majority (1,740 or 92.7%) are missing. Where populated, the column shows significant variety with 59 distinct job titles, with the most common being Recruiter (14 entries), Recruitment Manager (13 entries), HR and Rekruteringsverantwoordelijke (11 entries each), and HR Manager (8 entries). The data appears to be primarily focused on HR and recruitment-related roles, suggesting these are typically the designated contact persons for job applications."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus",
            "value_counts_without_nan": {
                "31": 4,
                "4.2": 1,
                "0401": 1
            },
            "type": "Text",
            "n_missing": 1872,
            "n": 1878,
            "p_distinct": 0.5,
            "p_missing": 0.9968051118210862,
            "n_distinct": 3,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > gestructureerdAdres > postbus' appears to contain postal box numbers, but is very sparsely populated with only 6 non-null values out of 1,878 total records (99.7% missing values). The column contains just three distinct values (\"31\", \"4.2\", and \"0401\"), with \"31\" being the most frequent, appearing 4 times. Despite containing what appear to be numeric values, the data is stored as text type, suggesting these postal box numbers should be treated as identifiers rather than numerical values."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeEindDatum",
            "min": "2025-08-27 00:00:00",
            "value_counts_without_nan": {
                "2025-12-31 00:00:00": 2,
                "2026-06-30 00:00:00": 2,
                "2026-08-31 00:00:00": 1,
                "2025-09-28 00:00:00": 1,
                "2025-08-27 00:00:00": 1,
                "2026-05-31 00:00:00": 1,
                "2025-12-19 00:00:00": 1,
                "2025-09-05 00:00:00": 1
            },
            "type": "DateTime",
            "n_missing": 1868,
            "n": 1878,
            "max": "2026-08-31 00:00:00",
            "p_distinct": 0.8,
            "p_missing": 0.9946751863684771,
            "n_distinct": 8,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeEindDatum' appears to contain expected end dates for employment contracts, stored as datetime values. This field is very sparsely populated, with only 10 non-null values out of 1,878 total records (99.47% missing data). The dates range from August 27, 2025 to August 31, 2026, with December 31, 2025 and June 30, 2026 being the most common end dates (each appearing twice). There are 8 unique dates in total, suggesting that when this field is populated, it tends to contain specific, individualized contract end dates rather than standardized timeframes."
        },
        {
            "column_name": "profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeAanwerfDatum",
            "min": "2025-03-03 00:00:00",
            "value_counts_without_nan": {
                "2025-07-28 00:00:00": 1,
                "2025-03-03 00:00:00": 1
            },
            "type": "DateTime",
            "n_missing": 1876,
            "n": 1878,
            "max": "2025-07-28 00:00:00",
            "p_distinct": 1.0,
            "p_missing": 0.9989350372736954,
            "n_distinct": 2,
            "description": "The column 'profiel > voorgesteldeArbeidsovereenkomst > vermoedelijkeAanwerfDatum' appears to contain expected hiring dates in datetime format. It is very sparsely populated, with only 2 non-null values out of 1,878 total entries (99.89% missing data). The two dates present are March 3, 2025, and July 28, 2025, each appearing once. This suggests the column is used to indicate potential future hiring dates, but is rarely utilized in the dataset."
        },
        {
            "column_name": "profiel > opdrachtgever > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen",
            "type": "Unsupported",
            "n_missing": 1874,
            "n": 1878,
            "p_missing": 0.9978700745473909,
            "description": "The column 'profiel > opdrachtgever > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen' appears to be an unsupported data type column that is almost entirely empty, with 99.79% of its values missing (1,874 missing values out of 1,878 total records). With only 4 non-missing values in the entire dataset, this column appears to be rarely used and likely contains unstructured address line information for the physical location of the client's contact method, though its exact content cannot be determined from the provided profiling data."
        },
        {
            "column_name": "leverancier > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen",
            "type": "Unsupported",
            "n_missing": 1873,
            "n": 1878,
            "p_missing": 0.9973375931842385,
            "description": "The column 'leverancier > contactMethode > fysiekeLocatie > onGestructureerdAdres > lijnen' appears to be an unsupported data type column that is almost entirely empty, with 99.73% of its values missing (1,873 missing values out of 1,878 total records). With only 5 non-missing values in the entire dataset, this column appears to be rarely used and likely contains unstructured address line information for physical locations of suppliers (leveranciers), though the exact format of the non-missing values cannot be determined from the provided profiling data."
        },
        {
            "column_name": "profiel > sollicitatieInfo > logischeLocatie > fax",
            "value_counts_without_nan": {
                "056 61 72 06": 1
            },
            "type": "Text",
            "n_missing": 1877,
            "n": 1878,
            "p_distinct": 1.0,
            "p_missing": 0.9994675186368477,
            "n_distinct": 1,
            "description": "The column 'profiel > sollicitatieInfo > logischeLocatie > fax' contains fax numbers for job application contact information. It is very sparsely populated, with only 1 entry out of 1,878 records (99.95% of values are missing). The single fax number present in the dataset is \"056 61 72 06\". This extremely low utilization rate suggests that fax numbers are rarely used as a means of contact for job applications in this dataset, which is consistent with modern business communication trends moving away from fax technology."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsNetCode > code",
            "value_counts_without_nan": {
                "0404": 1
            },
            "type": "Text",
            "n_missing": 1877,
            "n": 1878,
            "p_distinct": 1.0,
            "p_missing": 0.9994675186368477,
            "n_distinct": 1,
            "description": "The column 'onderwijsgegevens > onderwijsNetCode > code' appears to be a text field that is very sparsely populated in the dataset. Out of 1,878 total records, only 1 record contains a value (\"0404\"), while 1,877 records (99.95%) are missing values. This suggests that this field, which likely represents some form of educational network code, is either optional or only relevant for a very specific subset of the data."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsNetCode > label",
            "value_counts_without_nan": {
                "Wenst les te geven in het gemeentelijk, stedelijk en provinciaal onderwijs": 1
            },
            "type": "Text",
            "n_missing": 1877,
            "n": 1878,
            "p_distinct": 1.0,
            "p_missing": 0.9994675186368477,
            "n_distinct": 1,
            "description": "The column 'onderwijsgegevens > onderwijsNetCode > label' appears to be a text field that is very sparsely populated, with only 1 record containing data out of 1,878 total records (99.95% missing values). The only value that appears in this column is \"Wenst les te geven in het gemeentelijk, stedelijk en provinciaal onderwijs\" (indicating a preference to teach in municipal, city and provincial education). Given the high percentage of missing values and single unique value, this appears to be a specialized field that is only relevant for teaching positions within the Belgian education system."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsNetCode > kortLabel",
            "value_counts_without_nan": {
                "het gemeentelijk, stedelijk en provinciaal onderwijs": 1
            },
            "type": "Text",
            "n_missing": 1877,
            "n": 1878,
            "p_distinct": 1.0,
            "p_missing": 0.9994675186368477,
            "n_distinct": 1,
            "description": "The column 'onderwijsgegevens > onderwijsNetCode > kortLabel' appears to be a text field related to educational network codes, specifically containing labels for different types of educational institutions. The column is almost entirely empty, with 1,877 missing values out of 1,878 total records (99.95% missing). Only one record contains data, which has the value \"het gemeentelijk, stedelijk en provinciaal onderwijs\" (referring to municipal, city and provincial education). This suggests that this field is rarely used in the dataset and might be relevant only for specific education-related job postings."
        },
        {
            "column_name": "onderwijsgegevens > onderwijsVakken",
            "type": "Unsupported",
            "n_missing": 1877,
            "n": 1878,
            "p_missing": 0.9994675186368477,
            "description": "The column 'onderwijsgegevens > onderwijsVakken' appears to be an unsupported data type column that is almost entirely empty, with 1,877 missing values out of 1,878 total records (99.95% missing). This extremely high missing rate suggests that this field, which likely relates to educational subjects or courses (\"onderwijsVakken\" translates to \"educational subjects\" from Dutch), is rarely used in the dataset and may be an optional field that is only relevant for a very small subset of records."
        },
        {
            "column_name": "profiel > tewerkstellingsLocatie > bereikbaarheid",
            "value_counts_without_nan": {
                "We are located close to Ghent St. Peter’s Station. The hotel offers parking facilities as well as a bicycle storage area.": 1,
                "This can be a fully remote or a hybrid position, whichever you prefer (office location in Antwerp, Belgium).": 1
            },
            "type": "Text",
            "n_missing": 1876,
            "n": 1878,
            "p_distinct": 1.0,
            "p_missing": 0.9989350372736954,
            "n_distinct": 2,
            "description": "The column 'profiel > tewerkstellingsLocatie > bereikbaarheid' appears to contain accessibility or location-related information for job positions, but is very sparsely populated with data. Out of 1,878 total records, only 2 entries (0.11%) contain values, while 1,876 entries are missing. The existing entries describe either transportation accessibility details (like proximity to a train station and parking facilities) or remote work options. The text appears to be in English despite the Dutch column name, and each existing entry is unique, suggesting this is a free-form text field for describing how to reach or access the workplace location."
        }
    ]
}